#pragma once

// Rocket League (1.31) SDK

#ifdef _MSC_VER
	#pragma pack(push, 0x4)
#endif

namespace SDK
{
//---------------------------------------------------------------------------
//Constants
//---------------------------------------------------------------------------

#define CONST_InMatchmakingID                                    -2
#define CONST_MAX_CONTROLLER_IDS                                 4
#define CONST_EpochYear                                          1970
#define CONST_SecondsInMinute                                    60
#define CONST_SecondsInHour                                      3600
#define CONST_DEMO_VERSION                                       0
#define CONST_SecondsInMonth                                     2629743
#define CONST_MaxPing                                            1000.0f
#define CONST_SecondsInDay                                       86400
#define CONST_SecondsInYear                                      31556926
#define CONST_NumFriendsPerRequest                               100
#define CONST_FriendRequestPerFrame                              5

//---------------------------------------------------------------------------
//Enums
//---------------------------------------------------------------------------

// Enum ProjectX._Types_X.EJoinMatchType
enum class EJoinMatchType
{
	JMT_Public                     = 0,
	JMT_Private                    = 1,
	JMT_LanHost                    = 2,
	JMT_LanGuest                   = 3,
	JMT_MAX                        = 4
};


// Enum ProjectX._Types_X.EAuthResult
enum class EAuthResult
{
	AuthResult_OK                  = 0,
	AuthResult_Unauthorized        = 1,
	AuthResult_MAX                 = 2
};


// Enum ProjectX._Types_X.EWebRequestAuthorization
enum class EWebRequestAuthorization
{
	WRA_Offline                    = 0,
	WRA_Authorizing                = 1,
	WRA_Authorized                 = 2,
	WRA_Banned                     = 3,
	WRA_MAX                        = 4
};


// Enum ProjectX._Types_X.EReservationStatus
enum class EReservationStatus
{
	ReservationStatus_None         = 0,
	ReservationStatus_Reserved     = 1,
	ReservationStatus_Joining      = 2,
	ReservationStatus_InGame       = 3,
	ReservationStatus_MAX          = 4
};


// Enum ProjectX._Types_X.EDatabaseEnvironment
enum class EDatabaseEnvironment
{
	DBE_Test                       = 0,
	DBE_Dev                        = 1,
	DBE_DevLocal                   = 2,
	DBE_Production                 = 3,
	DBE_MAX                        = 4
};


// Enum ProjectX._Types_X.EAxisSign
enum class EAxisSign
{
	AxisSign_None                  = 0,
	AxisSign_Positive              = 1,
	AxisSign_Negative              = 2,
	AxisSign_MAX                   = 3
};


// Enum ProjectX._Types_X.EButtonPressType
enum class EButtonPressType
{
	BPT_Normal                     = 0,
	BPT_Tap                        = 1,
	BPT_Hold                       = 2,
	BPT_DoubleTap                  = 3,
	BPT_Toggle                     = 4,
	BPT_MAX                        = 5
};


// Enum ProjectX._Types_X.ERemappable
enum class ERemappable
{
	Remappable_All                 = 0,
	Remappable_Key                 = 1,
	Remappable_Axis                = 2,
	Remappable_KeyTriggerAxis      = 3,
	Remappable_None                = 4,
	Remappable_MAX                 = 5
};


// Enum ProjectX._Types_X.EUINavigationMode
enum class EUINavigationMode
{
	UINavigationMode_Keyboard      = 0,
	UINavigationMode_Gamepad       = 1,
	UINavigationMode_Cursor        = 2,
	UINavigationMode_MAX           = 3
};


// Enum ProjectX._Types_X.EPartyMatchmakingRestriction
enum class EPartyMatchmakingRestriction
{
	PMR_NotOriginalAppOwner        = 0,
	PMR_PendingLicenseAgreement    = 1,
	PMR_InMainMenu                 = 2,
	PMR_MAX                        = 3
};


// Enum ProjectX._Types_X.EPlayerTitleType
enum class EPlayerTitleType
{
	PlayerTitleType_None           = 0,
	PlayerTitleType_XP             = 1,
	PlayerTitleType_Developer      = 2,
	PlayerTitleType_Helper         = 3,
	PlayerTitleType_Participant    = 4,
	PlayerTitleType_Champion       = 5,
	PlayerTitleType_Ranked_Champion = 6,
	PlayerTitleType_RLCS_Champion  = 7,
	PlayerTitleType_MAX            = 8
};


// Enum ProjectX.AnimNodeSeries_X.EAnimNodeSeriesChild
enum class EAnimNodeSeriesChild
{
	AnimNodeSeries_Idle            = 0,
	AnimNodeSeries_Intro           = 1,
	AnimNodeSeries_Loop            = 2,
	AnimNodeSeries_Outro           = 3,
	AnimNodeSeries_MAX             = 4
};


// Enum ProjectX.BugReport_X.EFileTruncateType
enum class EFileTruncateType
{
	FileTruncate_None              = 0,
	FileTruncate_KeepStart         = 1,
	FileTruncate_KeepEnd           = 2,
	FileTruncate_MAX               = 3
};


// Enum ProjectX.FXActor_X.EFXComponentTarget
enum class EFXComponentTarget
{
	FXComponentTarget_All          = 0,
	FXComponentTarget_Local        = 1,
	FXComponentTarget_NonLocal     = 2,
	FXComponentTarget_MAX          = 3
};


// Enum ProjectX.FXActor_X.EFXComponentState
enum class EFXComponentState
{
	FXComponentState_Detached      = 0,
	FXComponentState_Attached      = 1,
	FXComponentState_PendingDetach = 2,
	FXComponentState_MAX           = 3
};


// Enum ProjectX.GFxDataCallback_X.EDataCallbackType
enum class EDataCallbackType
{
	DataCallbackType_All           = 0,
	DataCallbackType_Table         = 1,
	DataCallbackType_Row           = 2,
	DataCallbackType_Value         = 3,
	DataCallbackType_MAX           = 4
};


// Enum ProjectX.MatchmakingReporter.EMatchmakingState
enum class EMatchmakingState
{
	MMState_None                   = 0,
	MMState_SearchingLan           = 1,
	MMState_SearchingInternet      = 2,
	MMState_FilteringResults       = 3,
	MMState_AttemptingJoin         = 4,
	MMState_Finished               = 5,
	MMState_MAX                    = 6
};


// Enum ProjectX.MatchmakingReporter.EMatchmakingInfoSeverity
enum class EMatchmakingInfoSeverity
{
	MMSeverity_Log                 = 0,
	MMSeverity_Warning             = 1,
	MMSeverity_Error               = 2,
	MMSeverity_Suppressed          = 3,
	MMSeverity_MAX                 = 4
};


// Enum ProjectX.MaterialEffect_X.EMaterialEffectStage
enum class EMaterialEffectStage
{
	EFFECT_INACTIVE                = 0,
	EFFECT_FADE_IN                 = 1,
	EFFECT_ACTIVE                  = 2,
	EFFECT_FADE_OUT                = 3,
	EFFECT_MAX                     = 4
};


// Enum ProjectX.OnlineGameDLC_X.DLCOwnershipState
enum class DLCOwnershipState
{
	DLCOwnershipState_Unknown      = 0,
	DLCOwnershipState_Owned        = 1,
	DLCOwnershipState_NotOwned     = 2,
	DLCOwnershipState_Error        = 3,
	DLCOwnershipState_MAX          = 4
};


// Enum ProjectX.OnlineGameParty_X.PartyProcessingStatus
enum class PartyProcessingStatus
{
	PPS_None                       = 0,
	PPS_Create                     = 1,
	PPS_Join                       = 2,
	PPS_MAX                        = 3
};


// Enum ProjectX.ReservationsPasswordMessage_X.EPasswordFailureReason
enum class EPasswordFailureReason
{
	PFR_Empty                      = 0,
	PFR_Mismatch                   = 1,
	PFR_MAX                        = 2
};


// Enum ProjectX.ShakeComponent_X.EShakeReceiver
enum class EShakeReceiver
{
	ShakeReceiver_All              = 0,
	ShakeReceiver_Local            = 1,
	ShakeReceiver_NonLocal         = 2,
	ShakeReceiver_MAX              = 3
};


// Enum ProjectX.TcpConnection.EWebSocketState
enum class EWebSocketState
{
	WebSocketState_NotRequired     = 0,
	WebSocketState_NeedsHandshake  = 1,
	WebSocketState_Connected       = 2,
	WebSocketState_MAX             = 3
};


// Enum ProjectX.TcpConnection.ETcpConnectionState
enum class ETcpConnectionState
{
	TcpConnectionState_Invalid     = 0,
	TcpConnectionState_Connecting  = 1,
	TcpConnectionState_Connected   = 2,
	TcpConnectionState_Disconnected = 3,
	TcpConnectionState_MAX         = 4
};


// Enum ProjectX.UIAnimSequence_X.EAnimBlendMode
enum class EAnimBlendMode
{
	Blend_Set                      = 0,
	Blend_Add                      = 1,
	Blend_ReversedSet              = 2,
	Blend_ReversedAdd              = 3,
	BLEND_MAX                      = 4
};


// Enum ProjectX.UIWidget_X.EDockPoint
enum class EDockPoint
{
	Dock_None                      = 0,
	Dock_TopLeft                   = 1,
	Dock_Top                       = 2,
	Dock_TopRight                  = 3,
	Dock_Left                      = 4,
	Dock_Center                    = 5,
	Dock_Right                     = 6,
	Dock_BottomLeft                = 7,
	Dock_Bottom                    = 8,
	Dock_BottomRight               = 9,
	Dock_MAX                       = 10
};


// Enum ProjectX.UIWidget_X.EWidgetVisibility
enum class EWidgetVisibility
{
	Visibility_Visible             = 0,
	Visibility_Hidden              = 1,
	Visibility_Collapsed           = 2,
	Visibility_MAX                 = 3
};


// Enum ProjectX.UIWidget_X.EWidgetFocusType
enum class EWidgetFocusType
{
	FocusType_None                 = 0,
	FocusType_Full                 = 1,
	FocusType_CursorOnly           = 2,
	FocusType_MAX                  = 3
};


// Enum ProjectX.UIWidget_WrappedText_X.ETextAlign
enum class ETextAlign
{
	TextAlign_Left                 = 0,
	TextAlign_Center               = 1,
	TextAlign_Right                = 2,
	TextAlign_MAX                  = 3
};


// Enum ProjectX.UIWidget_Stack_X.EStackOrientation
enum class EStackOrientation
{
	STACK_Vertical                 = 0,
	STACK_Horizontal               = 1,
	STACK_MAX                      = 2
};


// Enum ProjectX.WebRequest_X.EWebRequestState
enum class EWebRequestState
{
	WebRequestState_PendingSend    = 0,
	WebRequestState_PendingResponse = 1,
	WebRequestState_Success        = 2,
	WebRequestState_Error          = 3,
	WebRequestState_MAX            = 4
};


// Enum ProjectX.FakeData_X.FakeDataEnum
enum class FakeDataEnum
{
	FakeData                       = 0,
	FakeData01                     = 1,
	FakeData02                     = 2,
	FakeData_Count                 = 3,
	FakeData_MAX                   = 4
};


// Enum ProjectX.ClanforgeReservation_X.EReserveState
enum class EReserveState
{
	ReserveState_Unitialized       = 0,
	ReserveState_Unreserved        = 1,
	ReserveState_Reserved          = 2,
	ReserveState_MAX               = 3
};



//---------------------------------------------------------------------------
//Classes
//---------------------------------------------------------------------------

// Class ProjectX._SharedHelpers
// 0x0000 (0x003C - 0x003C)
class U_SharedHelpers : public UObject
{
public:

	static UClass* StaticClass()
	{
		static auto ptr = UObject::FindClass("Class ProjectX._SharedHelpers");
		return ptr;
	}


	int STATIC_ScoreDeltaFromDefault(class UObject* Object);
	int STATIC_FindNetId(const struct FUniqueNetId& FindId, TArray<struct FUniqueNetId>* List);
	void STATIC_DrawShadowedText(class UCanvas* Canvas, const struct FString& Text, int ShadowOffsetX, int ShadowOffsetY, int ShadowAlpha);
	bool STATIC_IsInTransientPackage(class UObject* Obj);
	class APlayerController* STATIC_GetAPlayerController(class UClass* PlayerControllerClass);
	class UObject* STATIC_GetDefaultObject(class UClass* ObjClass);
	void STATIC_DumpUnreferencedAnims();
	struct FString STATIC_GetLanguageExtension();
};


// Class ProjectX._Types_X
// 0x0020 (0x005C - 0x003C)
class U_Types_X : public UObject
{
public:
	struct FScriptDelegate                             __KeyPressDelegate__Delegate;                     		// 0x003C(0x000C) (CPF_NeedCtorLink)
	unsigned char                                      UnknownData00[0x4];                               		// 0x003C(0x0004) FIX WRONG TYPE SIZE OF PREVIUS PROPERTY
	struct FScriptDelegate                             __OnPriviledgeChecked__Delegate;                  		// 0x004C(0x000C) (CPF_NeedCtorLink)
	unsigned char                                      UnknownData01[0x4];                               		// 0x004C(0x0004) FIX WRONG TYPE SIZE OF PREVIUS PROPERTY

	static UClass* StaticClass()
	{
		static auto ptr = UObject::FindClass("Class ProjectX._Types_X");
		return ptr;
	}


	struct FIntVector3 STATIC_ToIntVector3(const struct FVector& V);
	void OnPriviledgeChecked(class UPrivilegeCheck_X* PrivilegeCheck);
	bool KeyPressDelegate();
};


// Class ProjectX.ActorComponent_X
// 0x0007 (0x006C - 0x0065)
class UActorComponent_X : public UActorComponent
{
public:
	unsigned char                                      UnknownData00[0x3];                               		// 0x0065(0x0003) MISSED OFFSET
	unsigned long                                      bTick : 1;                                        		// 0x0068(0x0004)
	unsigned long                                      bIgnoreScriptAttach : 1;                          		// 0x0068(0x0004) (CPF_Const, CPF_Transient)

	static UClass* StaticClass()
	{
		static auto ptr = UObject::FindClass("Class ProjectX.ActorComponent_X");
		return ptr;
	}


	void Reattach();
	void Tick(float DeltaTime);
	void Detached();
	void Attached();
	void BeginPlay();
};


// Class ProjectX.ExplosionComponent_X
// 0x0034 (0x00A0 - 0x006C)
class UExplosionComponent_X : public UActorComponent_X
{
public:
	class UDamageComponent_X*                          DamageComponent;                                  		// 0x006C(0x0004) (CPF_Edit, CPF_ExportObject, CPF_Component, CPF_EditInline)
	float                                              StartRadius;                                      		// 0x0070(0x0004) (CPF_Edit)
	float                                              EndRadius;                                        		// 0x0074(0x0004) (CPF_Edit)
	float                                              Speed;                                            		// 0x0078(0x0004) (CPF_Edit)
	float                                              Falloff;                                          		// 0x007C(0x0004) (CPF_Edit)
	unsigned long                                      bPassThroughWorldGeometry : 1;                    		// 0x0080(0x0004) (CPF_Edit)
	unsigned long                                      bIgnoreInstigator : 1;                            		// 0x0080(0x0004) (CPF_Edit)
	unsigned long                                      bDebug : 1;                                       		// 0x0080(0x0004) (CPF_Edit)
	struct FVector                                     MomentumOffset;                                   		// 0x0084(0x000C) (CPF_Edit)
	float                                              Lifetime;                                         		// 0x0090(0x0004) (CPF_Transient)
	TArray<class AActor*>                              DamagedActors;                                    		// 0x0094(0x000C) (CPF_Transient, CPF_NeedCtorLink)

	static UClass* StaticClass()
	{
		static auto ptr = UObject::FindClass("Class ProjectX.ExplosionComponent_X");
		return ptr;
	}


	void ProcessHit(class AActor* Victim, const struct FVector& HitLocation, const struct FTraceHitInfo& ExtraHitInfo, float DamageScale);
	void Detached();
};


// Class ProjectX.MICParamDispenserComponent_X
// 0x000C (0x0078 - 0x006C)
class UMICParamDispenserComponent_X : public UActorComponent_X
{
public:
	struct FPointer                                    VfTable_IISetParameter;                           		// 0x006C(0x0004) (CPF_Const, CPF_Native, CPF_NoExport)
	int                                                MaterialIndex;                                    		// 0x0070(0x0004) (CPF_Edit)
	class UMeshComponent*                              MeshComp;                                         		// 0x0074(0x0004) (CPF_ExportObject, CPF_Component, CPF_EditInline)

	static UClass* StaticClass()
	{
		static auto ptr = UObject::FindClass("Class ProjectX.MICParamDispenserComponent_X");
		return ptr;
	}


	void Attached();
	void SetLinearColorParameter(const struct FName& Key, const struct FLinearColor& Value);
	void SetVectorParameter(const struct FName& Key, const struct FVector& Value);
	void SetFloatParameter(const struct FName& Key, float Value);
	void SetNameParameter(const struct FName& Key, const struct FName& Value);
};


// Class ProjectX.ShakeComponent_X
// 0x00D8 (0x0144 - 0x006C)
class UShakeComponent_X : public UActorComponent_X
{
public:
	float                                              InnerRadius;                                      		// 0x006C(0x0004) (CPF_Edit)
	float                                              OuterRadius;                                      		// 0x0070(0x0004) (CPF_Edit)
	float                                              Falloff;                                          		// 0x0074(0x0004) (CPF_Edit)
	unsigned long                                      bAutoPlay : 1;                                    		// 0x0078(0x0004) (CPF_Edit)
	unsigned long                                      bAutoDetach : 1;                                  		// 0x0078(0x0004) (CPF_Edit)
	unsigned long                                      bOnlyAffectPlayersWithPawns : 1;                  		// 0x0078(0x0004) (CPF_Edit)
	unsigned long                                      bAttenuate : 1;                                   		// 0x0078(0x0004) (CPF_Edit)
	unsigned long                                      bPlaying : 1;                                     		// 0x0078(0x0004) (CPF_Transient)
	unsigned long                                      bStopping : 1;                                    		// 0x0078(0x0004) (CPF_Transient)
	TEnumAsByte<enum class EShakeReceiver>             Receiver;                                         		// 0x007C(0x0001) (CPF_Edit)
	unsigned char                                      UnknownData00[0x3];                               		// 0x007D(0x0003) MISSED OFFSET
	float                                              RadiusScale;                                      		// 0x0080(0x0004) (CPF_Edit)
	float                                              BlendInTime;                                      		// 0x0084(0x0004) (CPF_Edit)
	float                                              BlendOutTime;                                     		// 0x0088(0x0004) (CPF_Edit)
	class UCameraShake*                                ShakeParams;                                      		// 0x008C(0x0004) (CPF_Edit)
	struct FRawDistributionFloat                       AmplitudeScale;                                   		// 0x0090(0x001C) (CPF_Edit, CPF_Component, CPF_NeedCtorLink)
	struct FRawDistributionFloat                       FrequencyScale;                                   		// 0x00AC(0x001C) (CPF_Edit, CPF_Component, CPF_NeedCtorLink)
	struct FRawDistributionFloat                       DurationScale;                                    		// 0x00C8(0x001C) (CPF_Edit, CPF_Component, CPF_NeedCtorLink)
	float                                              CurrentAmplitudeScale;                            		// 0x00E4(0x0004) (CPF_Const, CPF_Transient)
	float                                              CurrentFrequencyScale;                            		// 0x00E8(0x0004) (CPF_Const, CPF_Transient)
	class UForceFeedbackWaveform*                      ForceFeedbackWaveform;                            		// 0x00EC(0x0004) (CPF_Edit)
	float                                              ForceFeedbackScale;                               		// 0x00F0(0x0004) (CPF_Edit)
	float                                              ForceFeedbackBalance;                             		// 0x00F4(0x0004) (CPF_Edit)
	TArray<struct FParticleSysParam>                   InstanceParameters;                               		// 0x00F8(0x000C) (CPF_Edit, CPF_NeedCtorLink, CPF_EditInline)
	float                                              PlayTime;                                         		// 0x0104(0x0004) (CPF_Transient)
	float                                              StopTime;                                         		// 0x0108(0x0004) (CPF_Transient)
	struct FVector                                     ShakeLocTimeOffset;                               		// 0x010C(0x000C) (CPF_Transient)
	struct FVector                                     ShakeRotTimeOffset;                               		// 0x0118(0x000C) (CPF_Transient)
	float                                              ShakeFOVTimeOffset;                               		// 0x0124(0x0004) (CPF_Transient)
	float                                              CameraShakeDuration;                              		// 0x0128(0x0004) (CPF_Transient)
	float                                              ForceFeedbackDuration;                            		// 0x012C(0x0004) (CPF_Transient)
	float                                              ForceFeedbackSamplesTime;                         		// 0x0130(0x0004) (CPF_Transient)
	class AActor*                                      PrevOwner;                                        		// 0x0134(0x0004) (CPF_Transient)
	TArray<struct FShakeReceiver>                      Receivers;                                        		// 0x0138(0x000C) (CPF_Transient, CPF_NeedCtorLink)

	static UClass* StaticClass()
	{
		static auto ptr = UObject::FindClass("Class ProjectX.ShakeComponent_X");
		return ptr;
	}


	bool GetColorParameter(const struct FName& InName, struct FColor* OutColor);
	bool GetVectorParameter(const struct FName& InName, struct FVector* OutVector);
	bool GetFloatParameter(const struct FName& InName, float* OutFloat);
	void SetColorParameter(const struct FName& ParameterName, const struct FColor& Param);
	void SetVectorRandParameter(const struct FName& ParameterName, struct FVector* Param, struct FVector* ParamLow);
	void SetVectorParameter(const struct FName& ParameterName, const struct FVector& Param);
	void SetFloatRandParameter(const struct FName& ParameterName, float Param, float ParamLow);
	void SetFloatParameter(const struct FName& ParameterName, float Param);
	bool IsPlaying();
	void StopShake(float InBlendOutTime);
	void InitParams();
	void PlayShake();
	void Detached();
	void Attached();
};


// Class ProjectX.FXActor_X
// 0x005C (0x0248 - 0x01EC)
class AFXActor_X : public AActor
{
public:
	class UFXActorEvent_X*                             SpawnState;                                       		// 0x01EC(0x0004)
	class UFXActorEvent_X*                             ActivationState;                                  		// 0x01F0(0x0004)
	TArray<struct FFXAttachment>                       Attachments;                                      		// 0x01F4(0x000C) (CPF_Edit, CPF_Component, CPF_NeedCtorLink)
	struct FName                                       SocketOrBoneName;                                 		// 0x0200(0x0008) (CPF_Edit)
	unsigned long                                      bDeactivateWhenOwnerDestroyed : 1;                		// 0x0208(0x0004) (CPF_Edit)
	unsigned long                                      bAllowShadowCasting : 1;                          		// 0x0208(0x0004) (CPF_Edit)
	unsigned long                                      bActive : 1;                                      		// 0x0208(0x0004) (CPF_Transient)
	unsigned long                                      bPendingDestroy : 1;                              		// 0x0208(0x0004) (CPF_Transient)
	unsigned long                                      bHadOwner : 1;                                    		// 0x0208(0x0004) (CPF_Const, CPF_Transient)
	class AFXActor_X*                                  Parent;                                           		// 0x020C(0x0004) (CPF_Edit)
	class AActor*                                      AttachmentActor;                                  		// 0x0210(0x0004) (CPF_Transient)
	TArray<class UFXActorEvent_X*>                     FXStates;                                         		// 0x0214(0x000C) (CPF_Transient, CPF_NeedCtorLink)
	class UParameterDispenser_X*                       Parameters;                                       		// 0x0220(0x0004) (CPF_Edit, CPF_ExportObject, CPF_Component, CPF_EditInline)
	int                                                EditID;                                           		// 0x0224(0x0004) (CPF_Edit, CPF_Const, CPF_EditConst)
	struct FScriptDelegate                             __EventFXStatePushed__Delegate;                   		// 0x0228(0x000C) (CPF_NeedCtorLink)
	unsigned char                                      UnknownData00[0x4];                               		// 0x0228(0x0004) FIX WRONG TYPE SIZE OF PREVIUS PROPERTY
	struct FScriptDelegate                             __EventFXStatePopped__Delegate;                   		// 0x0238(0x000C) (CPF_NeedCtorLink)
	unsigned char                                      UnknownData01[0x4];                               		// 0x0238(0x0004) FIX WRONG TYPE SIZE OF PREVIUS PROPERTY

	static UClass* StaticClass()
	{
		static auto ptr = UObject::FindClass("Class ProjectX.FXActor_X");
		return ptr;
	}


	void Destroyed();
	void TickFX(float DeltaTime);
	void OnToggle(class USeqAct_Toggle* Action);
	void OnTriggerFXActor_X(class USeqAct_TriggerFXActor_X* SeqAct);
	void Inherit(class AFXActor_X* Other);
	void CopyFrom(class AFXActor_X* Other);
	void ResetParticles();
	void StopAllEffects();
	void DeactivateAndDestroy();
	void OnDetached(class UActorComponent* AC);
	void DeactivateFXComponent(class UActorComponent* AC);
	void ActivateFXComponent(class UActorComponent* AC);
	void OnAttached(class UActorComponent* AC);
	void UpdateFXStates();
	bool IsLocallyControlled();
	void ToggleState(class UFXActorEvent_X* NewState);
	void RemoveState(class UFXActorEvent_X* OldState);
	void AddState(class UFXActorEvent_X* NewState);
	bool IsStateActive(class UFXActorEvent_X* InState);
	void Deactivate();
	void Activate();
	void HandleParentStatePopped(class AFXActor_X* P, class UFXActorEvent_X* Event);
	void HandleParentStatePushed(class AFXActor_X* P, class UFXActorEvent_X* Event);
	void BindTo(class AFXActor_X* ParentFXActor);
	void SetAttachmentActor(class AActor* AttachToActor);
	void PostBeginPlay();
	void AllAttachments(class UClass* ComponentClass, class UActorComponent** OutComponent, int* OutAttachmentIdx);
	class UActorComponent* GetComponentByName(class UClass* ComponentClass, const struct FName& ComponentName);
	void EventFXStatePopped(class AFXActor_X* FXActor, class UFXActorEvent_X* Event);
	void EventFXStatePushed(class AFXActor_X* FXActor, class UFXActorEvent_X* Event);
};


// Class ProjectX.AnimateParametersComponent_X
// 0x0033 (0x0098 - 0x0065)
class UAnimateParametersComponent_X : public UActorComponent
{
public:
	unsigned char                                      UnknownData00[0x3];                               		// 0x0065(0x0003) MISSED OFFSET
	TArray<struct FAnimatedFloatParam>                 FloatParameters;                                  		// 0x0068(0x000C) (CPF_Edit, CPF_NeedCtorLink)
	TArray<struct FAnimatedVectorParam>                VectorParameters;                                 		// 0x0074(0x000C) (CPF_Edit, CPF_NeedCtorLink)
	TArray<struct FAnimatedLinearColorParam>           ColorParameters;                                  		// 0x0080(0x000C) (CPF_Edit, CPF_NeedCtorLink)
	unsigned long                                      bResetMaterialsOnComplete : 1;                    		// 0x008C(0x0004) (CPF_Edit)
	float                                              AnimTime;                                         		// 0x0090(0x0004) (CPF_Transient)
	float                                              EndTime;                                          		// 0x0094(0x0004) (CPF_Const, CPF_Transient)

	static UClass* StaticClass()
	{
		static auto ptr = UObject::FindClass("Class ProjectX.AnimateParametersComponent_X");
		return ptr;
	}

};


// Class ProjectX.ArchetypePrefab_X
// 0x0018 (0x0204 - 0x01EC)
class AArchetypePrefab_X : public AActor
{
public:
	TArray<class AActor*>                              PrefabArchetypes;                                 		// 0x01EC(0x000C) (CPF_Edit, CPF_NeedCtorLink)
	TArray<class AActor*>                              ArchetypeInstances;                               		// 0x01F8(0x000C) (CPF_Const, CPF_Transient, CPF_NeedCtorLink)

	static UClass* StaticClass()
	{
		static auto ptr = UObject::FindClass("Class ProjectX.ArchetypePrefab_X");
		return ptr;
	}

};


// Class ProjectX.ArchetypeSpawnPoint_X
// 0x0044 (0x0230 - 0x01EC)
class AArchetypeSpawnPoint_X : public AActor
{
public:
	struct FPointer                                    VfTable_IInterface_NavMeshPathObject;             		// 0x01EC(0x0004) (CPF_Const, CPF_Native, CPF_NoExport)
	struct FString                                     ArchetypePath;                                    		// 0x01F0(0x000C) (CPF_Edit, CPF_Const, CPF_NeedCtorLink)
	unsigned long                                      bSeedNavMesh : 1;                                 		// 0x01FC(0x0004) (CPF_Edit)
	unsigned long                                      bSpawnOnLevelStart : 1;                           		// 0x01FC(0x0004) (CPF_Edit)
	unsigned long                                      bOnlyAllowOneInstance : 1;                        		// 0x01FC(0x0004) (CPF_Edit)
	class AActor*                                      ActorArchetype;                                   		// 0x0200(0x0004) (CPF_Edit)
	class USpriteComponent*                            PlacementSprite;                                  		// 0x0204(0x0004) (CPF_ExportObject, CPF_Component, CPF_EditInline)
	class USkeletalMeshComponent*                      ArchetypeSkeletalMesh;                            		// 0x0208(0x0004) (CPF_ExportObject, CPF_Component, CPF_EditInline)
	class UStaticMeshComponent*                        ArchetypeStaticMesh;                              		// 0x020C(0x0004) (CPF_ExportObject, CPF_Component, CPF_EditInline)
	TArray<class AActor*>                              SpawnedActors;                                    		// 0x0210(0x000C) (CPF_Transient, CPF_NeedCtorLink)
	class AActor*                                      SpawnedActor;                                     		// 0x021C(0x0004) (CPF_Transient)
	struct FScriptDelegate                             __EventSpawned__Delegate;                         		// 0x0220(0x000C) (CPF_NeedCtorLink)
	unsigned char                                      UnknownData00[0x4];                               		// 0x0220(0x0004) FIX WRONG TYPE SIZE OF PREVIUS PROPERTY

	static UClass* StaticClass()
	{
		static auto ptr = UObject::FindClass("Class ProjectX.ArchetypeSpawnPoint_X");
		return ptr;
	}


	void OnSpawned(class AActor* Spawned);
	class AActor* DoSpawn();
	void OnToggle(class USeqAct_Toggle* Action);
	void OnDestroy(class USeqAct_Destroy* Action);
	void PostBeginPlay();
	void EventSpawned(class AArchetypeSpawnPoint_X* SpawnPoint, class AActor* Spawned);
};


// Class ProjectX.Aws4Signature_X
// 0x0000 (0x003C - 0x003C)
class UAws4Signature_X : public UObject
{
public:

	static UClass* StaticClass()
	{
		static auto ptr = UObject::FindClass("Class ProjectX.Aws4Signature_X");
		return ptr;
	}


	void STATIC_SignRequest(class UHttpRequestInterface* HTTPRequest);
};


// Class ProjectX.TcpBeacon
// 0x004C (0x0094 - 0x0048)
class UTcpBeacon : public UComponent
{
public:
	struct FPointer                                    VfTable_FTickableObject;                          		// 0x0048(0x0004) (CPF_Const, CPF_Native, CPF_NoExport)
	int                                                MaxConnections;                                   		// 0x004C(0x0004) (CPF_Config)
	int                                                ListenPort;                                       		// 0x0050(0x0004) (CPF_Config)
	struct FString                                     ConnectionClassName;                              		// 0x0054(0x000C) (CPF_Config, CPF_NeedCtorLink)
	class UClass*                                      ConnectionClass;                                  		// 0x0060(0x0004)
	struct FPointer                                    ListenSocket;                                     		// 0x0064(0x0004) (CPF_Const, CPF_Native, CPF_Transient)
	TArray<class UTcpConnection*>                      Connections;                                      		// 0x0068(0x000C) (CPF_Const, CPF_Transient, CPF_NeedCtorLink)
	struct FScriptDelegate                             __EventConnected__Delegate;                       		// 0x0074(0x000C) (CPF_NeedCtorLink)
	unsigned char                                      UnknownData00[0x4];                               		// 0x0074(0x0004) FIX WRONG TYPE SIZE OF PREVIUS PROPERTY
	struct FScriptDelegate                             __EventDisconnected__Delegate;                    		// 0x0084(0x000C) (CPF_NeedCtorLink)
	unsigned char                                      UnknownData01[0x4];                               		// 0x0084(0x0004) FIX WRONG TYPE SIZE OF PREVIUS PROPERTY

	static UClass* StaticClass()
	{
		static auto ptr = UObject::FindClass("Class ProjectX.TcpBeacon");
		return ptr;
	}


	void OnDisconnected(class UTcpConnection* Connection);
	void OnConnected(class UTcpConnection* Connection);
	void OnConnectionRemoved(class UTcpConnection* Connection);
	void OnConnectionAdded(class UTcpConnection* Connection);
	class UTcpConnection* GetConnection(const struct FString& Address);
	void Close();
	struct FString GetExternalHostAddress();
	struct FString GetLocalHostAddress();
	bool BeginListen();
	class UTcpConnection* BeginConnect(const struct FString& Address);
	void EventDisconnected(class UTcpBeacon* Beacon, class UTcpConnection* Connection);
	void EventConnected(class UTcpBeacon* Beacon, class UTcpConnection* Connection);
};


// Class ProjectX.TcpMessageBeacon
// 0x0020 (0x00B4 - 0x0094)
class UTcpMessageBeacon : public UTcpBeacon
{
public:
	class UOnlineMessageComponent_X*                   MessageComponent;                                 		// 0x0094(0x0004) (CPF_Const, CPF_ExportObject, CPF_Component, CPF_EditInline)
	TArray<struct FTcpMessageHandler>                  MessageHandlers;                                  		// 0x0098(0x000C) (CPF_Const, CPF_Transient, CPF_NeedCtorLink)
	struct FScriptDelegate                             __MessageReceivedDelegate__Delegate;              		// 0x00A4(0x000C) (CPF_NeedCtorLink)
	unsigned char                                      UnknownData00[0x4];                               		// 0x00A4(0x0004) FIX WRONG TYPE SIZE OF PREVIUS PROPERTY

	static UClass* StaticClass()
	{
		static auto ptr = UObject::FindClass("Class ProjectX.TcpMessageBeacon");
		return ptr;
	}


	void BroadcastMessage(class UObject* Message);
	void SendMessage(class UTcpConnection* Connection, class UObject* Message);
	class UBeaconMessage_X* CreateMessage(class UClass* MessageClass);
	void RemoveMessageHandler(const struct FScriptDelegate& Callback);
	void AddMessageHandler(class UClass* MessageClass, const struct FScriptDelegate& Callback);
	void MessageReceivedDelegate(class UTcpConnection* Connection, class UObject* Message);
};


// Class ProjectX.BeaconMessage_X
// 0x0000 (0x003C - 0x003C)
class UBeaconMessage_X : public UObject
{
public:

	static UClass* StaticClass()
	{
		static auto ptr = UObject::FindClass("Class ProjectX.BeaconMessage_X");
		return ptr;
	}


	class UBeaconMessage_X* Broadcast();
	class UBeaconMessage_X* Send(class UTcpConnection* Connection);
};


// Class ProjectX.BugReport_X
// 0x00FC (0x0138 - 0x003C)
class UBugReport_X : public UObject
{
public:
	struct FPointer                                    VfTable_FTickableObject;                          		// 0x003C(0x0004) (CPF_Const, CPF_Native, CPF_NoExport)
	struct FString                                     BugReportClassName;                               		// 0x0040(0x000C) (CPF_Config, CPF_GlobalConfig, CPF_NeedCtorLink)
	unsigned long                                      bEnableClientReports : 1;                         		// 0x004C(0x0004) (CPF_Edit, CPF_Config, CPF_GlobalConfig)
	unsigned long                                      bEnableServerReports : 1;                         		// 0x004C(0x0004) (CPF_Edit, CPF_Config, CPF_GlobalConfig)
	unsigned long                                      bUploadNextFile : 1;                              		// 0x004C(0x0004) (CPF_Const, CPF_Transient)
	unsigned long                                      bSubmitted : 1;                                   		// 0x004C(0x0004) (CPF_Const, CPF_Transient)
	struct FString                                     URL;                                              		// 0x0050(0x000C) (CPF_Edit, CPF_NeedCtorLink)
	int                                                MaxFileSizeMetabytes;                             		// 0x005C(0x0004) (CPF_Edit)
	struct FString                                     BugID;                                            		// 0x0060(0x000C) (CPF_Const, CPF_Transient, CPF_NeedCtorLink)
	struct FBugReportSubmitterData                     SubmitterData;                                    		// 0x006C(0x0028) (CPF_Const, CPF_Transient, CPF_NeedCtorLink)
	struct FBugReportSystemData                        SystemData;                                       		// 0x0094(0x0028) (CPF_Const, CPF_Transient, CPF_NeedCtorLink)
	struct FBugReportPathData                          PathData;                                         		// 0x00BC(0x0030) (CPF_Const, CPF_Transient, CPF_NeedCtorLink)
	struct FBugReportDescriptionData                   DescriptionData;                                  		// 0x00EC(0x003C) (CPF_Const, CPF_Transient, CPF_NeedCtorLink)
	struct FPointer                                    LogFile;                                          		// 0x0128(0x0004) (CPF_Const, CPF_Native, CPF_Transient)
	TArray<struct FFileUploadData>                     FileUploads;                                      		// 0x012C(0x000C) (CPF_Const, CPF_Transient, CPF_NeedCtorLink)

	static UClass* StaticClass()
	{
		static auto ptr = UObject::FindClass("Class ProjectX.BugReport_X");
		return ptr;
	}


	void HandleHttpRequestComplete(class UHttpRequestInterface* OriginalRequest, class UHttpResponseInterface* InHttpResponse, bool bDidSucceed);
	void LogText(const struct FString& Str);
	void PDIReport();
	void CancelBugReport();
	void SubmitBugReport(const struct FString& Title, const struct FString& Description, const struct FString& Email);
	void StartBugReport();
	void STATIC_StaticSubmitBugReport(const struct FString& Title);
	class UBugReport_X* STATIC_CreateBugReport();
};


// Class ProjectX.CachedWebData_X
// 0x0028 (0x0064 - 0x003C)
class UCachedWebData_X : public UObject
{
public:
	TArray<unsigned char>                              Data;                                             		// 0x003C(0x000C) (CPF_Const, CPF_NeedCtorLink)
	int                                                DataCRC;                                          		// 0x0048(0x0004) (CPF_Const)
	struct FString                                     ETag;                                             		// 0x004C(0x000C) (CPF_Const, CPF_NeedCtorLink)
	class UError_X*                                    LoadError;                                        		// 0x0058(0x0004) (CPF_Transient)
	class UError_X*                                    DownloadError;                                    		// 0x005C(0x0004) (CPF_Transient)
	unsigned long                                      bNewData : 1;                                     		// 0x0060(0x0004) (CPF_Transient)

	static UClass* StaticClass()
	{
		static auto ptr = UObject::FindClass("Class ProjectX.CachedWebData_X");
		return ptr;
	}


	struct FString GetText();
	void UpdateData(TArray<unsigned char> NewData, const struct FString& NewETag);
};


// Class ProjectX.Camera_X
// 0x00F4 (0x05BC - 0x04C8)
class ACamera_X : public ACamera
{
public:
	TArray<class UCameraState_X*>                      States;                                           		// 0x04C8(0x000C) (CPF_Edit, CPF_NeedCtorLink)
	struct FRotator                                    PCDeltaRotation;                                  		// 0x04D4(0x000C) (CPF_Transient)
	struct FRotator                                    OldControllerRotation;                            		// 0x04E0(0x000C) (CPF_Transient)
	struct FVector                                     PCDeltaLocation;                                  		// 0x04EC(0x000C) (CPF_Transient)
	struct FVector                                     OldControllerLocation;                            		// 0x04F8(0x000C) (CPF_Transient)
	struct FCameraOrientation                          PreProcessPOV;                                    		// 0x0504(0x002C) (CPF_Transient)
	struct FCameraOrientation                          PostProcessPOV;                                   		// 0x0530(0x002C) (CPF_Transient)
	class UCameraStateBlender_X*                       Blender;                                          		// 0x055C(0x0004) (CPF_ExportObject, CPF_Component, CPF_EditInline)
	struct FVector                                     ShakeLocationOffset;                              		// 0x0560(0x000C) (CPF_Const, CPF_Transient)
	struct FRotator                                    ShakeRotationOffset;                              		// 0x056C(0x000C) (CPF_Const, CPF_Transient)
	float                                              ShakeFOVOffset;                                   		// 0x0578(0x0004) (CPF_Const, CPF_Transient)
	struct FColor                                      StartFadeColor;                                   		// 0x057C(0x0004) (CPF_Transient)
	struct FColor                                      EndFadeColor;                                     		// 0x0580(0x0004) (CPF_Transient)
	struct FVector                                     ClipOffset;                                       		// 0x0584(0x000C) (CPF_Transient)
	TArray<struct FLocationCameraKnock>                LocationKnocks;                                   		// 0x0590(0x000C) (CPF_Transient, CPF_NeedCtorLink)
	TArray<struct FRotationCameraKnock>                RotationKnocks;                                   		// 0x059C(0x000C) (CPF_Transient, CPF_NeedCtorLink)
	unsigned long                                      bDisableCameraShake : 1;                          		// 0x05A8(0x0004) (CPF_Transient)
	struct FScriptDelegate                             __EventCameraStateChanged__Delegate;              		// 0x05AC(0x000C) (CPF_NeedCtorLink)
	unsigned char                                      UnknownData00[0x4];                               		// 0x05AC(0x0004) FIX WRONG TYPE SIZE OF PREVIUS PROPERTY

	static UClass* StaticClass()
	{
		static auto ptr = UObject::FindClass("Class ProjectX.Camera_X");
		return ptr;
	}


	void OnViewTargetChanged();
	void SetViewTarget(class AActor* NewViewTarget, const struct FViewTargetTransitionParams& TransitionParams);
	void HandleBlenderStateChanged(class UCameraStateBlender_X* CameraBlender);
	void SnapTransition();
	void PrintDebugInfo(class UDebugDrawer* Drawer);
	void ApplyCameraModifiers(float DeltaTime, struct FTPOV* OutPOV);
	bool CameraTrace(const struct FVector& End, const struct FVector& Start, const struct FVector& Extent, struct FVector* HitLoc, class AActor** HitActor);
	class UCameraState_X* InstanceCameraState(class UCameraState_X* Archetype);
	void ModifyPostProcessSettings(struct FPostProcessSettings* PP);
	void ProcessViewRotation(float DeltaTime, struct FRotator* OutViewRotation, struct FRotator* OutDeltaRot);
	void PostProcessCameraState(float DeltaTime, struct FCameraOrientation* OutPOV);
	void ProcessCameraState(float DeltaTime, struct FCameraOrientation* OutPOV);
	void CheckViewTarget(struct FTViewTarget* VT);
	void CopyFade(class ACamera_X* Other);
	void SetCameraFade(bool bNewEnableFading, const struct FColor& NewFadeColor, const struct FVector2D& NewFadeAlpha, float NewFadeTime, bool bNewFadeAudio);
	void UpdateFade(float DeltaTime);
	void UpdateCamera(float DeltaTime);
	void ClampPOV(struct FCameraOrientation* OutPOV);
	struct FRotator RemoveRoll(const struct FRotator& InRot);
	class UCameraState_X* GetCameraState();
	class UCameraState_X* SelectCameraState();
	void UpdateCameraState();
	void UpdateCameraKnocks(float DeltaTime, struct FCameraOrientation* OutPOV);
	void AddRotationKnock(const struct FRotationCameraKnock& Knock, float Scale);
	void AddLocationKnock(const struct FLocationCameraKnock& Knock, float Scale, const struct FRotator& Transform);
	void InstanceCameraStates();
	void InitializeFor(class APlayerController* PC);
	void ModifyCameraShakeScale(class UCameraShake* Shake, float NewScale);
	void OnLoadingMovieClosesd();
	void PostBeginPlay();
	struct FVector STATIC_InterpVector(const struct FVector& OldValue, const struct FVector& NewValue, const struct FVectorInterpRate& Rate, const struct FRotator& Orientation, float DeltaTime);
	void STATIC_FinalizeOrientation(struct FCameraOrientation* OutPOV);
	struct FCameraOrientation STATIC_BlendCameraOrientations(float Alpha, struct FCameraOrientation* A, struct FCameraOrientation* B);
	void EventCameraStateChanged(class ACamera_X* Camera, class UCameraState_X* CameraState);
};


// Class ProjectX.CameraAttachmentComponent_X
// 0x0013 (0x0078 - 0x0065)
class UCameraAttachmentComponent_X : public UActorComponent
{
public:
	unsigned char                                      UnknownData00[0x3];                               		// 0x0065(0x0003) MISSED OFFSET
	TArray<class UActorComponent*>                     Attachments;                                      		// 0x0068(0x000C) (CPF_Edit, CPF_ExportObject, CPF_Component, CPF_NeedCtorLink, CPF_EditInline)
	unsigned long                                      bDirtyTransform : 1;                              		// 0x0074(0x0004) (CPF_Const, CPF_Transient)

	static UClass* StaticClass()
	{
		static auto ptr = UObject::FindClass("Class ProjectX.CameraAttachmentComponent_X");
		return ptr;
	}

};


// Class ProjectX.CanvasTexture_X
// 0x0010 (0x013C - 0x012C)
class UCanvasTexture_X : public UTextureRenderTarget2D
{
public:
	struct FScriptDelegate                             __Draw__Delegate;                                 		// 0x012C(0x000C) (CPF_NeedCtorLink)
	unsigned char                                      UnknownData00[0x4];                               		// 0x012C(0x0004) FIX WRONG TYPE SIZE OF PREVIUS PROPERTY

	static UClass* StaticClass()
	{
		static auto ptr = UObject::FindClass("Class ProjectX.CanvasTexture_X");
		return ptr;
	}


	void Draw(class UCanvas* C);
};


// Class ProjectX.CanvasTextureComponent_X
// 0x0017 (0x007C - 0x0065)
class UCanvasTextureComponent_X : public UActorComponent
{
public:
	unsigned char                                      UnknownData00[0x3];                               		// 0x0065(0x0003) MISSED OFFSET
	class UMeshComponent*                              Mesh;                                             		// 0x0068(0x0004) (CPF_Edit, CPF_Const, CPF_ExportObject, CPF_Component, CPF_EditInline)
	int                                                MaterialIndex;                                    		// 0x006C(0x0004) (CPF_Edit, CPF_Const)
	struct FName                                       MaterialParamName;                                		// 0x0070(0x0008) (CPF_Edit, CPF_Const)
	class UCanvasTexture_X*                            Texture;                                          		// 0x0078(0x0004) (CPF_Edit, CPF_Const, CPF_ExportObject, CPF_NeedCtorLink, CPF_EditInline)

	static UClass* StaticClass()
	{
		static auto ptr = UObject::FindClass("Class ProjectX.CanvasTextureComponent_X");
		return ptr;
	}


	void OnDraw(class UCanvas* C);
};


// Class ProjectX.PlayerController_X
// 0x0070 (0x0620 - 0x05B0)
class APlayerController_X : public APlayerController
{
public:
	class ACamera*                                     CameraArchetype;                                  		// 0x05B0(0x0004) (CPF_Edit)
	class AHUD*                                        HUDArchetype;                                     		// 0x05B4(0x0004) (CPF_Edit)
	class APawn*                                       OldPawnReference;                                 		// 0x05B8(0x0004) (CPF_Transient)
	class AActor*                                      LockedDebugActor;                                 		// 0x05BC(0x0004) (CPF_Transient)
	class APlayerReplicationInfo*                      LastPRI;                                          		// 0x05C0(0x0004) (CPF_Transient)
	float                                              LastNotifyTypingTime;                             		// 0x05C4(0x0004) (CPF_Transient)
	unsigned long                                      bPausedForExternalUI : 1;                         		// 0x05C8(0x0004) (CPF_Transient)
	class UNetConnection*                              NetConnection;                                    		// 0x05CC(0x0004) (CPF_Transient)
	struct FScriptDelegate                             __EventReceivedPRI__Delegate;                     		// 0x05D0(0x000C) (CPF_NeedCtorLink)
	unsigned char                                      UnknownData00[0x4];                               		// 0x05D0(0x0004) FIX WRONG TYPE SIZE OF PREVIUS PROPERTY
	struct FScriptDelegate                             __EventPawnChange__Delegate;                      		// 0x05E0(0x000C) (CPF_NeedCtorLink)
	unsigned char                                      UnknownData01[0x4];                               		// 0x05E0(0x0004) FIX WRONG TYPE SIZE OF PREVIUS PROPERTY
	struct FScriptDelegate                             __EventReceivedPlayer__Delegate;                  		// 0x05F0(0x000C) (CPF_NeedCtorLink)
	unsigned char                                      UnknownData02[0x4];                               		// 0x05F0(0x0004) FIX WRONG TYPE SIZE OF PREVIUS PROPERTY
	struct FScriptDelegate                             __EventDestroyed__Delegate;                       		// 0x0600(0x000C) (CPF_NeedCtorLink)
	unsigned char                                      UnknownData03[0x4];                               		// 0x0600(0x0004) FIX WRONG TYPE SIZE OF PREVIUS PROPERTY
	struct FScriptDelegate                             __EventPlayerCameraChange__Delegate;              		// 0x0610(0x000C) (CPF_NeedCtorLink)
	unsigned char                                      UnknownData04[0x4];                               		// 0x0610(0x0004) FIX WRONG TYPE SIZE OF PREVIUS PROPERTY

	static UClass* StaticClass()
	{
		static auto ptr = UObject::FindClass("Class ProjectX.PlayerController_X");
		return ptr;
	}


	void ServerUpdateCustomMatchSettings(const struct FCustomMatchSettings& Settings);
	void ServerSetParty(const struct FUniqueNetId& MemberId, const struct FUniqueNetId& NewPartyID);
	void DisconnectSplitScreenPlayer(class UPlayer* P);
	void ServerDestroy();
	void ServerTyping();
	void NotifyTyping();
	void KickPlayerForReason(const struct FString& Reason, const struct FString& Title);
	void ClientNetLag(float PktLag, float PktVariance, float PktLoss, float PktDup);
	void ServerNetLag(float PktLag, float PktVariance, float PktLoss, float PktDup);
	void Pause();
	void RemoveOptionFromLastURL(const struct FString& OptName);
	void PrintDebugInfo(class UDebugDrawer* Drawer);
	void ClearOnlineDelegates();
	void RegisterOnlineDelegates();
	void NotifyTakeHit_X(class UDamageComponent_X* Damage);
	void ClientPlayForceFeedbackWaveform(class UForceFeedbackWaveform* FFWaveform, class AActor* FFWaveformInstigator);
	void ClientCommand(const struct FString& Command);
	void ServerCommand(const struct FString& Command);
	void PawnDied(class APawn* P);
	void UnPossess();
	void Possess(class APawn* aPawn, bool bVehicleTransition);
	void OnPawnChange(class APawn* OldPawn, class APawn* NewPawn);
	void PawnReferenceUpdated();
	void ClientRestart(class APawn* NewPawn);
	void GivePawn(class APawn* NewPawn);
	void InitInputSystem();
	class ACamera* GetCameraArchetype();
	void SpawnPlayerCamera();
	void OnCameraChanged(class ACamera* InCamera);
	void AddCheats(bool bForce);
	class UOnlineGameAccount_X* GetOnlineAccount();
	class UOnlinePlayer_X* GetOnlinePlayer();
	void OnReceivedPRI();
	void InitPlayerReplicationInfo();
	void Destroyed();
	void OnExternalUIChanged(bool bIsOpening);
	void SetPaused(bool bPaused);
	void ReceivedPlayer();
	class UOnlineGame_X* GetOnlineGame();
	TScriptInterface<class UIOnlineGameHost_X> STATIC_GetOnlineGameHost();
	class UOnlineGameLanServer_X* STATIC_GetOnlineGameLanServer();
	class UOnlineGameDedicatedServer_X* GetOnlineGameDedicatedServer();
	void SpawnDefaultHUD();
	void SetPRI(class APlayerReplicationInfo* PRI);
	void ReplicatedEvent(const struct FName& VarName);
	void EventPlayerCameraChange(class APlayerController_X* PC);
	void EventDestroyed(class APlayerController_X* PC);
	void EventReceivedPlayer(class APlayerController_X* PC);
	void EventPawnChange(class APlayerController_X* PC, class APawn* OldPawn, class APawn* NewPawn);
	void EventReceivedPRI(class APlayerController_X* PC);
};


// Class ProjectX.CheatManager_X
// 0x003C (0x0090 - 0x0054)
class UCheatManager_X : public UCheatManager
{
public:
	class UUIScene_X*                                  EditScene;                                        		// 0x0054(0x0004) (CPF_Transient)
	class UObjectProvider*                             CheatObjectProvider;                              		// 0x0058(0x0004) (CPF_ExportObject, CPF_NeedCtorLink, CPF_EditInline)
	TArray<class UClass*>                              CheatClasses;                                     		// 0x005C(0x000C) (CPF_NeedCtorLink)
	TArray<struct FString>                             CheatClassPaths;                                  		// 0x0068(0x000C) (CPF_NeedCtorLink)
	TArray<struct FString>                             CheatArchetypes;                                  		// 0x0074(0x000C) (CPF_Const, CPF_NeedCtorLink)
	struct FScriptDelegate                             __EventDelegateTest__Delegate;                    		// 0x0080(0x000C) (CPF_NeedCtorLink)
	unsigned char                                      UnknownData00[0x4];                               		// 0x0080(0x0004) FIX WRONG TYPE SIZE OF PREVIUS PROPERTY

	static UClass* StaticClass()
	{
		static auto ptr = UObject::FindClass("Class ProjectX.CheatManager_X");
		return ptr;
	}


	TArray<class UObject*> CreateCheatObjects();
	void HandleSanitize(const struct FString& Comment, const struct FString& Sanitized);
	void TestWorldFilter(const struct FString& Words);
	void LoadOnlineComponents(const struct FString& Platform, const struct FString& Language);
	void TestUTCTime(int AdjustSeconds);
	void HandleImageDownloaded(class UOnlineImageDownloaderWeb_X* Downloader, const struct FDownloadedImage& Image);
	void DownloadImage(const struct FString& URL);
	void LoadKismetLevel(const struct FName& LeveFileName);
	void DrawBulletContacts(float Lifetime);
	void PrintReproPhysics(const struct FString& Command, class AActor* A);
	void ReproPhysics(class AActor* A, float LX, float LY, float LZ, float RX, float RY, float RZ, float RW, float VX, float VY, float VZ);
	void DisableCCD();
	void SimulateInputKey(const struct FName& KeyName);
	void SetNetServerMaxTickRate(float Rate);
	void ListVisiblePrimitives();
	void HideVisiblePrimitives(const struct FString& NameMatch, const struct FString& NameIgnore);
	void ToggleReplicateVoiceToSelf();
	void ToggleReplicateVoiceToSender();
	void EventDelegateTest();
};


// Class ProjectX.CheatObject_X
// 0x0000 (0x003C - 0x003C)
class UCheatObject_X : public UObject
{
public:

	static UClass* StaticClass()
	{
		static auto ptr = UObject::FindClass("Class ProjectX.CheatObject_X");
		return ptr;
	}

};


// Class ProjectX.ControlPreset_X
// 0x001C (0x0058 - 0x003C)
class UControlPreset_X : public UObject
{
public:
	TArray<struct FPlayerBinding>                      PCBindings;                                       		// 0x003C(0x000C) (CPF_Config, CPF_NeedCtorLink)
	TArray<struct FPlayerBinding>                      GamepadBindings;                                  		// 0x0048(0x000C) (CPF_Config, CPF_NeedCtorLink)
	unsigned long                                      bRemovedPCOverrides : 1;                          		// 0x0054(0x0004)
	unsigned long                                      bRemovedGamepadOverrides : 1;                     		// 0x0054(0x0004)

	static UClass* StaticClass()
	{
		static auto ptr = UObject::FindClass("Class ProjectX.ControlPreset_X");
		return ptr;
	}


	TArray<struct FPlayerBinding> GetGamepadBindings();
	TArray<struct FPlayerBinding> GetPCBindings();
	TArray<struct FPlayerBinding> STATIC_GetDefaultGamepadBindings();
	TArray<struct FPlayerBinding> STATIC_GetDefaultPCBindings();
};


// Class ProjectX.CRC_X
// 0x0000 (0x003C - 0x003C)
class UCRC_X : public UObject
{
public:

	static UClass* StaticClass()
	{
		static auto ptr = UObject::FindClass("Class ProjectX.CRC_X");
		return ptr;
	}


	int STATIC_GetStringCRC(const struct FString& Text, int Seed);
};


// Class ProjectX.CycleLog_X
// 0x0014 (0x005C - 0x0048)
class UCycleLog_X : public UComponent
{
public:
	int                                                MaxLogs;                                          		// 0x0048(0x0004) (CPF_Edit)
	TArray<struct FString>                             Logs;                                             		// 0x004C(0x000C) (CPF_Transient, CPF_NeedCtorLink)
	int                                                LogIndex;                                         		// 0x0058(0x0004) (CPF_Const, CPF_Transient)

	static UClass* StaticClass()
	{
		static auto ptr = UObject::FindClass("Class ProjectX.CycleLog_X");
		return ptr;
	}


	void AllLogs(struct FString* S);
};


// Class ProjectX.DamageComponent_X
// 0x004C (0x0094 - 0x0048)
class UDamageComponent_X : public UComponent
{
public:
	float                                              Damage;                                           		// 0x0048(0x0004) (CPF_Edit)
	float                                              InstigatorDamageScale;                            		// 0x004C(0x0004) (CPF_Edit)
	class UClass*                                      LegacyDamageType;                                 		// 0x0050(0x0004) (CPF_Edit)
	class APawn*                                       Instigator;                                       		// 0x0054(0x0004) (CPF_Transient)
	class AController*                                 InstigatorController;                             		// 0x0058(0x0004) (CPF_Transient)
	class AActor*                                      Source;                                           		// 0x005C(0x0004) (CPF_Transient)
	struct FVector                                     Location;                                         		// 0x0060(0x000C) (CPF_Transient)
	struct FVector                                     MomentumDir;                                      		// 0x006C(0x000C) (CPF_Transient)
	struct FTraceHitInfo                               HitInfo;                                          		// 0x0078(0x001C) (CPF_Transient, CPF_Component)

	static UClass* StaticClass()
	{
		static auto ptr = UObject::FindClass("Class ProjectX.DamageComponent_X");
		return ptr;
	}


	void Reset();
	float CalculateDamage(class AActor* Victim);
	void ApplyDamage(class AActor* Victim, bool bManualReset);
	class UDamageComponent_X* SetImpact(const struct FImpactInfo& Impact);
	class UDamageComponent_X* SetHitInfo(const struct FTraceHitInfo& InHitInfo);
	class UDamageComponent_X* ScaleDamage(float InScale);
	class UDamageComponent_X* SetMomentumDir(const struct FVector& InMomentumDir);
	class UDamageComponent_X* SetLocation(const struct FVector& InLocation);
	class UDamageComponent_X* SetSource(class AActor* InSource);
	void InitSource();
	class UDamageComponent_X* GetArchetype();
};


// Class ProjectX.DemoRecDriverInterface_X
// 0x0020 (0x005C - 0x003C)
class UDemoRecDriverInterface_X : public UObject
{
public:
	unsigned long                                      bRecordingPaused : 1;                             		// 0x003C(0x0004) (CPF_Const, CPF_Transient)
	unsigned long                                      bPlaybackPaused : 1;                              		// 0x003C(0x0004) (CPF_Const, CPF_Transient)
	unsigned long                                      bPlaying : 1;                                     		// 0x003C(0x0004) (CPF_Const, CPF_Transient)
