#pragma once

// Rocket League (1.31) SDK

#ifdef _MSC_VER
	#pragma pack(push, 0x4)
#endif

namespace SDK
{
//---------------------------------------------------------------------------
//Constants
//---------------------------------------------------------------------------

#undef AF_MAX
#undef PF_MAX

#define CONST_UnrealUnitsPerMeter                                100
#define CONST_MaxLoadoutSets                                     10
#define CONST_MeshRadius                                         15.0f
#define CONST_MeshWidth                                          15.0f
#define CONST_MAX_REPLICATED_VOTERS                              8
#define CONST_PlayerCountIrrelevant                              "NO_COUNT"
#define CONST_MAX_NAMEPLATES                                     8

//---------------------------------------------------------------------------
//Enums
//---------------------------------------------------------------------------

// Enum TAGame._AITypes_TA.EAITraitValue
enum class EAITraitValue
{
	AITraitValue_Low               = 0,
	AITraitValue_Medium            = 1,
	AITraitValue_High              = 2,
	AITraitValue_MAX               = 3
};


// Enum TAGame._AITypes_TA.EBTStatus
enum class EBTStatus
{
	BTStatus_Fail                  = 0,
	BTStatus_Success               = 1,
	BTStatus_Running               = 2,
	BTStatus_MAX                   = 3
};


// Enum TAGame._AITypes_TA.EAITeam
enum class EAITeam
{
	AITeam_Self                    = 0,
	AITeam_Enemy                   = 1,
	AITeam_Any                     = 2,
	AITeam_MAX                     = 3
};


// Enum TAGame._Types_TA.EExperimentalMapStatus
enum class EExperimentalMapStatus
{
	EMS_Default                    = 0,
	EMS_OnlyExperimentalPlaylist   = 1,
	EMS_Any                        = 2,
	EMS_MAX                        = 3
};


// Enum TAGame._Types_TA.EMirrorFieldType
enum class EMirrorFieldType
{
	MFT_None                       = 0,
	MFT_X                          = 1,
	MFT_Y                          = 2,
	MFT_XY                         = 3,
	MFT_TeamIndex                  = 4,
	MFT_MAX                        = 5
};


// Enum TAGame._Types_TA.EUIMenuState
enum class EUIMenuState
{
	UIMS_StartMenu                 = 0,
	UIMS_MainMenu                  = 1,
	UIMS_MAX                       = 2
};


// Enum TAGame._Types_TA.EPartyChatCommands
enum class EPartyChatCommands
{
	EPartyChat_Message             = 0,
	EPartyChat_Clear               = 1,
	EPartyChat_Repopulated         = 2,
	EPartyChat_MAX                 = 3
};


// Enum TAGame._Types_TA.EChatChannel
enum class EChatChannel
{
	EChatChannel_Match             = 0,
	EChatChannel_Team              = 1,
	EChatChannel_Party             = 2,
	EChatChannel_MAX               = 3
};


// Enum TAGame._Types_TA.ESkinType
enum class ESkinType
{
	EST_Default                    = 0,
	EST_Animated                   = 1,
	EST_AnimatedPrimaryOnly        = 2,
	EST_MAX                        = 3
};


// Enum TAGame._Types_TA.EKeySelection
enum class EKeySelection
{
	KS_Oldest                      = 0,
	KS_Newest                      = 1,
	KS_ShowKeyPicker               = 2,
	KS_MAX                         = 3
};


// Enum TAGame._Types_TA.EProductQuality
enum class EProductQuality
{
	EPQ_Common                     = 0,
	EPQ_Uncommon                   = 1,
	EPQ_Rare                       = 2,
	EPQ_VeryRare                   = 3,
	EPQ_Import                     = 4,
	EPQ_Exotic                     = 5,
	EPQ_BlackMarket                = 6,
	EPQ_Premium                    = 7,
	EPQ_Limited                    = 8,
	EPQ_MAX                        = 9
};


// Enum TAGame._Types_TA.EUnlockMethod
enum class EUnlockMethod
{
	UnlockMethod_Default           = 0,
	UnlockMethod_Drop              = 1,
	UnlockMethod_Special           = 2,
	UnlockMethod_Reward            = 3,
	UnlockMethod_DLC               = 4,
	UnlockMethod_Never             = 5,
	UnlockMethod_MAX               = 6
};


// Enum TAGame._Types_TA.EPaintAttributeType
enum class EPaintAttributeType
{
	PaintAttributeType_Primary     = 0,
	PaintAttributeType_LightAccent = 1,
	PaintAttributeType_DarkAccent  = 2,
	PaintAttributeType_Emissive    = 3,
	PaintAttributeType_MAX         = 4
};


// Enum TAGame._Types_TA.EChallengeState
enum class EChallengeState
{
	ChallengeState_None            = 0,
	ChallengeState_Active          = 1,
	ChallengeState_Unlocked        = 2,
	ChallengeState_MAX             = 3
};


// Enum TAGame._Types_TA.ECustomMatchSettingsType
enum class ECustomMatchSettingsType
{
	CustomMatchSettingsType_PrivateMatch = 0,
	CustomMatchSettingsType_LocalMatch = 1,
	CustomMatchSettingsType_TourCreate = 2,
	CustomMatchSettingsType_MAX    = 3
};


// Enum TAGame._Types_TA.EReportPlayerReason
enum class EReportPlayerReason
{
	ReportPlayerReason_Harrassment = 0,
	ReportPlayerReason_UnsportsmanlikeConduct = 1,
	ReportPlayerReason_Cheating    = 2,
	ReportPlayerReason_MAX         = 3
};


// Enum TAGame._Types_TA.EEditingType
enum class EEditingType
{
	ET_FreeCam                     = 0,
	ET_Ball                        = 1,
	ET_Car                         = 2,
	ET_MAX                         = 3
};


// Enum TAGame._Types_TA.EEquippableProductSlot
enum class EEquippableProductSlot
{
	EPS_Skin                       = 0,
	EPS_Wheels                     = 1,
	EPS_Boost                      = 2,
	EPS_Hat                        = 3,
	EPS_Antenna                    = 4,
	EPS_MAX                        = 5
};


// Enum TAGame._Types_TA.EEquipAction
enum class EEquipAction
{
	EquipAction_Both               = 0,
	EquipAction_Team0              = 1,
	EquipAction_Team1              = 2,
	EquipAction_MAX                = 3
};


// Enum TAGame._Types_TA.EHistory
enum class EHistory
{
	H_None                         = 0,
	H_Add                          = 1,
	H_Remove                       = 2,
	H_MAX                          = 3
};


// Enum TAGame._Types_TA.EHistoryType
enum class EHistoryType
{
	HT_None                        = 0,
	HT_Undo                        = 1,
	HT_Redo                        = 2,
	HT_MAX                         = 3
};


// Enum TAGame._Types_TA.EPawnType
enum class EPawnType
{
	PT_Player                      = 0,
	PT_Spectator                   = 1,
	PT_Editor                      = 2,
	PT_MAX                         = 3
};


// Enum TAGame._Types_TA.ESaveGameResult
enum class ESaveGameResult
{
	SaveGameResult_Pending         = 0,
	SaveGameResult_Success         = 1,
	SaveGameResult_UserNotSignedIn = 2,
	SaveGameResult_Error           = 3,
	SaveGameResult_NoSpace         = 4,
	SaveGameResult_MAX             = 5
};


// Enum TAGame._Types_TA.EProductThumbnailSize
enum class EProductThumbnailSize
{
	PTS_Garage                     = 0,
	PTS_Drop                       = 1,
	PTS_Preview                    = 2,
	PTS_MAX                        = 3
};


// Enum TAGame._Types_TA.EProductAttachmentSocket
enum class EProductAttachmentSocket
{
	PAS_Hat                        = 0,
	PAS_Front                      = 1,
	PAS_Antenna                    = 2,
	PAS_UnderGlow                  = 3,
	PAS_Root                       = 4,
	PAS_MAX                        = 5
};


// Enum TAGame._Types_TA.ETAStatType
enum class ETAStatType
{
	StatType_Private               = 0,
	StatType_Unranked              = 1,
	StatType_Ranked                = 2,
	StatType_MAX                   = 3
};


// Enum TAGame._Types_TA.EBallHitType
enum class EBallHitType
{
	HitType_Item0                  = 0,
	HitType_Item1                  = 1,
	HitType_Item2                  = 2,
	HitType_Car                    = 3,
	HitType_MAX                    = 4
};


// Enum TAGame._Types_TA.EVoteStatus
enum class EVoteStatus
{
	VOTE_Pending                   = 0,
	VOTE_Yes                       = 1,
	VOTE_No                        = 2,
	VOTE_MAX                       = 3
};


// Enum TAGame._Types_TA.ETrainingTag
enum class ETrainingTag
{
	Tag_Aerials                    = 0,
	Tag_Bounces                    = 1,
	Tag_Shots                      = 2,
	Tag_Saves                      = 3,
	Tag_Clears                     = 4,
	Tag_Rebounds                   = 5,
	Tag_Redirects                  = 6,
	Tag_Freestyles                 = 7,
	Tag_Dribbles                   = 8,
	Tag_AirDribbles                = 9,
	Tag_Kickoffs                   = 10,
	Tag_WallShots                  = 11,
	Tag_LongShots                  = 12,
	Tag_CloseShots                 = 13,
	Tag_AngleShots                 = 14,
	Tag_BackwardsShots             = 15,
	Tag_Offense                    = 16,
	Tag_Defense                    = 17,
	Tag_PinchShots                 = 18,
	Tag_MAX                        = 19
};


// Enum TAGame._Types_TA.EDifficulty
enum class EDifficulty
{
	D_Easy                         = 0,
	D_Medium                       = 1,
	D_Hard                         = 2,
	D_MAX                          = 3
};


// Enum TAGame._Types_TA.ETrainingType
enum class ETrainingType
{
	Training_None                  = 0,
	Training_Aerial                = 1,
	Training_Goalie                = 2,
	Training_Striker               = 3,
	Training_MAX                   = 4
};


// Enum TAGame._Types_TA.EDemolishSpeed
enum class EDemolishSpeed
{
	DemolishSpeed_Supersonic       = 0,
	DemolishSpeed_None             = 1,
	DemolishSpeed_MAX              = 2
};


// Enum TAGame._Types_TA.EDemolishTarget
enum class EDemolishTarget
{
	DemolishTarget_OtherTeam       = 0,
	DemolishTarget_Everyone        = 1,
	DemolishTarget_None            = 2,
	DemolishTarget_MAX             = 3
};


// Enum TAGame._Types_TA.EProductFilterLogLevel
enum class EProductFilterLogLevel
{
	ProductFilterLogLevel_Filtered = 0,
	ProductFilterLogLevel_UnFiltered = 1,
	ProductFilterLogLevel_MAX      = 2
};


// Enum TAGame._Types_TA.EProductTradeRestriction
enum class EProductTradeRestriction
{
	ProductTradeRestriction_P2P    = 0,
	ProductTradeRestriction_TradeIn = 1,
	ProductTradeRestriction_MAX    = 2
};


// Enum TAGame._Types_TA.EControllerSoundMode
enum class EControllerSoundMode
{
	CSM_Multiplayer                = 0,
	CSM_On                         = 1,
	CSM_Off                        = 2,
	CSM_MAX                        = 3
};


// Enum TAGame._Types_TA.EVoiceFilter
enum class EVoiceFilter
{
	VoiceFilter_All                = 0,
	VoiceFilter_Preset             = 1,
	VoiceFilter_Team               = 2,
	VoiceFilter_Friends            = 3,
	VoiceFilter_None               = 4,
	VoiceFilter_MAX                = 5
};


// Enum TAGame._Types_TA.EPaintTeam
enum class EPaintTeam
{
	PaintTeam_Blue                 = 0,
	PaintTeam_Orange               = 1,
	PaintTeam_None                 = 2,
	PaintTeam_MAX                  = 3
};


// Enum TAGame._Types_TA.SearchStatusOwner
enum class SearchStatusOwner
{
	StatusOwner_None               = 0,
	StatusOwner_Matchmaking        = 1,
	StatusOwner_PrivateMatch       = 2,
	StatusOwner_Lan                = 3,
	StatusOwner_Tournaments        = 4,
	StatusOwner_MAX                = 5
};


// Enum TAGame._Types_TA.EWheelPosition
enum class EWheelPosition
{
	WP_FrontLeft                   = 0,
	WP_FrontRight                  = 1,
	WP_BackLeft                    = 2,
	WP_BackRight                   = 3,
	WP_MAX                         = 4
};


// Enum TAGame.AchievementManager_TA.EAchievementType
enum class EAchievementType
{
	AT_Game                        = 0,
	AT_EXP0                        = 1,
	AT_DLC0                        = 2,
	AT_DLC1                        = 3,
	AT_DLC2                        = 4,
	AT_XBO0                        = 5,
	AT_DLC3                        = 6,
	AT_DLC4                        = 7,
	AT_DLC5                        = 8,
	AT_MAX                         = 9
};


// Enum TAGame.AchievementManager_TA.EAchievementGame
enum class EAchievementGame
{
	AG_Virtuoso                    = 0,
	AG_Stocked                     = 1,
	AG_FarFarAway                  = 2,
	AG_SuperVictorious             = 3,
	AG_Champion                    = 4,
	AG_TheStreak                   = 5,
	AG_HelensPride                 = 6,
	AG_BattleCarCollector          = 7,
	AG_DropsintheBucket            = 8,
	AG_Rocketeer                   = 9,
	AG_GreaseMonkey                = 10,
	AG_PitchVeteran                = 11,
	AG_RidersBlock                 = 12,
	AG_BreakShot                   = 13,
	AG_Turbocharger                = 14,
	AG_DrillSergeant               = 15,
	AG_MinutetoWinit               = 16,
	AG_SpeedDemon                  = 17,
	AG_PickMeUp                    = 18,
	AG_WallCrawler                 = 19,
	AG_TeamPlayer                  = 20,
	AG_SARPBCForever               = 21,
	AG_FeatherinYourRecap          = 22,
	AG_Winner                      = 23,
	AG_CleanSheet                  = 24,
	AG_TripleThreat                = 25,
	AG_DoubleUp                    = 26,
	AG_SinglesClub                 = 27,
	AG_PerfectStart                = 28,
	AG_StillAShowOff               = 29,
	AG_KnowTheDrill                = 30,
	AG_Traveler                    = 31,
	AG_Tinkerer                    = 32,
	AG_FirstTimer                  = 33,
	AG_BarrasBravas                = 34,
	AG_Friendly                    = 35,
	AG_MAX                         = 36
};


// Enum TAGame.AchievementManager_TA.EAchievementEXP0
enum class EAchievementEXP0
{
	AEXP0_SkyHigh                  = 0,
	AEXP0_AllFours                 = 1,
	AEXP0_Gladiator                = 2,
	AEXP0_MAX                      = 3
};


// Enum TAGame.AchievementManager_TA.EAchievementDLC0
enum class EAchievementDLC0
{
	ADLC0_WinningIsWinning         = 0,
	ADLC0_AnInchAnd62Miles         = 1,
	ADLC0_RideOrDie                = 2,
	ADLC0_DontLookBack             = 3,
	ADLC0_FamilyNotFriends         = 4,
	ADLC0_DriftKing                = 5,
	ADLC0_MAX                      = 6
};


// Enum TAGame.AchievementManager_TA.EAchievementDLC1
enum class EAchievementDLC1
{
	ADLC1_SurvivalOfTheFittest     = 0,
	ADLC1_Heartbreaker             = 1,
	ADLC1_NaturalProgression       = 2,
	ADLC1_Throwback                = 3,
	ADLC1_HotShotPartTwo           = 4,
	ADLC1_MAX                      = 5
};


// Enum TAGame.AchievementManager_TA.EAchievementDLC2
enum class EAchievementDLC2
{
	ADLC2_MyWorldIsFire            = 0,
	ADLC2_Spectacular              = 1,
	ADLC2_Savage                   = 2,
	ADLC2_Ruthless                 = 3,
	ADLC2_PsychoMasterExploder     = 4,
	ADLC2_MAX                      = 5
};


// Enum TAGame.AchievementManager_TA.EAchievementXBO0
enum class EAchievementXBO0
{
	AXBO0_NiceHat                  = 0,
	AXBO0_MarcusVMasterChief       = 1,
	AXBO0_MAX                      = 2
};


// Enum TAGame.AchievementManager_TA.EAchievementDLC5
enum class EAchievementDLC5
{
	ADLC5_RegisteredVoter          = 0,
	ADLC5_Metaverse                = 1,
	ADLC5_BraveTheElements         = 2,
	ADLC5_DamageControl            = 3,
	ADLC5_FullCourse               = 4,
	ADLC5_BuckminsterX10           = 5,
	ADLC5_MAX                      = 6
};


// Enum TAGame.AchievementManager_TA.EAchievementDLC4
enum class EAchievementDLC4
{
	ADLC4_GG                       = 0,
	ADLC4_Trifecta                 = 1,
	ADLC4_InfinitePower            = 2,
	ADLC4_StoppedCold              = 3,
	ADLC4_SeaTurtle                = 4,
	ADLC4_GetUpMrBubbles           = 5,
	ADLC4_RocketGenocider          = 6,
	ADLC4_MAX                      = 7
};


// Enum TAGame.AchievementManager_TA.EAchievementDLC3
enum class EAchievementDLC3
{
	ADLC3_MadScientist             = 0,
	ADLC3_IcingTheCake             = 1,
	ADLC3_LeftWingRightWing        = 2,
	ADLC3_FastBreak                = 3,
	ADLC3_BuzzerBeater             = 4,
	ADLC3_BuddingArtist            = 5,
	ADLC3_OneBetter                = 6,
	ADLC3_Certifiable              = 7,
	ADLC3_MAX                      = 8
};


// Enum TAGame.ActivityFeedManager_TA.EActivityFeedType
enum class EActivityFeedType
{
	AF_UnlockedBody                = 0,
	AF_DrivenDistance              = 1,
	AF_ScoredGoal                  = 2,
	AF_BlockedShot                 = 3,
	AF_WonGame                     = 4,
	AF_MVPScore                    = 5,
	AF_DefeatedFriend              = 6,
	AF_CompletedRegularSeason      = 7,
	AF_WonChampionship             = 8,
	AF_UnlockedItem                = 9,
	AF_UnlockedSweetTooth          = 10,
	AF_MAX                         = 11
};


// Enum TAGame.PitchTekDrawingComponent_TA.EPitchTekDecalType
enum class EPitchTekDecalType
{
	PTDT_Ball                      = 0,
	PTDT_Car                       = 1,
	PTDT_MAX                       = 2
};


// Enum TAGame.BTLock.ELockScope
enum class ELockScope
{
	LockScope_Local                = 0,
	LockScope_Global               = 1,
	LockScope_MAX                  = 2
};


// Enum TAGame.CameraState_ReplayAutoCam_TA.ECountDownFocus
enum class ECountDownFocus
{
	CDF_None                       = 0,
	CDF_Pan                        = 1,
	CDF_Rotate                     = 2,
	CDF_MAX                        = 3
};


// Enum TAGame.GFxData_LocalPlayer_TA.ESplitScreenPosition
enum class ESplitScreenPosition
{
	SSP_Center                     = 0,
	SSP_Left                       = 1,
	SSP_Right                      = 2,
	SSP_Top                        = 3,
	SSP_Bottom                     = 4,
	SSP_TopLeft                    = 5,
	SSP_TopRight                   = 6,
	SSP_BottomLeft                 = 7,
	SSP_BottomRight                = 8,
	SSP_MAX                        = 9
};


// Enum TAGame.GameEvent_Tutorial_TA.ERotationType
enum class ERotationType
{
	Rot_Auto                       = 0,
	Rot_AutoAim                    = 1,
	Rot_AutoForward                = 2,
	Rot_AutoArch                   = 3,
	Rot_World                      = 4,
	Rot_MapCenter                  = 5,
	Rot_MAX                        = 6
};


// Enum TAGame.GFxData_OnlineMatchStatus_TA.SearchMessageType
enum class SearchMessageType
{
	MessageType_Status             = 0,
	MessageType_Warning            = 1,
	MessageType_MAX                = 2
};


// Enum TAGame.GFxData_UserSetting_TA.EUserSettingType
enum class EUserSettingType
{
	UserSettingType_List           = 0,
	UserSettingType_Boolean        = 1,
	UserSettingType_Scalar         = 2,
	UserSettingType_MAX            = 3
};


// Enum TAGame.GFxEngine_TA.ESoundStatePriority
enum class ESoundStatePriority
{
	SSP_None                       = 0,
	SSP_BeginRound                 = 1,
	SSP_Pause                      = 2,
	SSP_MAX                        = 3
};


// Enum TAGame.ProductAsset_Wheel_TA.EMeshMirrorMode
enum class EMeshMirrorMode
{
	MeshMirrorMode_Mirror          = 0,
	MeshMirrorMode_Rotate          = 1,
	MeshMirrorMode_MAX             = 2
};


// Enum TAGame.Profile_TA.EProfileVersion
enum class EProfileVersion
{
	ProfileVersion_Initial         = 0,
	ProfileVersion_LoadoutPlayerTitle = 1,
	ProfileVersion_SaveReplayInput = 2,
	ProfileVersion_SaveReplayInput2 = 3,
	ProfileVersion_ChatRebind      = 4,
	ProfileVersion_SaveReplayInput3 = 5,
	ProfileVersion_DingoChatFix    = 6,
	ProfileVersion_CustomMatchSettings = 7,
	ProfileVersion_ChatSettings    = 8,
	ProfileVersion_TeamLoadouts    = 9,
	ProfileVersion_CarColors       = 10,
	ProfileVersion_ChatGamepadBindingConsoleOnly = 11,
	ProfileVersion_PaintFinishInLoadouts = 12,
	ProfileVersion_MAX             = 13
};


// Enum TAGame.Replay_TA.EReplayVersion
enum class EReplayVersion
{
	ReplayVersion_Base             = 0,
	ReplayVersion_OnlineLoadout    = 1,
	ReplayVersion_CameraSettings   = 2,
	ReplayVersion_TeamLoadouts     = 3,
	ReplayVersion_MatchType        = 4,
	ReplayVersion_ActorName        = 5,
	ReplayVersion_MAX              = 6
};


// Enum TAGame.Replay_TA.EReplayState
enum class EReplayState
{
	ReplayState_Idle               = 0,
	ReplayState_Recording          = 1,
	ReplayState_Playing            = 2,
	ReplayState_MAX                = 3
};


// Enum TAGame.SaveData_TA.ESaveDataVersion
enum class ESaveDataVersion
{
	SaveDataVersion_Initial        = 0,
	SaveDataVersion_LightShafts    = 1,
	SaveDataVersion_MAX            = 2
};


// Enum TAGame.SkelControlSingleBoneCopy_TA.ECopyAxis
enum class ECopyAxis
{
	CopyAxis_X                     = 0,
	CopyAxis_Y                     = 1,
	CopyAxis_Z                     = 2,
	CopyAxis_Pitch                 = 3,
	CopyAxis_Yaw                   = 4,
	CopyAxis_Roll                  = 5,
	CopyAxis_MAX                   = 6
};


// Enum TAGame.Tutorial_TA.ETutorialOutput
enum class ETutorialOutput
{
	TutorialOutput_Ended           = 0,
	TutorialOutput_Completed       = 1,
	TutorialOutput_Failed          = 2,
	TutorialOutput_ScreenFadedIn   = 3,
	TutorialOutput_ScreenFadedOut  = 4,
	TutorialOutput_AllMessagesDisplayed = 5,
	TutorialOutput_Started         = 6,
	TutorialOutput_MAX             = 7
};


// Enum TAGame.Tutorial_TA.ETutorialStatus
enum class ETutorialStatus
{
	TutorialStatus_None            = 0,
	TutorialStatus_Failed          = 1,
	TutorialStatus_Completed       = 2,
	TutorialStatus_MAX             = 3
};


// Enum TAGame.Tutorial_TA.EPlayerDriveType
enum class EPlayerDriveType
{
	PlayerDriveType_All            = 0,
	PlayerDriveType_Player         = 1,
	PlayerDriveType_Bot            = 2,
	PlayerDriveType_MAX            = 3
};


// Enum TAGame.BreakOutActor_Platform_TA.EBreakoutDamageState
enum class EBreakoutDamageState
{
	DamageState_Start              = 0,
	DamageState_Damaged            = 1,
	DamageState_Broken             = 2,
	DamageState_MAX                = 3
};


// Enum TAGame.DistributionFloatSpeed_TA.ESpeedDistributionSpace
enum class ESpeedDistributionSpace
{
	SDD_Forward                    = 0,
	SDD_Side                       = 1,
	SDD_Up                         = 2,
	SDD_World                      = 3,
	SDD_MAX                        = 4
};


// Enum TAGame.ForceVolume_TA.EForceDirection
enum class EForceDirection
{
	EFD_VolumeRotation             = 0,
	EFD_ActorVelocity              = 1,
	EFD_Custom                     = 2,
	EFD_MAX                        = 3
};


// Enum TAGame.InterpTrackSkelControlRotation_TA.ERotationAxis
enum class ERotationAxis
{
	ROTAXIS_Yaw                    = 0,
	ROTAXIS_Pitch                  = 1,
	ROTAXIS_Roll                   = 2,
	ROTAXIS_MAX                    = 3
};


// Enum TAGame.ProductAttribute_Trademark_TA.ETrademarkGlyph
enum class ETrademarkGlyph
{
	TrademarkGlyph_TradeMark       = 0,
	TrademarkGlyph_Registered      = 1,
	TrademarkGlyph_Copyright       = 2,
	TrademarkGlyph_MAX             = 3
};


// Enum TAGame.GameEditor_Ring_TA.EDetectionType
enum class EDetectionType
{
	DT_Ball                        = 0,
	DT_Player                      = 1,
	DT_MAX                         = 2
};


// Enum TAGame.GameEvent_TrainingEditor_TA.EPlayTestType
enum class EPlayTestType
{
	PlayTest_LoopRound             = 0,
	PlayTest_IncrementRound        = 1,
	PlayTest_IncrementRoundLoop    = 2,
	PlayTest_MAX                   = 3
};


// Enum TAGame.SaveData_GameEditor_Training_TA.ETrainingSaveType
enum class ETrainingSaveType
{
	ETS_MyTraining                 = 0,
	ETS_Favorited                  = 1,
	ETS_Downloaded                 = 2,
	ETS_MAX                        = 3
};


// Enum TAGame.GFxData_MapPrefs_TA.EMapPrefType
enum class EMapPrefType
{
	MapPrefType_None               = 0,
	MapPrefType_Like               = 1,
	MapPrefType_Dislike            = 2,
	MapPrefType_MAX                = 3
};


// Enum TAGame.GFxData_ProductFilter_TA.EProductFilterType
enum class EProductFilterType
{
	ProductFilterType_TradeIn      = 0,
	ProductFilterType_P2P          = 1,
	ProductFilterType_MAX          = 2
};


// Enum TAGame.GFxData_TrainingModeBrowser_TA.ETrainingModeSearchTypes
enum class ETrainingModeSearchTypes
{
	TMST_AllPublic                 = 0,
	TMST_FeaturedOnly              = 1,
	TMST_MAX                       = 2
};


// Enum TAGame.SpecialPickup_Spring_TA.ESpringState
enum class ESpringState
{
	SpringState_Traveling          = 0,
	SpringState_PostHit            = 1,
	SpringState_MAX                = 2
};


// Enum TAGame.SpecialPickup_BallFreeze_TA.BallFreezeState
enum class BallFreezeState
{
	STATE_Freezing                 = 0,
	STATE_Frozen                   = 1,
	STATE_MAX                      = 2
};


// Enum TAGame.SpecialPickup_GrapplingHook_TA.ERopeState
enum class ERopeState
{
	RopeState_Traveling            = 0,
	RopeState_Attached             = 1,
	RopeState_MAX                  = 2
};


// Enum TAGame.StaticMeshRBActor_TA.EApplyForceTo
enum class EApplyForceTo
{
	EAF_None                       = 0,
	EAF_Any                        = 1,
	EAF_CarOnly                    = 2,
	EAF_BallOnly                   = 3,
	EAF_MAX                        = 4
};



//---------------------------------------------------------------------------
//Classes
//---------------------------------------------------------------------------

// Class TAGame._AITypes_TA
// 0x0000 (0x003C - 0x003C)
class U_AITypes_TA : public UObject
{
public:

	static UClass* StaticClass()
	{
		static auto ptr = UObject::FindClass("Class TAGame._AITypes_TA");
		return ptr;
	}

};


// Class TAGame._Types_TA
// 0x0030 (0x006C - 0x003C)
class U_Types_TA : public UObject
{
public:
	struct FScriptDelegate                             __AssetLoadedDelegate__Delegate;                  		// 0x003C(0x000C) (CPF_NeedCtorLink)
	unsigned char                                      UnknownData00[0x4];                               		// 0x003C(0x0004) FIX WRONG TYPE SIZE OF PREVIUS PROPERTY
	struct FScriptDelegate                             __ProductThumbnailRenderedDelegate__Delegate;     		// 0x004C(0x000C) (CPF_NeedCtorLink)
	unsigned char                                      UnknownData01[0x4];                               		// 0x004C(0x0004) FIX WRONG TYPE SIZE OF PREVIUS PROPERTY
	struct FScriptDelegate                             __MapImageLoadedDelegate__Delegate;               		// 0x005C(0x000C) (CPF_NeedCtorLink)
	unsigned char                                      UnknownData02[0x4];                               		// 0x005C(0x0004) FIX WRONG TYPE SIZE OF PREVIUS PROPERTY

	static UClass* StaticClass()
	{
		static auto ptr = UObject::FindClass("Class TAGame._Types_TA");
		return ptr;
	}


	struct FLoadoutTeamPaint STATIC_GetLoadoutPaint(const struct FLoadoutData& InLoadoutData);
	int STATIC_GetRandomColorID(class UCarColorSet_TA* Set);
	void STATIC_InitColorSet(class UCarColorSet_TA* Set, TArray<struct FGFxTeamColor>* OutColors);
	struct FString STATIC_ProductQualityToString(TEnumAsByte<enum class EProductQuality> Quality);
	bool STATIC_TeamPaintsAreDifferent(struct FLoadoutData* A, struct FLoadoutData* B);
	bool STATIC_OnlineProductsAreDifferent();
	bool STATIC_ProductsAreDifferent(TArray<int>* A, TArray<int>* B);
	bool STATIC_LoadoutsAreDifferent(struct FLoadoutData* A, struct FLoadoutData* B);
	float STATIC_UpdateInputValue(const struct FInputRate& Rate, float DesiredValue, float OldValue, float DeltaTime);
	struct FClientLoadoutData STATIC_ConvertToClientLoadout(struct FLoadoutData* FromData);
	void MapImageLoadedDelegate(const struct FMapImageLoadResult& Result);
	void ProductThumbnailRenderedDelegate(const struct FProductThumbnailResult& Result);
	void AssetLoadedDelegate(const struct FAssetLoadResult& Result);
	struct FRandomWeight STATIC_PickWeightedRandom(TArray<struct FRandomWeight> Arr, int* Index);
	bool STATIC_VehicleInputHasChangedForKick(struct FVehicleInputs* NewInput, struct FVehicleInputs* OldInput);
};


// Class TAGame.AIController_TA
// 0x01C8 (0x0550 - 0x0388)
class AAIController_TA : public AAIController
{
public:
	class ACar_TA*                                     Car;                                              		// 0x0388(0x0004) (CPF_Transient)
	class AVehicle_TA*                                 Vehicle;                                          		// 0x038C(0x0004) (CPF_Transient)
	class UBTComponent*                                BT;                                               		// 0x0390(0x0004) (CPF_Edit, CPF_ExportObject, CPF_Component, CPF_EditInline)
	class UBTProxyType*                                SelfProxyType;                                    		// 0x0394(0x0004) (CPF_Edit)
	class UBTProxyType*                                NoneProxyType;                                    		// 0x0398(0x0004) (CPF_Edit)
	class UBTProxyType*                                DebugProxyType;                                   		// 0x039C(0x0004) (CPF_Edit)
	class UBTProxyType*                                TeamCarsProxyType;                                		// 0x03A0(0x0004) (CPF_Edit)
	class UBTProxyType*                                EnemyCarsProxyType;                               		// 0x03A4(0x0004) (CPF_Edit)
	class UBTProxyType*                                OtherCarsProxyType;                               		// 0x03A8(0x0004) (CPF_Edit)
	class UBTProxyType*                                BoostPillsProxyType;                              		// 0x03AC(0x0004) (CPF_Edit)
	class UBTProxyType*                                SelectedProxyType;                                		// 0x03B0(0x0004) (CPF_Edit)
	class UBTTarget*                                   SelfTarget;                                       		// 0x03B4(0x0004) (CPF_Edit)
	class UBTTarget*                                   NoneTarget;                                       		// 0x03B8(0x0004) (CPF_Edit)
	class UBTTarget*                                   IteratorTarget;                                   		// 0x03BC(0x0004) (CPF_Edit)
	class UBTTarget*                                   TeamCarsTarget;                                   		// 0x03C0(0x0004) (CPF_Edit)
	class UBTTarget*                                   SelectedTarget;                                   		// 0x03C4(0x0004) (CPF_Edit)
	class UBTTarget*                                   ContextTarget;                                    		// 0x03C8(0x0004) (CPF_Transient)
	class UBTNode*                                     DebugBTNode;                                      		// 0x03CC(0x0004) (CPF_Edit)
	class UBTLockCollection*                           Locks;                                            		// 0x03D0(0x0004) (CPF_Edit, CPF_ExportObject, CPF_Component, CPF_EditInline)
	struct FSkillRange                                 SkillSteerError;                                  		// 0x03D4(0x000C) (CPF_Edit)
	struct FSkillRange                                 SkillSteerSpeed;                                  		// 0x03E0(0x000C) (CPF_Edit)
	struct FSkillRange                                 SkillThrottleSpeed;                               		// 0x03EC(0x000C) (CPF_Edit)
	class AGameEvent_TA*                               GameEvent;                                        		// 0x03F8(0x0004) (CPF_Transient)
	class AAIManager_TA*                               AIManager;                                        		// 0x03FC(0x0004) (CPF_Transient)
	TArray<struct FNamedEvent>                         QueuedEvents;                                     		// 0x0400(0x000C) (CPF_Transient, CPF_NeedCtorLink)
	struct FVehicleInputs                              Input;                                            		// 0x040C(0x0020) (CPF_Transient)
	struct FVector                                     ForwardDir;                                       		// 0x042C(0x000C) (CPF_Transient)
	struct FRotator                                    ForwardRotation;                                  		// 0x0438(0x000C) (CPF_Transient)
	struct FVector                                     GroundNormal;                                     		// 0x0444(0x000C) (CPF_Transient)
	TArray<struct FCachedProxyData>                    CachedProxyDatas;                                 		// 0x0450(0x000C) (CPF_Transient, CPF_NeedCtorLink)
	TArray<struct FCachedTargetData>                   CachedTargetDatas;                                		// 0x045C(0x000C) (CPF_Transient, CPF_NeedCtorLink)
	struct FMap_Mirror                                 TargetFilterMap;                                  		// 0x0468(0x003C) (CPF_Native, CPF_Transient)
	TArray<class UBTNode*>                             CachedTargetFilters;                              		// 0x04A4(0x000C) (CPF_Transient, CPF_NeedCtorLink)
	struct FVector                                     DebugDriveDestination;                            		// 0x04B0(0x000C) (CPF_Transient)
	struct FCachedObstaclesData                        CachedObstacles;                                  		// 0x04BC(0x0024) (CPF_Native, CPF_Transient)
	struct FAITraits                                   Traits;                                           		// 0x04E0(0x0008) (CPF_Transient)
	TArray<class ACar_TA*>                             TeamCars;                                         		// 0x04E8(0x000C) (CPF_Transient, CPF_NeedCtorLink)
	TArray<class ACar_TA*>                             EnemyCars;                                        		// 0x04F4(0x000C) (CPF_Transient, CPF_NeedCtorLink)
	TArray<class ACar_TA*>                             OtherCars;                                        		// 0x0500(0x000C) (CPF_Transient, CPF_NeedCtorLink)
	unsigned long                                      bForceUpdateConditions : 1;                       		// 0x050C(0x0004) (CPF_Const, CPF_Transient)
	unsigned long                                      bCanUseBoost : 1;                                 		// 0x050C(0x0004) (CPF_Transient)
	unsigned long                                      bBeingReplaced : 1;                               		// 0x050C(0x0004) (CPF_Transient)
	class UAIRole_TA*                                  TestRole;                                         		// 0x0510(0x0004)
	class UGameShare_TA*                               GameShare;                                        		// 0x0514(0x0004) (CPF_Transient)
	class AActor*                                      SelectedActor;                                    		// 0x0518(0x0004) (CPF_Const, CPF_Transient)
	float                                              FieldScalar;                                      		// 0x051C(0x0004) (CPF_Transient)
	struct FScriptDelegate                             __EventNamedEvent__Delegate;                      		// 0x0520(0x000C) (CPF_NeedCtorLink)
	unsigned char                                      UnknownData00[0x4];                               		// 0x0520(0x0004) FIX WRONG TYPE SIZE OF PREVIUS PROPERTY
	struct FScriptDelegate                             __EventSkillChanged__Delegate;                    		// 0x0530(0x000C) (CPF_NeedCtorLink)
	unsigned char                                      UnknownData01[0x4];                               		// 0x0530(0x0004) FIX WRONG TYPE SIZE OF PREVIUS PROPERTY
	struct FScriptDelegate                             __EventTraitsChanged__Delegate;                   		// 0x0540(0x000C) (CPF_NeedCtorLink)
	unsigned char                                      UnknownData02[0x4];                               		// 0x0540(0x0004) FIX WRONG TYPE SIZE OF PREVIUS PROPERTY

	static UClass* StaticClass()
	{
		static auto ptr = UObject::FindClass("Class TAGame.AIController_TA");
		return ptr;
	}


	void PrintDebugInfo(class UDebugDrawer* Drawer);
	void SetSelectedActor(class AActor* NewActor);
	void AllTargets(class UBTTarget* Target, struct FBTProxyData* OutData);
	bool GetObstacleInRadius(const struct FVector& Destination, float Radius, struct FVector* HitLocation);
	bool GetObstacle(const struct FVector& Destination, struct FVector* HitLocation);
	bool GetProxyDataInternal(class UBTProxyType* Type, int Index, struct FBTProxyData* OutData);
	bool GetIndexedProxyData(class UBTProxyType* Type, int Index, struct FBTProxyData* OutData);
	bool GetProxyData(class UBTProxyType* Type, struct FBTProxyData* OutData);
	bool GetIndexedTargetData(class UBTTarget* Target, int Index, struct FBTProxyData* OutData);
	bool GetTargetData(class UBTTarget* Target, struct FBTProxyData* OutData);
	struct FBTProxyData CreateVehicleProxyData(class AVehicle_TA* InVehicle);
	struct FBTProxyData CreateProxyData(class AActor* A, float Radius);
	float GetDriveTime(float Distance);
	float GetDriveDistance(const struct FBTProxyData& Proxy);
	struct FVector FlattenOffset(const struct FVector& Offset, float* Height);
	struct FVector FlattenDestination(const struct FVector& Destination);
	struct FBTProxyData FlattenPhysics(struct FBTProxyData* ProxyData);
	float GetClosestTime2D(float MaxTime, struct FBTProxyData* A, struct FBTProxyData* B);
	bool WillImpact2D(struct FBTProxyData* A, struct FBTProxyData* B, float* CollideTime);
	void AdvancePhysics(float Time, struct FBTProxyData* PhysicsData);
	void PredictPhysics(float Time, float GroundZ, struct FBTProxyData* PhysicsData);
	void PredictLanding(float GroundZ, struct FBTProxyData* Data, float* Time);
	struct FVector AdvanceLocation(float Time, struct FVector* Loc, struct FVector* Vel, struct FVector* Accel);
	void DebugDriveTo(const struct FVector& Destination);
	void DoNothing();
	void AbortBT();
	void OnNamedEvent(const struct FName& EventName, class AActor* Sender);
	void Destroyed();
	void OnCarSetup(class ACar_TA* InCar);
	void SetCar();
	void UnPossess();
	void Possess(class APawn* inPawn, bool bVehicleTransition);
	void SetSkill(float NewSkill);
	void ReInitBT();
	void SetTraits(const struct FAITraits& InTraits);
	void HandleOtherCarDestroyed(class APawn_X* InCar);
	void HandleOtherCarDemolished(class ACar_TA* Victim, const struct FDemolishData& Data);
	void HandleOtherCarTeamChanged(class ACar_TA* InCar);
	void HandleCarSpawned(class AGameEvent_TA* InGameEvent, class ACar_TA* InCar);
	void Init(class AGameEvent_TA* InGameEvent);
	void PreBeginPlay();
	void EventTraitsChanged(class AAIController_TA* AI);
	void EventSkillChanged(class AAIController_TA* AI);
	void EventNamedEvent(class AAIController_TA* AI, const struct FName& EventName, class AActor* Sender);
};


// Class TAGame.AIManager_TA
// 0x0028 (0x0214 - 0x01EC)
class AAIManager_TA : public AActor
{
public:
	unsigned long                                      bFlushAILogEachLine : 1;                          		// 0x01EC(0x0004) (CPF_Edit, CPF_Const, CPF_Config)
	unsigned long                                      bOutputLogToWindow : 1;                           		// 0x01EC(0x0004) (CPF_Edit, CPF_Const, CPF_Config)
	unsigned long                                      bPauseForDirtyTrees : 1;                          		// 0x01EC(0x0004) (CPF_Transient)
	class UBTLockCollection*                           Locks;                                            		// 0x01F0(0x0004) (CPF_Edit, CPF_Const, CPF_ExportObject, CPF_Component, CPF_EditInline)
	class AGameEvent_TA*                               GameEvent;                                        		// 0x01F4(0x0004) (CPF_Transient)
	TArray<class AAIController_TA*>                    Bots;                                             		// 0x01F8(0x000C) (CPF_Transient, CPF_NeedCtorLink)
	TArray<struct FCachedNavMeshLocation>              CachedNavMeshLocations;                           		// 0x0204(0x000C) (CPF_Transient, CPF_NeedCtorLink)
	class AFileLog*                                    AILogFile;                                        		// 0x0210(0x0004) (CPF_Transient)

	static UClass* StaticClass()
	{
		static auto ptr = UObject::FindClass("Class TAGame.AIManager_TA");
		return ptr;
	}


	void Destroyed();
	void RemoveBot(class AAIController_TA* Bot);
	void AddBot(class AAIController_TA* Bot);
	void Init(class AGameEvent_TA* InGameEvent);
	void AILog(class UObject* Sender, const struct FString& Message, bool bVerbose);
};


// Class TAGame.AnimNodeBlend_TA
// 0x000F (0x0100 - 0x00F1)
class UAnimNodeBlend_TA : public UAnimNodeBlendBase
{
public:
	unsigned char                                      UnknownData00[0x3];                               		// 0x00F1(0x0003) MISSED OFFSET
	float                                              BlendSpeed;                                       		// 0x00F4(0x0004) (CPF_Edit)
	float                                              Position;                                         		// 0x00F8(0x0004) (CPF_Transient)
	float                                              DesiredPosition;                                  		// 0x00FC(0x0004) (CPF_Transient)

	static UClass* StaticClass()
	{
		static auto ptr = UObject::FindClass("Class TAGame.AnimNodeBlend_TA");
		return ptr;
	}

};


// Class TAGame.AnimNodeBlendBoost_TA
// 0x0004 (0x0108 - 0x0104)
class UAnimNodeBlendBoost_TA : public UAnimNodeBlend
{
public:
	float                                              BlendTime;                                        		// 0x0104(0x0004) (CPF_Edit)

	static UClass* StaticClass()
	{
		static auto ptr = UObject::FindClass("Class TAGame.AnimNodeBlendBoost_TA");
		return ptr;
	}

};


// Class TAGame.AnimNodeBlendSpeed_TA
// 0x0008 (0x0144 - 0x013C)
class UAnimNodeBlendSpeed_TA : public UAnimNodeAimOffset
{
public:
	float                                              BlendRate;                                        		// 0x013C(0x0004) (CPF_Edit)
	float                                              MaxSpeed;                                         		// 0x0140(0x0004) (CPF_Edit)

	static UClass* StaticClass()
	{
		static auto ptr = UObject::FindClass("Class TAGame.AnimNodeBlendSpeed_TA");
		return ptr;
	}

};


// Class TAGame.AssetProfiler_TA
// 0x0054 (0x0240 - 0x01EC)
class AAssetProfiler_TA : public AActor
{
public:
	float                                              TimePerAsset;                                     		// 0x01EC(0x0004) (CPF_Edit)
	float                                              TimeBetweenAssets;                                		// 0x01F0(0x0004) (CPF_Edit)
	TArray<class UProductSlot_TA*>                     Slots;                                            		// 0x01F4(0x000C) (CPF_Edit, CPF_NeedCtorLink)
	struct FRenderProfile                              CurrentProfile;                                   		// 0x0200(0x001C) (CPF_Transient)
	TArray<struct FAssetProfile>                       AssetProfiles;                                    		// 0x021C(0x000C) (CPF_Transient, CPF_NeedCtorLink)
	int                                                CurrentProductID;                                 		// 0x0228(0x0004) (CPF_Transient)
	class UProductAsset_TA*                            CurrentProduct;                                   		// 0x022C(0x0004) (CPF_Transient)
	class UProductDatabase_TA*                         ProductsDB;                                       		// 0x0230(0x0004) (CPF_Transient)
	TArray<class ACarPreviewActor_TA*>                 Cars;                                             		// 0x0234(0x000C) (CPF_Transient, CPF_NeedCtorLink)

	static UClass* StaticClass()
	{
		static auto ptr = UObject::FindClass("Class TAGame.AssetProfiler_TA");
		return ptr;
	}


	int SortRenderThread(const struct FAssetProfile& A, const struct FAssetProfile& B);
	int SortGPU(const struct FAssetProfile& A, const struct FAssetProfile& B);
	void Finish();
	void StopRecording();
	void StartRecording();
	void StartNextAsset();
	void EquipProduct(class UProductAsset_TA* Asset);
	class UProductAsset_TA* EquipProductID(int ProductID);
	bool ShouldProfileProduct(class UProductAsset_TA* Product);
	void PrintAsset(const struct FString& AssetName, float AssetTime);
	void UpdateProfileTimes(struct FRenderProfile* Profile);
	void GatherCars();
	void DisableVSync();
	void SetupPlayers();
	void PostBeginPlay();
};


// Class TAGame.AttachmentBehavior_TA
// 0x000C (0x0048 - 0x003C)
class UAttachmentBehavior_TA : public UObject
{
public:
	class UProductAsset_TA*                            Asset;                                            		// 0x003C(0x0004) (CPF_Transient)
	class UActorComponent*                             Component;                                        		// 0x0040(0x0004) (CPF_ExportObject, CPF_Transient, CPF_Component, CPF_EditInline)
	unsigned long                                      bPreview : 1;                                     		// 0x0044(0x0004) (CPF_Transient)

	static UClass* StaticClass()
	{
		static auto ptr = UObject::FindClass("Class TAGame.AttachmentBehavior_TA");
		return ptr;
	}


	class UCarMeshComponent_TA* GetMesh();
	void SetPreviewing(bool bPreviewing);
	void OnInit();
	void Init(class UProductAsset_TA* InAsset, class UActorComponent* InComponent);
};


// Class TAGame.RimSpinner_TA
// 0x0030 (0x0078 - 0x0048)
class URimSpinner_TA : public UAttachmentBehavior_TA
{
public:
	float                                              AccelRate;                                        		// 0x0048(0x0004) (CPF_Edit)
	float                                              DecelRate;                                        		// 0x004C(0x0004) (CPF_Edit)
	float                                              MaxSpeed;                                         		// 0x0050(0x0004) (CPF_Edit)
	struct FName                                       BoneControlName;                                  		// 0x0054(0x0008) (CPF_Edit)
	float                                              SpinScale;                                        		// 0x005C(0x0004) (CPF_Transient)
	int                                                WheelIndex;                                       		// 0x0060(0x0004) (CPF_Transient)
	float                                              CurrentSpeed;                                     		// 0x0064(0x0004) (CPF_Transient)
	int                                                CurrentRotation;                                  		// 0x0068(0x0004) (CPF_Transient)
	class USkelControlSingleBone*                      SpinBoneController;                               		// 0x006C(0x0004) (CPF_Transient)
	class USkelControlSingleBone*                      WheelBoneController;                              		// 0x0070(0x0004) (CPF_Transient)
	class UWheel_TA*                                   Wheel;                                            		// 0x0074(0x0004) (CPF_ExportObject, CPF_Transient, CPF_Component, CPF_EditInline)

	static UClass* StaticClass()
	{
		static auto ptr = UObject::FindClass("Class TAGame.RimSpinner_TA");
		return ptr;
	}


	void HandleAttached(class UCarMeshComponent_TA* Mesh);
	void OnInit();
};


// Class TAGame.BallRadiusVolume_TA
// 0x0014 (0x0200 - 0x01EC)
class ABallRadiusVolume_TA : public AActor
{
public:
	float                                              Radius;                                           		// 0x01EC(0x0004) (CPF_Edit)
	class UDrawSphereComponent*                        PreviewRadius;                                    		// 0x01F0(0x0004) (CPF_Const, CPF_ExportObject, CPF_Component, CPF_EditInline)
	TArray<class ABall_TA*>                            Inradius;                                         		// 0x01F4(0x000C) (CPF_Transient, CPF_NeedCtorLink)

	static UClass* StaticClass()
	{
		static auto ptr = UObject::FindClass("Class TAGame.BallRadiusVolume_TA");
		return ptr;
	}


	void RemoveBall(class ABall_TA* Ball);
	void AddBall(class ABall_TA* Ball);
	void Tick(float DeltaTime);
};


// Class TAGame.RBActor_TA
// 0x01BC (0x0688 - 0x04CC)
class ARBActor_TA : public APawn_X
{
public:
	struct FPointer                                    VfTable_IITickNotify_TA;                          		// 0x04CC(0x0004) (CPF_Const, CPF_Native, CPF_NoExport)
	float                                              MaxLinearSpeed;                                   		// 0x04D0(0x0004) (CPF_Edit, CPF_Const)
	float                                              MaxAngularSpeed;                                  		// 0x04D4(0x0004) (CPF_Edit, CPF_Const)
	unsigned long                                      bDisableSleeping : 1;                             		// 0x04D8(0x0004) (CPF_Edit, CPF_Const)
	unsigned long                                      bReplayActor : 1;                                 		// 0x04D8(0x0004) (CPF_Const, CPF_Net, CPF_Transient)
	unsigned long                                      bFrozen : 1;                                      		// 0x04D8(0x0004) (CPF_Net, CPF_Transient)
	unsigned long                                      bAutoInitFXEffects : 1;                           		// 0x04D8(0x0004) (CPF_Const)
	unsigned long                                      bIgnoreSyncing : 1;                               		// 0x04D8(0x0004) (CPF_Net, CPF_Transient)
	unsigned long                                      bPhysInitialized : 1;                             		// 0x04D8(0x0004) (CPF_Transient)
	struct FNetworkSyncSettingsData                    NetworkSyncSettings;                              		// 0x04DC(0x001C) (CPF_Edit)
	struct FReplicatedRBState                          OldRBState;                                       		// 0x04F8(0x0038) (CPF_Const, CPF_Transient)
	struct FReplicatedRBState                          RBState;                                          		// 0x0530(0x0038) (CPF_Const, CPF_Transient)
	struct FReplicatedRBState                          ReplicatedRBState;                                		// 0x0568(0x0038) (CPF_Const, CPF_Net, CPF_Transient)
	struct FReplicatedRBState                          ClientCorrectionRBState;                          		// 0x05A0(0x0038) (CPF_Const, CPF_Transient)
	struct FWorldContactData                           WorldContact;                                     		// 0x05D8(0x0028) (CPF_Const, CPF_Transient)
	struct FVector                                     SyncErrorLocation;                                		// 0x0600(0x000C) (CPF_Const, CPF_Transient)
	float                                              SyncErrorAngle;                                   		// 0x060C(0x0004) (CPF_Const, CPF_Transient)
	struct FVector                                     SyncErrorAxis;                                    		// 0x0610(0x000C) (CPF_Const, CPF_Transient)
	class UAkParamGroup*                               Ak;                                               		// 0x061C(0x0004) (CPF_ExportObject, CPF_Component, CPF_EditInline)
	class AFXActor_X*                                  FXActorArchetype;                                 		// 0x0620(0x0004) (CPF_Edit)
	class AFXActor_X*                                  FXActor;                                          		// 0x0624(0x0004) (CPF_Transient)
	class UImpactEffectsComponent_TA*                  ImpactEffectsComponent;                           		// 0x0628(0x0004) (CPF_Edit, CPF_ExportObject, CPF_Component, CPF_EditInline)
	TArray<struct FAccumulatedRigidBodyCollision>      RBCollisions;                                     		// 0x062C(0x000C) (CPF_Const, CPF_Transient, CPF_Component, CPF_NeedCtorLink)
	class UClass*                                      RBHistoryClass;                                   		// 0x0638(0x0004) (CPF_Edit)
	class URBHistory_TA*                               RBHistory;                                        		// 0x063C(0x0004) (CPF_Const, CPF_ExportObject, CPF_Transient, CPF_Component, CPF_EditInline)
	int                                                LastRBCollisionsFrame;                            		// 0x0640(0x0004) (CPF_Const, CPF_Transient)
	class UReplayComponent_TA*                         Replay;                                           		// 0x0644(0x0004) (CPF_ExportObject, CPF_Component, CPF_EditInline)
	struct FWeldingInfo                                WeldedInfo;                                       		// 0x0648(0x0020) (CPF_Net, CPF_Transient)
	class ARBActor_TA*                                 WeldedActor;                                      		// 0x0668(0x0004) (CPF_Transient)
	class ARBActor_TA*                                 WeldedTo;                                         		// 0x066C(0x0004) (CPF_Transient)
	float                                              PreWeldMass;                                      		// 0x0670(0x0004) (CPF_Transient)
	struct FPointer                                    Constraint2D;                                     		// 0x0674(0x0004) (CPF_Native, CPF_Transient)
	struct FScriptDelegate                             __EventRigidBodyCollision__Delegate;              		// 0x0678(0x000C) (CPF_NeedCtorLink)
	unsigned char                                      UnknownData00[0x4];                               		// 0x0678(0x0004) FIX WRONG TYPE SIZE OF PREVIUS PROPERTY

	static UClass* StaticClass()
	{
		static auto ptr = UObject::FindClass("Class TAGame.RBActor_TA");
		return ptr;
	}


	void PrintDebugInfo(class UDebugDrawer* Drawer);
	void SetMass(float NewMass);
	void SetConstrained3D(const struct FVector& LinearLower, const struct FVector& LinearUpper, const struct FVector& AngularLower, const struct FVector& AngularUpper);
	void SetConstrained2D(bool bConstrain2D);
	void InitCCD();
	void SetPhysicsState(const struct FReplicatedRBState& NewState);
	void SetFrozen(bool bEnabled);
	void PlayDying(class UClass* DamageType, const struct FVector& HitLoc);
	bool TakeDamage_X(class UDamageComponent_X* Damage);
	void SetDyingPhysics();
	void SetMaxAngularSpeed(float NewMaxSpeed);
	void SetMaxLinearSpeed(float NewMaxSpeed);
	void OnRigidBodyCollision(const struct FAccumulatedRigidBodyCollision& Collision);
	void AddTorque(const struct FVector& Torque, TEnumAsByte<enum class EForceMode> ForceMode);
	void AddForce(const struct FVector& Force, TEnumAsByte<enum class EForceMode> ForceMode);
	void PreAsyncTick(float DeltaTime);
	void TextArchetypeReloaded();
	void SetWelding(const struct FWeldingInfo& Welding);
	void UnWeldRBActor(class ARBActor_TA* Other);
	void WeldRBActor(class ARBActor_TA* Other, const struct FVector& WeldOffset, const struct FRotator& WeldRotation);
	void OnRBPhysInit();
	void ReInitRBPhys();
	void TerminateRBPhys();
	void SetCurrentRBState(struct FReplicatedRBState* NewRBState);
	struct FVector GetCurrentRBLocation();
	struct FReplicatedRBState GetCurrentRBState();
	int GetPhysicsFrame();
	float GetPhysicsTime();
	void PopFXState(class UFXActorEvent_X* Event);
	void PushFXState(class UFXActorEvent_X* Event);
	void InitFX();
	void PostBeginPlay();
	void ReplicatedEvent(const struct FName& VarName);
	void EventRigidBodyCollision(class ARBActor_TA* RBActor, const struct FAccumulatedRigidBodyCollision& Collision);
};


// Class TAGame.Ball_TA
// 0x0164 (0x07EC - 0x0688)
class ABall_TA : public ARBActor_TA
{
public:
	class UStaticMeshComponent*                        StaticMesh;                                       		// 0x0688(0x0004) (CPF_Edit, CPF_ExportObject, CPF_Component, CPF_EditInline)
	class AFXActor_X*                                  EndOfGameFXArchetype;                             		// 0x068C(0x0004) (CPF_Edit)
	class AExplosion_X*                                ExplosionArchetype;                               		// 0x0690(0x0004) (CPF_Edit)
	class AExplosion_X*                                NoGoalExplosionArchetype;                         		// 0x0694(0x0004) (CPF_Edit)
	class UBallCamTarget_TA*                           BallCamTarget;                                    		// 0x0698(0x0004) (CPF_ExportObject, CPF_Component, CPF_EditInline)
	unsigned long                                      bNextCamTargetOnExplode : 1;                      		// 0x069C(0x0004)
	unsigned long                                      bNotifyGroundHit : 1;                             		// 0x069C(0x0004) (CPF_Transient)
	unsigned long                                      bEndOfGameHidden : 1;                             		// 0x069C(0x0004) (CPF_Net, CPF_Transient)
	unsigned long                                      bPredictionOnGround : 1;                          		// 0x069C(0x0004) (CPF_Const, CPF_Transient)
	unsigned long                                      bCanBeAttached : 1;                               		// 0x069C(0x0004) (CPF_Transient)
	unsigned long                                      bBallDemolish : 1;                                		// 0x069C(0x0004) (CPF_Transient)
	unsigned long                                      bNewFalling : 1;                                  		// 0x069C(0x0004) (CPF_Transient)
	unsigned long                                      bItemFreeze : 1;                                  		// 0x069C(0x0004) (CPF_Transient)
	float                                              Radius;                                           		// 0x06A0(0x0004) (CPF_Transient)
	float                                              VisualRadius;                                     		// 0x06A4(0x0004)
	TArray<struct FBallHitInfo>                        Touches;                                          		// 0x06A8(0x000C) (CPF_Transient, CPF_NeedCtorLink)
	float                                              LastCalculateCarHit;                              		// 0x06B4(0x0004) (CPF_Transient)
	struct FVector                                     InitialLocation;                                  		// 0x06B8(0x000C) (CPF_Transient)
	struct FRotator                                    InitialRotation;                                  		// 0x06C4(0x000C) (CPF_Transient)
	float                                              LastHitWorldTime;                                 		// 0x06D0(0x0004) (CPF_Transient)
	float                                              ReplicatedBallScale;                              		// 0x06D4(0x0004) (CPF_Net)
	class UStaticMesh*                                 ReplicatedBallMesh;                               		// 0x06D8(0x0004) (CPF_Net)
	float                                              ReplicatedWorldBounceScale;                       		// 0x06DC(0x0004) (CPF_Net)
	float                                              ReplicatedBallGravityScale;                       		// 0x06E0(0x0004) (CPF_Net)
	float                                              ReplicatedBallMaxLinearSpeedScale;                		// 0x06E4(0x0004) (CPF_Net)
	float                                              ReplicatedAddedCarBounceScale;                    		// 0x06E8(0x0004) (CPF_Net)
	float                                              AdditionalCarGroundBounceScaleZ;                  		// 0x06EC(0x0004)
	float                                              AdditionalCarGroundBounceScaleXY;                 		// 0x06F0(0x0004)
	unsigned char                                      HitTeamNum;                                       		// 0x06F4(0x0001) (CPF_Net, CPF_Transient)
	unsigned char                                      UnknownData00[0x3];                               		// 0x06F5(0x0003) MISSED OFFSET
	class AGameEvent_Soccar_TA*                        GameEvent;                                        		// 0x06F8(0x0004) (CPF_Net, CPF_Transient)
	struct FExplosionData                              ReplicatedExplosionData;                          		// 0x06FC(0x0010) (CPF_Net, CPF_Transient, CPF_Component)
	class AExplosion_X*                                Explosion;                                        		// 0x070C(0x0004) (CPF_Transient)
	float                                              ExplosionTime;                                    		// 0x0710(0x0004) (CPF_Transient)
	struct FVector                                     OldLocation;                                      		// 0x0714(0x000C) (CPF_Transient)
	class UMaterialInterface*                          FadeMaterial;                                     		// 0x0720(0x0004)
	float                                              PredictionTimestep;                               		// 0x0724(0x0004) (CPF_Edit)
	TArray<struct FPredictedPosition>                  PredictedPositions;                               		// 0x0728(0x000C) (CPF_Const, CPF_Transient, CPF_NeedCtorLink)
	float                                              LastPredictionTime;                               		// 0x0734(0x0004) (CPF_Const, CPF_Transient)
	float                                              BallSloMoRadius;                                  		// 0x0738(0x0004) (CPF_Transient)
	float                                              BallSloMoDuration;                                		// 0x073C(0x0004) (CPF_Transient)
	float                                              BallSloMoDilation;                                		// 0x0740(0x0004) (CPF_Transient)
