#pragma once

// Rocket League (1.31) SDK

#ifdef _MSC_VER
	#pragma pack(push, 0x4)
#endif

namespace SDK
{
//---------------------------------------------------------------------------
//Constants
//---------------------------------------------------------------------------

#define CONST_UnrealUnitsPerMeter                                100
#define CONST_MaxLoadoutSets                                     50
#define CONST_BoostLevel_Activated                               0.0f
#define CONST_MeshRadius                                         15.0f
#define CONST_MeshWidth                                          15.0f
#define CONST_MAX_REPLICATED_VOTERS                              8
#define CONST_PlayerCountIrrelevant                              "NO_COUNT"
#define CONST_BoostLevel_Active                                  1.0f
#define CONST_BoostLevel_Inactive                                -1.0f
#define CONST_MAX_NAMEPLATES                                     8

//---------------------------------------------------------------------------
//Enums
//---------------------------------------------------------------------------

// Enum TAGame._AITypes_TA.EAITraitValue
enum class EAITraitValue
{
	AITraitValue_Low               = 0,
	AITraitValue_Medium            = 1,
	AITraitValue_High              = 2,
	AITraitValue_MAX               = 3
};


// Enum TAGame._AITypes_TA.EBTStatus
enum class EBTStatus
{
	BTStatus_Fail                  = 0,
	BTStatus_Success               = 1,
	BTStatus_Running               = 2,
	BTStatus_MAX                   = 3
};


// Enum TAGame._AITypes_TA.EAITeam
enum class EAITeam
{
	AITeam_Self                    = 0,
	AITeam_Enemy                   = 1,
	AITeam_Any                     = 2,
	AITeam_MAX                     = 3
};


// Enum TAGame._Types_TA.EExperimentalMapStatus
enum class EExperimentalMapStatus
{
	EMS_Default                    = 0,
	EMS_OnlyExperimentalPlaylist   = 1,
	EMS_Any                        = 2,
	EMS_MAX                        = 3
};


// Enum TAGame._Types_TA.EMirrorFieldType
enum class EMirrorFieldType
{
	MFT_None                       = 0,
	MFT_X                          = 1,
	MFT_Y                          = 2,
	MFT_XY                         = 3,
	MFT_TeamIndex                  = 4,
	MFT_MAX                        = 5
};


// Enum TAGame._Types_TA.EUIMenuState
enum class EUIMenuState
{
	UIMS_StartMenu                 = 0,
	UIMS_MainMenu                  = 1,
	UIMS_MAX                       = 2
};


// Enum TAGame._Types_TA.EChatChannel
enum class EChatChannel
{
	EChatChannel_Match             = 0,
	EChatChannel_Team              = 1,
	EChatChannel_Party             = 2,
	EChatChannel_MAX               = 3
};


// Enum TAGame._Types_TA.ESkinType
enum class ESkinType
{
	EST_Default                    = 0,
	EST_Animated                   = 1,
	EST_AnimatedPrimaryOnly        = 2,
	EST_MAX                        = 3
};


// Enum TAGame._Types_TA.EKeySelection
enum class EKeySelection
{
	KS_Oldest                      = 0,
	KS_Newest                      = 1,
	KS_ShowKeyPicker               = 2,
	KS_MAX                         = 3
};


// Enum TAGame._Types_TA.EProductQuality
enum class EProductQuality
{
	EPQ_Common                     = 0,
	EPQ_Uncommon                   = 1,
	EPQ_Rare                       = 2,
	EPQ_VeryRare                   = 3,
	EPQ_Import                     = 4,
	EPQ_Exotic                     = 5,
	EPQ_BlackMarket                = 6,
	EPQ_Premium                    = 7,
	EPQ_Limited                    = 8,
	EPQ_MAX                        = 9
};


// Enum TAGame._Types_TA.EUnlockMethod
enum class EUnlockMethod
{
	UnlockMethod_Default           = 0,
	UnlockMethod_Drop              = 1,
	UnlockMethod_Special           = 2,
	UnlockMethod_Reward            = 3,
	UnlockMethod_DLC               = 4,
	UnlockMethod_Never             = 5,
	UnlockMethod_MAX               = 6
};


// Enum TAGame._Types_TA.EPaintFinishType
enum class EPaintFinishType
{
	PaintFinishType_Standard       = 0,
	PaintFinishType_Metallic       = 1,
	PaintFinishType_MAX            = 2
};


// Enum TAGame._Types_TA.EPaintColorVariant
enum class EPaintColorVariant
{
	PaintColorVariant_Primary      = 0,
	PaintColorVariant_LightAccent  = 1,
	PaintColorVariant_DarkAccent   = 2,
	PaintColorVariant_Emissive     = 3,
	PaintColorVariant_MAX          = 4
};


// Enum TAGame._Types_TA.EChallengeState
enum class EChallengeState
{
	ChallengeState_None            = 0,
	ChallengeState_Active          = 1,
	ChallengeState_Unlocked        = 2,
	ChallengeState_MAX             = 3
};


// Enum TAGame._Types_TA.ECustomMatchSettingsType
enum class ECustomMatchSettingsType
{
	CustomMatchSettingsType_PrivateMatch = 0,
	CustomMatchSettingsType_LocalMatch = 1,
	CustomMatchSettingsType_TourCreate = 2,
	CustomMatchSettingsType_MAX    = 3
};


// Enum TAGame._Types_TA.EReportPlayerReason
enum class EReportPlayerReason
{
	ReportPlayerReason_Harrassment = 0,
	ReportPlayerReason_UnsportsmanlikeConduct = 1,
	ReportPlayerReason_Cheating    = 2,
	ReportPlayerReason_MAX         = 3
};


// Enum TAGame._Types_TA.EEditingType
enum class EEditingType
{
	ET_FreeCam                     = 0,
	ET_Ball                        = 1,
	ET_Car                         = 2,
	ET_MAX                         = 3
};


// Enum TAGame._Types_TA.EEquippableProductSlot
enum class EEquippableProductSlot
{
	EPS_Skin                       = 0,
	EPS_Wheels                     = 1,
	EPS_Boost                      = 2,
	EPS_Hat                        = 3,
	EPS_Antenna                    = 4,
	EPS_MAX                        = 5
};


// Enum TAGame._Types_TA.EEquipAction
enum class EEquipAction
{
	EquipAction_Both               = 0,
	EquipAction_Team0              = 1,
	EquipAction_Team1              = 2,
	EquipAction_MAX                = 3
};


// Enum TAGame._Types_TA.EHistory
enum class EHistory
{
	H_None                         = 0,
	H_Add                          = 1,
	H_Remove                       = 2,
	H_MAX                          = 3
};


// Enum TAGame._Types_TA.EHistoryType
enum class EHistoryType
{
	HT_None                        = 0,
	HT_Undo                        = 1,
	HT_Redo                        = 2,
	HT_MAX                         = 3
};


// Enum TAGame._Types_TA.EPawnType
enum class EPawnType
{
	PT_Player                      = 0,
	PT_Spectator                   = 1,
	PT_Editor                      = 2,
	PT_MAX                         = 3
};


// Enum TAGame._Types_TA.ESaveGameResult
enum class ESaveGameResult
{
	SaveGameResult_Pending         = 0,
	SaveGameResult_Success         = 1,
	SaveGameResult_UserNotSignedIn = 2,
	SaveGameResult_Error           = 3,
	SaveGameResult_NoSpace         = 4,
	SaveGameResult_MAX             = 5
};


// Enum TAGame._Types_TA.EProductThumbnailSize
enum class EProductThumbnailSize
{
	PTS_Garage                     = 0,
	PTS_Drop                       = 1,
	PTS_Preview                    = 2,
	PTS_MAX                        = 3
};


// Enum TAGame._Types_TA.EPartyChatCommands
enum class EPartyChatCommands
{
	EPartyChat_Message             = 0,
	EPartyChat_Clear               = 1,
	EPartyChat_Repopulated         = 2,
	EPartyChat_MAX                 = 3
};


// Enum TAGame._Types_TA.EProductAttachmentSocket
enum class EProductAttachmentSocket
{
	PAS_Hat                        = 0,
	PAS_Front                      = 1,
	PAS_Antenna                    = 2,
	PAS_UnderGlow                  = 3,
	PAS_Root                       = 4,
	PAS_MAX                        = 5
};


// Enum TAGame._Types_TA.ETAStatType
enum class ETAStatType
{
	StatType_Private               = 0,
	StatType_Unranked              = 1,
	StatType_Ranked                = 2,
	StatType_MAX                   = 3
};


// Enum TAGame._Types_TA.EBallHitType
enum class EBallHitType
{
	HitType_Item0                  = 0,
	HitType_Item1                  = 1,
	HitType_Item2                  = 2,
	HitType_Car                    = 3,
	HitType_MAX                    = 4
};


// Enum TAGame._Types_TA.EVoteStatus
enum class EVoteStatus
{
	VOTE_Pending                   = 0,
	VOTE_Yes                       = 1,
	VOTE_No                        = 2,
	VOTE_MAX                       = 3
};


// Enum TAGame._Types_TA.ETrainingTag
enum class ETrainingTag
{
	Tag_Aerials                    = 0,
	Tag_Bounces                    = 1,
	Tag_Shots                      = 2,
	Tag_Saves                      = 3,
	Tag_Clears                     = 4,
	Tag_Rebounds                   = 5,
	Tag_Redirects                  = 6,
	Tag_Freestyles                 = 7,
	Tag_Dribbles                   = 8,
	Tag_AirDribbles                = 9,
	Tag_Kickoffs                   = 10,
	Tag_WallShots                  = 11,
	Tag_LongShots                  = 12,
	Tag_CloseShots                 = 13,
	Tag_AngleShots                 = 14,
	Tag_BackwardsShots             = 15,
	Tag_Offense                    = 16,
	Tag_Defense                    = 17,
	Tag_PinchShots                 = 18,
	Tag_MAX                        = 19
};


// Enum TAGame._Types_TA.EDifficulty
enum class EDifficulty
{
	D_Easy                         = 0,
	D_Medium                       = 1,
	D_Hard                         = 2,
	D_MAX                          = 3
};


// Enum TAGame._Types_TA.ETrainingType
enum class ETrainingType
{
	Training_None                  = 0,
	Training_Aerial                = 1,
	Training_Goalie                = 2,
	Training_Striker               = 3,
	Training_MAX                   = 4
};


// Enum TAGame._Types_TA.EDemolishSpeed
enum class EDemolishSpeed
{
	DemolishSpeed_Supersonic       = 0,
	DemolishSpeed_None             = 1,
	DemolishSpeed_MAX              = 2
};


// Enum TAGame._Types_TA.EDemolishTarget
enum class EDemolishTarget
{
	DemolishTarget_OtherTeam       = 0,
	DemolishTarget_Everyone        = 1,
	DemolishTarget_None            = 2,
	DemolishTarget_MAX             = 3
};


// Enum TAGame._Types_TA.EProductFilterLogLevel
enum class EProductFilterLogLevel
{
	ProductFilterLogLevel_Filtered = 0,
	ProductFilterLogLevel_UnFiltered = 1,
	ProductFilterLogLevel_MAX      = 2
};


// Enum TAGame._Types_TA.EProductTradeRestriction
enum class EProductTradeRestriction
{
	ProductTradeRestriction_P2P    = 0,
	ProductTradeRestriction_TradeIn = 1,
	ProductTradeRestriction_MAX    = 2
};


// Enum TAGame._Types_TA.EControllerSoundMode
enum class EControllerSoundMode
{
	CSM_Multiplayer                = 0,
	CSM_On                         = 1,
	CSM_Off                        = 2,
	CSM_MAX                        = 3
};


// Enum TAGame._Types_TA.EVoiceFilter
enum class EVoiceFilter
{
	VoiceFilter_All                = 0,
	VoiceFilter_Preset             = 1,
	VoiceFilter_Team               = 2,
	VoiceFilter_Friends            = 3,
	VoiceFilter_None               = 4,
	VoiceFilter_MAX                = 5
};


// Enum TAGame._Types_TA.EPaintTeam
enum class EPaintTeam
{
	PaintTeam_Blue                 = 0,
	PaintTeam_Orange               = 1,
	PaintTeam_None                 = 2,
	PaintTeam_MAX                  = 3
};


// Enum TAGame._Types_TA.SearchStatusOwner
enum class ESearchStatusOwner
{
	StatusOwner_None               = 0,
	StatusOwner_Matchmaking        = 1,
	StatusOwner_PrivateMatch       = 2,
	StatusOwner_Lan                = 3,
	StatusOwner_Tournaments        = 4,
	StatusOwner_MAX                = 5
};


// Enum TAGame._Types_TA.EMatchmakingViewTab
enum class EMatchmakingViewTab
{
	MatchmakingViewTab_Unranked    = 0,
	MatchmakingViewTab_Ranked      = 1,
	MatchmakingViewTab_MAX         = 2
};


// Enum TAGame._Types_TA.EWheelPosition
enum class EWheelPosition
{
	WP_FrontLeft                   = 0,
	WP_FrontRight                  = 1,
	WP_BackLeft                    = 2,
	WP_BackRight                   = 3,
	WP_MAX                         = 4
};


// Enum TAGame.AchievementManager_TA.EAchievementType
enum class EAchievementType
{
	AT_Game                        = 0,
	AT_EXP0                        = 1,
	AT_DLC0                        = 2,
	AT_DLC1                        = 3,
	AT_DLC2                        = 4,
	AT_XBO0                        = 5,
	AT_DLC3                        = 6,
	AT_DLC4                        = 7,
	AT_DLC5                        = 8,
	AT_DLC6                        = 9,
	AT_MAX                         = 10
};


// Enum TAGame.AchievementManager_TA.EAchievementGame
enum class EAchievementGame
{
	AG_Virtuoso                    = 0,
	AG_Stocked                     = 1,
	AG_FarFarAway                  = 2,
	AG_SuperVictorious             = 3,
	AG_Champion                    = 4,
	AG_TheStreak                   = 5,
	AG_HelensPride                 = 6,
	AG_BattleCarCollector          = 7,
	AG_DropsintheBucket            = 8,
	AG_Rocketeer                   = 9,
	AG_GreaseMonkey                = 10,
	AG_PitchVeteran                = 11,
	AG_RidersBlock                 = 12,
	AG_BreakShot                   = 13,
	AG_Turbocharger                = 14,
	AG_DrillSergeant               = 15,
	AG_MinutetoWinit               = 16,
	AG_SpeedDemon                  = 17,
	AG_PickMeUp                    = 18,
	AG_WallCrawler                 = 19,
	AG_TeamPlayer                  = 20,
	AG_SARPBCForever               = 21,
	AG_FeatherinYourRecap          = 22,
	AG_Winner                      = 23,
	AG_CleanSheet                  = 24,
	AG_TripleThreat                = 25,
	AG_DoubleUp                    = 26,
	AG_SinglesClub                 = 27,
	AG_PerfectStart                = 28,
	AG_StillAShowOff               = 29,
	AG_KnowTheDrill                = 30,
	AG_Traveler                    = 31,
	AG_Tinkerer                    = 32,
	AG_FirstTimer                  = 33,
	AG_BarrasBravas                = 34,
	AG_Friendly                    = 35,
	AG_MAX                         = 36
};


// Enum TAGame.AchievementManager_TA.EAchievementEXP0
enum class EAchievementEXP0
{
	AEXP0_SkyHigh                  = 0,
	AEXP0_AllFours                 = 1,
	AEXP0_Gladiator                = 2,
	AEXP0_MAX                      = 3
};


// Enum TAGame.AchievementManager_TA.EAchievementDLC0
enum class EAchievementDLC0
{
	ADLC0_WinningIsWinning         = 0,
	ADLC0_AnInchAnd62Miles         = 1,
	ADLC0_RideOrDie                = 2,
	ADLC0_DontLookBack             = 3,
	ADLC0_FamilyNotFriends         = 4,
	ADLC0_DriftKing                = 5,
	ADLC0_MAX                      = 6
};


// Enum TAGame.AchievementManager_TA.EAchievementDLC1
enum class EAchievementDLC1
{
	ADLC1_SurvivalOfTheFittest     = 0,
	ADLC1_Heartbreaker             = 1,
	ADLC1_NaturalProgression       = 2,
	ADLC1_Throwback                = 3,
	ADLC1_HotShotPartTwo           = 4,
	ADLC1_MAX                      = 5
};


// Enum TAGame.AchievementManager_TA.EAchievementDLC2
enum class EAchievementDLC2
{
	ADLC2_MyWorldIsFire            = 0,
	ADLC2_Spectacular              = 1,
	ADLC2_Savage                   = 2,
	ADLC2_Ruthless                 = 3,
	ADLC2_PsychoMasterExploder     = 4,
	ADLC2_MAX                      = 5
};


// Enum TAGame.AchievementManager_TA.EAchievementXBO0
enum class EAchievementXBO0
{
	AXBO0_NiceHat                  = 0,
	AXBO0_MarcusVMasterChief       = 1,
	AXBO0_MAX                      = 2
};


// Enum TAGame.AchievementManager_TA.EAchievementDLC6
enum class EAchievementDLC6
{
	ADLC6_StormTrooper             = 0,
	ADLC6_GoodTimes                = 1,
	ADLC6_SwapMeet                 = 2,
	ADLC6_TradeSecret              = 3,
	ADLC6_RankUp                   = 4,
	ADLC6_ComingOnStrong           = 5,
	ADLC6_MAX                      = 6
};


// Enum TAGame.AchievementManager_TA.EAchievementDLC5
enum class EAchievementDLC5
{
	ADLC5_RegisteredVoter          = 0,
	ADLC5_Metaverse                = 1,
	ADLC5_BraveTheElements         = 2,
	ADLC5_DamageControl            = 3,
	ADLC5_FullCourse               = 4,
	ADLC5_BuckminsterX10           = 5,
	ADLC5_MAX                      = 6
};


// Enum TAGame.AchievementManager_TA.EAchievementDLC4
enum class EAchievementDLC4
{
	ADLC4_GG                       = 0,
	ADLC4_Trifecta                 = 1,
	ADLC4_InfinitePower            = 2,
	ADLC4_StoppedCold              = 3,
	ADLC4_SeaTurtle                = 4,
	ADLC4_GetUpMrBubbles           = 5,
	ADLC4_RocketGenocider          = 6,
	ADLC4_MAX                      = 7
};


// Enum TAGame.AchievementManager_TA.EAchievementDLC3
enum class EAchievementDLC3
{
	ADLC3_MadScientist             = 0,
	ADLC3_IcingTheCake             = 1,
	ADLC3_LeftWingRightWing        = 2,
	ADLC3_FastBreak                = 3,
	ADLC3_BuzzerBeater             = 4,
	ADLC3_BuddingArtist            = 5,
	ADLC3_OneBetter                = 6,
	ADLC3_Certifiable              = 7,
	ADLC3_MAX                      = 8
};


// Enum TAGame.ActivityFeedManager_TA.EActivityFeedType
enum class EActivityFeedType
{
	AF_UnlockedBody                = 0,
	AF_DrivenDistance              = 1,
	AF_ScoredGoal                  = 2,
	AF_BlockedShot                 = 3,
	AF_WonGame                     = 4,
	AF_MVPScore                    = 5,
	AF_DefeatedFriend              = 6,
	AF_CompletedRegularSeason      = 7,
	AF_WonChampionship             = 8,
	AF_UnlockedItem                = 9,
	AF_UnlockedSweetTooth          = 10,
	AF_MAX                         = 11
};


// Enum TAGame.PitchTekDrawingComponent_TA.EPitchTekDecalType
enum class EPitchTekDecalType
{
	PTDT_Ball                      = 0,
	PTDT_Car                       = 1,
	PTDT_MAX                       = 2
};


// Enum TAGame.BTLock.ELockScope
enum class ELockScope
{
	LockScope_Local                = 0,
	LockScope_Global               = 1,
	LockScope_MAX                  = 2
};


// Enum TAGame.CameraState_ReplayAutoCam_TA.ECountDownFocus
enum class ECountDownFocus
{
	CDF_None                       = 0,
	CDF_Pan                        = 1,
	CDF_Rotate                     = 2,
	CDF_MAX                        = 3
};


// Enum TAGame.GFxData_LocalPlayer_TA.ESplitScreenPosition
enum class ESplitScreenPosition
{
	SSP_Center                     = 0,
	SSP_Left                       = 1,
	SSP_Right                      = 2,
	SSP_Top                        = 3,
	SSP_Bottom                     = 4,
	SSP_TopLeft                    = 5,
	SSP_TopRight                   = 6,
	SSP_BottomLeft                 = 7,
	SSP_BottomRight                = 8,
	SSP_MAX                        = 9
};


// Enum TAGame.ProductAsset_Body_TA.EForceProductsBehavior
enum class EForceProductsBehavior
{
	FPB_Licensed                   = 0,
	FPB_All                        = 1,
	FPB_MAX                        = 2
};


// Enum TAGame.GameEvent_Tutorial_TA.ERotationType
enum class ERotationType
{
	Rot_Auto                       = 0,
	Rot_AutoAim                    = 1,
	Rot_AutoForward                = 2,
	Rot_AutoArch                   = 3,
	Rot_World                      = 4,
	Rot_MapCenter                  = 5,
	Rot_MAX                        = 6
};


// Enum TAGame.GFxData_OnlineMatchStatus_TA.SearchMessageType
enum class ESearchMessageType
{
	MessageType_Status             = 0,
	MessageType_Warning            = 1,
	MessageType_MAX                = 2
};


// Enum TAGame.GFxData_UserSetting_TA.EUserSettingType
enum class EUserSettingType
{
	UserSettingType_List           = 0,
	UserSettingType_Boolean        = 1,
	UserSettingType_Scalar         = 2,
	UserSettingType_MAX            = 3
};


// Enum TAGame.GFxData_Training_TA.EV2TutorialType
enum class EV2TutorialType
{
	V2T_Basic                      = 0,
	V2T_Advanced                   = 1,
	V2T_BasicTeam                  = 2,
	V2T_AdvancedTeam               = 3,
	V2T_MAX                        = 4
};


// Enum TAGame.GFxEngine_TA.ESoundStatePriority
enum class ESoundStatePriority
{
	SSP_None                       = 0,
	SSP_Scoreboard                 = 1,
	SSP_Replay                     = 2,
	SSP_Pause                      = 3,
	SSP_BeginRound                 = 4,
	SSP_EndRound                   = 5,
	SSP_WinnerMenu                 = 6,
	SSP_MAX                        = 7
};


// Enum TAGame.ProductAsset_Wheel_TA.EMeshMirrorMode
enum class EMeshMirrorMode
{
	MeshMirrorMode_Mirror          = 0,
	MeshMirrorMode_Rotate          = 1,
	MeshMirrorMode_MAX             = 2
};


// Enum TAGame.Profile_TA.EProfileVersion
enum class EProfileVersion
{
	ProfileVersion_Initial         = 0,
	ProfileVersion_LoadoutPlayerTitle = 1,
	ProfileVersion_SaveReplayInput = 2,
	ProfileVersion_SaveReplayInput2 = 3,
	ProfileVersion_ChatRebind      = 4,
	ProfileVersion_SaveReplayInput3 = 5,
	ProfileVersion_DingoChatFix    = 6,
	ProfileVersion_CustomMatchSettings = 7,
	ProfileVersion_ChatSettings    = 8,
	ProfileVersion_TeamLoadouts    = 9,
	ProfileVersion_CarColors       = 10,
	ProfileVersion_ChatGamepadBindingConsoleOnly = 11,
	ProfileVersion_PaintFinishInLoadouts = 12,
	ProfileVersion_MusicPlaylistSelector = 13,
	ProfileVersion_MAX             = 14
};


// Enum TAGame.Replay_TA.EReplayVersion
enum class EReplayVersion
{
	ReplayVersion_Base             = 0,
	ReplayVersion_OnlineLoadout    = 1,
	ReplayVersion_CameraSettings   = 2,
	ReplayVersion_TeamLoadouts     = 3,
	ReplayVersion_MatchType        = 4,
	ReplayVersion_ActorName        = 5,
	ReplayVersion_MAX              = 6
};


// Enum TAGame.Replay_TA.EReplayState
enum class EReplayState
{
	ReplayState_Idle               = 0,
	ReplayState_Recording          = 1,
	ReplayState_Playing            = 2,
	ReplayState_MAX                = 3
};


// Enum TAGame.SaveData_TA.ESaveDataVersion
enum class ESaveDataVersion
{
	SaveDataVersion_Initial        = 0,
	SaveDataVersion_LightShafts    = 1,
	SaveDataVersion_NewOnlineProductsRemoved = 2,
	SaveDataVersion_MAX            = 3
};


// Enum TAGame.SkelControlSingleBoneCopy_TA.ECopyAxis
enum class ECopyAxis
{
	CopyAxis_X                     = 0,
	CopyAxis_Y                     = 1,
	CopyAxis_Z                     = 2,
	CopyAxis_Pitch                 = 3,
	CopyAxis_Yaw                   = 4,
	CopyAxis_Roll                  = 5,
	CopyAxis_MAX                   = 6
};


// Enum TAGame.Tutorial_TA.ETutorialOutput
enum class ETutorialOutput
{
	TutorialOutput_Ended           = 0,
	TutorialOutput_Completed       = 1,
	TutorialOutput_Failed          = 2,
	TutorialOutput_ScreenFadedIn   = 3,
	TutorialOutput_ScreenFadedOut  = 4,
	TutorialOutput_AllMessagesDisplayed = 5,
	TutorialOutput_Started         = 6,
	TutorialOutput_MAX             = 7
};


// Enum TAGame.Tutorial_TA.ETutorialStatus
enum class ETutorialStatus
{
	TutorialStatus_None            = 0,
	TutorialStatus_Failed          = 1,
	TutorialStatus_Completed       = 2,
	TutorialStatus_MAX             = 3
};


// Enum TAGame.Tutorial_TA.EPlayerDriveType
enum class EPlayerDriveType
{
	PlayerDriveType_All            = 0,
	PlayerDriveType_Player         = 1,
	PlayerDriveType_Bot            = 2,
	PlayerDriveType_MAX            = 3
};


// Enum TAGame.BreakOutActor_Platform_TA.EBreakoutDamageState
enum class EBreakoutDamageState
{
	DamageState_Start              = 0,
	DamageState_Damaged            = 1,
	DamageState_Broken             = 2,
	DamageState_MAX                = 3
};


// Enum TAGame.DistributionFloatSpeed_TA.ESpeedDistributionSpace
enum class ESpeedDistributionSpace
{
	SDD_Forward                    = 0,
	SDD_Side                       = 1,
	SDD_Up                         = 2,
	SDD_World                      = 3,
	SDD_MAX                        = 4
};


// Enum TAGame.ForceVolume_TA.EForceDirection
enum class EForceDirection
{
	EFD_VolumeRotation             = 0,
	EFD_ActorVelocity              = 1,
	EFD_Custom                     = 2,
	EFD_MAX                        = 3
};


// Enum TAGame.InterpTrackSkelControlRotation_TA.ERotationAxis
enum class ERotationAxis
{
	ROTAXIS_Yaw                    = 0,
	ROTAXIS_Pitch                  = 1,
	ROTAXIS_Roll                   = 2,
	ROTAXIS_MAX                    = 3
};


// Enum TAGame.ProductAttribute_Trademark_TA.ETrademarkGlyph
enum class ETrademarkGlyph
{
	TrademarkGlyph_TradeMark       = 0,
	TrademarkGlyph_Registered      = 1,
	TrademarkGlyph_Copyright       = 2,
	TrademarkGlyph_MAX             = 3
};


// Enum TAGame.GameEditor_Ring_TA.EDetectionType
enum class EDetectionType
{
	DT_Ball                        = 0,
	DT_Player                      = 1,
	DT_MAX                         = 2
};


// Enum TAGame.GameEvent_TrainingEditor_TA.EPlayTestType
enum class EPlayTestType
{
	PlayTest_LoopRound             = 0,
	PlayTest_IncrementRound        = 1,
	PlayTest_IncrementRoundLoop    = 2,
	PlayTest_MAX                   = 3
};


// Enum TAGame.SaveData_GameEditor_Training_TA.ETrainingSaveType
enum class ETrainingSaveType
{
	ETS_MyTraining                 = 0,
	ETS_Favorited                  = 1,
	ETS_Downloaded                 = 2,
	ETS_MAX                        = 3
};


// Enum TAGame.MenuSequencer_TA.ESequenceStatus
enum class ESequenceStatus
{
	SS_Idle                        = 0,
	SS_Entering                    = 1,
	SS_Leaving                     = 2,
	SS_Pending                     = 3,
	SS_MAX                         = 4
};


// Enum TAGame.CameraStateSelector_Priority_TA.EStatePriority
enum class EStatePriority
{
	SP_Default                     = 0,
	SP_OverrideAny                 = 1,
	SP_OverrideLower               = 2,
	SP_MAX                         = 3
};


// Enum TAGame.GFxData_MapPrefs_TA.EMapPrefType
enum class EMapPrefType
{
	MapPrefType_None               = 0,
	MapPrefType_Like               = 1,
	MapPrefType_Dislike            = 2,
	MapPrefType_MAX                = 3
};


// Enum TAGame.GFxData_ProductFilter_TA.EProductFilterType
enum class EProductFilterType
{
	ProductFilterType_TradeIn      = 0,
	ProductFilterType_P2P          = 1,
	ProductFilterType_MAX          = 2
};


// Enum TAGame.GFxData_TrainingModeBrowser_TA.ETrainingModeSearchTypes
enum class ETrainingModeSearchTypes
{
	TMST_AllPublic                 = 0,
	TMST_FeaturedOnly              = 1,
	TMST_MAX                       = 2
};


// Enum TAGame.SpecialPickup_Spring_TA.ESpringState
enum class ESpringState
{
	SpringState_Traveling          = 0,
	SpringState_PostHit            = 1,
	SpringState_MAX                = 2
};


// Enum TAGame.SpecialPickup_BallFreeze_TA.BallFreezeState
enum class EBallFreezeState
{
	STATE_Freezing                 = 0,
	STATE_Frozen                   = 1,
	STATE_MAX                      = 2
};


// Enum TAGame.SpecialPickup_GrapplingHook_TA.ERopeState
enum class ERopeState
{
	RopeState_Traveling            = 0,
	RopeState_Attached             = 1,
	RopeState_MAX                  = 2
};


// Enum TAGame.StaticMeshRBActor_TA.EApplyForceTo
enum class EApplyForceTo
{
	EAF_None                       = 0,
	EAF_Any                        = 1,
	EAF_CarOnly                    = 2,
	EAF_BallOnly                   = 3,
	EAF_MAX                        = 4
};



//---------------------------------------------------------------------------
//Script Structs
//---------------------------------------------------------------------------

// ScriptStruct TAGame.AIController_TA.SkillRange
// 0x000C
struct FSkillRange
{
	float                                              Easy;                                                     // 0x0000(0x0004) (CPF_Edit)
	float                                              Hard;                                                     // 0x0004(0x0004) (CPF_Edit)
	float                                              Value;                                                    // 0x0008(0x0004) (CPF_Transient)
};

// ScriptStruct TAGame._AITypes_TA.NamedEvent
// 0x0010
struct FNamedEvent
{
	struct FName                                       EventName;                                                // 0x0000(0x0008)
	class AActor*                                      Sender;                                                   // 0x0008(0x0004)
	float                                              RadiusSq;                                                 // 0x000C(0x0004)
};

// ScriptStruct TAGame._Types_TA.VehicleInputs
// 0x0020
struct FVehicleInputs
{
	float                                              Throttle;                                                 // 0x0000(0x0004) (CPF_Edit)
	float                                              Steer;                                                    // 0x0004(0x0004) (CPF_Edit)
	float                                              Pitch;                                                    // 0x0008(0x0004) (CPF_Edit)
	float                                              Yaw;                                                      // 0x000C(0x0004) (CPF_Edit)
	float                                              Roll;                                                     // 0x0010(0x0004) (CPF_Edit)
	float                                              DodgeForward;                                             // 0x0014(0x0004) (CPF_Edit)
	float                                              DodgeStrafe;                                              // 0x0018(0x0004) (CPF_Edit)
	unsigned long                                      bJump : 1;                                                // 0x001C(0x0004) (CPF_Edit)
	unsigned long                                      bActivateBoost : 1;                                       // 0x001C(0x0004) (CPF_Edit)
	unsigned long                                      bHoldingBoost : 1;                                        // 0x001C(0x0004) (CPF_Edit)
	unsigned long                                      bHandbrake : 1;                                           // 0x001C(0x0004) (CPF_Edit)
	unsigned long                                      bJumped : 1;                                              // 0x001C(0x0004)
};

// ScriptStruct TAGame._AITypes_TA.BTProxyData
// 0x0040
struct FBTProxyData
{
	struct FVector                                     Location;                                                 // 0x0000(0x000C)
	struct FVector                                     Velocity;                                                 // 0x000C(0x000C)
	struct FVector                                     Gravity;                                                  // 0x0018(0x000C)
	struct FRotator                                    Rotation;                                                 // 0x0024(0x000C)
	float                                              Radius;                                                   // 0x0030(0x0004)
	float                                              Bounce;                                                   // 0x0034(0x0004)
	class AActor*                                      Actor;                                                    // 0x0038(0x0004)
	class AVehicle_TA*                                 Vehicle;                                                  // 0x003C(0x0004)
};

// ScriptStruct TAGame.AIController_TA.CachedProxyData
// 0x004C
struct FCachedProxyData
{
	class UBTProxyType*                                Type;                                                     // 0x0000(0x0004)
	int                                                Index;                                                    // 0x0004(0x0004)
	struct FBTProxyData                                Data;                                                     // 0x0008(0x0040)
	float                                              CacheTime;                                                // 0x0048(0x0004)
};

// ScriptStruct TAGame.AIController_TA.CachedTargetData
// 0x004C
struct FCachedTargetData
{
	class UBTTarget*                                   Target;                                                   // 0x0000(0x0004)
	int                                                Index;                                                    // 0x0004(0x0004)
	struct FBTProxyData                                Data;                                                     // 0x0008(0x0040)
	float                                              CacheTime;                                                // 0x0048(0x0004)
};

// ScriptStruct TAGame.AIController_TA.CachedObstaclePoly
// 0x0020
struct FCachedObstaclePoly
{
	struct FPointer                                    Poly;                                                     // 0x0000(0x0004) (CPF_Native)
	unsigned char                                      UnknownData00[0xC];                                       // 0x0004(0x000C) MISSED OFFSET
	struct FPlane                                      Plane;                                                    // 0x0010(0x0010)
};

// ScriptStruct TAGame.AIController_TA.CachedObstaclesData
// 0x0024
struct FCachedObstaclesData
{
	struct FVector                                     CarLocation;                                              // 0x0000(0x000C)
	struct FVector                                     CarNavMeshLocation;                                       // 0x000C(0x000C)
	TArray<struct FCachedObstaclePoly>                 Polys;                                                    // 0x0018(0x000C) (CPF_NeedCtorLink)
};

// ScriptStruct TAGame._AITypes_TA.AITraits
// 0x0007
struct FAITraits
{
	class UAIRole_TA*                                  Role;                                                     // 0x0000(0x0004) (CPF_Edit)
	TEnumAsByte<EAITraitValue>                         Aggression;                                               // 0x0004(0x0001) (CPF_Edit)
	TEnumAsByte<EAITraitValue>                         Hostility;                                                // 0x0005(0x0001) (CPF_Edit)
	TEnumAsByte<EAITraitValue>                         Airplay;                                                  // 0x0006(0x0001) (CPF_Edit)
};

// ScriptStruct TAGame.AIManager_TA.CachedNavMeshLocation
// 0x001C
struct FCachedNavMeshLocation
{
	class AActor*                                      Actor;                                                    // 0x0000(0x0004)
	struct FVector                                     NavMeshLocation;                                          // 0x0004(0x000C)
	struct FVector                                     OldActorLocation;                                         // 0x0010(0x000C)
};

// ScriptStruct TAGame.AssetProfiler_TA.AssetProfile
// 0x0040
struct FAssetProfile
{
	class UProductAsset_TA*                            Asset;                                                    // 0x0000(0x0004)
	struct FRenderProfile                              RenderTimeTotal;                                          // 0x0004(0x001C)
	struct FRenderProfile                              RenderTimePerAsset;                                       // 0x0020(0x001C)
	int                                                AssetCount;                                               // 0x003C(0x0004)
};

// ScriptStruct TAGame.RBActor_TA.NetworkSyncSettingsData
// 0x001C
struct FNetworkSyncSettingsData
{
	float                                              LocationFixRate;                                          // 0x0000(0x0004) (CPF_Edit)
	float                                              AngularFixRate;                                           // 0x0004(0x0004) (CPF_Edit)
	float                                              MinDeltaLocation;                                         // 0x0008(0x0004) (CPF_Edit)
	int                                                MinDeltaRotation;                                         // 0x000C(0x0004) (CPF_Edit, CPF_Const)
	float                                              MinDeltaLinearVelocity;                                   // 0x0010(0x0004) (CPF_Edit)
	float                                              ForceReplicationDelay;                                    // 0x0014(0x0004) (CPF_Edit)
	unsigned long                                      bDebug : 1;                                               // 0x0018(0x0004) (CPF_Edit)
};

// ScriptStruct TAGame.RBActor_TA.WorldContactData
// 0x0028
struct FWorldContactData
{
	unsigned long                                      bHasContact : 1;                                          // 0x0000(0x0004)
	struct FVector                                     Location;                                                 // 0x0004(0x000C)
	struct FVector                                     Velocity;                                                 // 0x0010(0x000C)
	struct FVector                                     Normal;                                                   // 0x001C(0x000C)
};

// ScriptStruct TAGame._Types_TA.AccumulatedRigidBodyCollision
// 0x0074
struct FAccumulatedRigidBodyCollision
{
	class AActor*                                      Actor;                                                    // 0x0000(0x0004)
	class UPrimitiveComponent*                         Component;                                                // 0x0004(0x0004) (CPF_ExportObject, CPF_Component, CPF_EditInline)
	class UPhysicalMaterial*                           PhysMat;                                                  // 0x0008(0x0004)
	struct FVector                                     Velocity;                                                 // 0x000C(0x000C)
	struct FVector                                     OtherVelocity;                                            // 0x0018(0x000C)
	struct FVector                                     Location;                                                 // 0x0024(0x000C)
	struct FVector                                     Normal;                                                   // 0x0030(0x000C)
	struct FVector                                     NormalForce;                                              // 0x003C(0x000C)
	struct FVector                                     FrictionForce;                                            // 0x0048(0x000C)
	struct FVector                                     NormalVelocity;                                           // 0x0054(0x000C)
	struct FVector                                     FrictionVelocity;                                         // 0x0060(0x000C)
	int                                                NumCollisions;                                            // 0x006C(0x0004)
	int                                                NumContacts;                                              // 0x0070(0x0004)
};

// ScriptStruct TAGame._Types_TA.WeldingInfo
// 0x0020
struct FWeldingInfo
{
	class ARBActor_TA*                                 RBActor;                                                  // 0x0000(0x0004)
	struct FVector                                     Offset;                                                   // 0x0004(0x000C)
	float                                              Mass;                                                     // 0x0010(0x0004)
	struct FRotator                                    Rotation;                                                 // 0x0014(0x000C)
};

// ScriptStruct TAGame._Types_TA.BallHitInfo
// 0x00E1
struct FBallHitInfo
{
	class APRI_TA*                                     PRI;                                                      // 0x0000(0x0004)
	class APRI_TA*                                     AttackerPRI;                                              // 0x0004(0x0004)
	struct FName                                       CarName;                                                  // 0x0008(0x0008)
	int                                                TeamNum;                                                  // 0x0010(0x0004)
	struct FReplicatedRBState                          PreHitCarPhysics;                                         // 0x0014(0x0038)
	struct FReplicatedRBState                          PreHitBallPhysics;                                        // 0x004C(0x0038)
	struct FReplicatedRBState                          PostHitBallPhysics;                                       // 0x0084(0x0038)
	float                                              Distance;                                                 // 0x00BC(0x0004)
	float                                              Time;                                                     // 0x00C0(0x0004)
	struct FVector                                     HitLocation;                                              // 0x00C4(0x000C)
	struct FVector                                     HitNormal;                                                // 0x00D0(0x000C)
	unsigned long                                      bDodging : 1;                                             // 0x00DC(0x0004)
	unsigned long                                      bWheelsTouching : 1;                                      // 0x00DC(0x0004)
	unsigned long                                      bWorldTouching : 1;                                       // 0x00DC(0x0004)
	TEnumAsByte<EBallHitType>                          HitType;                                                  // 0x00E0(0x0001)
};

// ScriptStruct TAGame.Ball_TA.ExplosionData
// 0x0010
struct FExplosionData
{
	class UGoal_TA*                                    Goal;                                                     // 0x0000(0x0004) (CPF_ExportObject, CPF_Component, CPF_EditInline)
	struct FVector                                     Location;                                                 // 0x0004(0x000C)
};

// ScriptStruct TAGame.Ball_TA.ExplosionDataExtended
// 0x0014
struct FExplosionDataExtended
{
	class UGoal_TA*                                    Goal;                                                     // 0x0000(0x0004) (CPF_ExportObject, CPF_Component, CPF_EditInline)
	struct FVector                                     Location;                                                 // 0x0004(0x000C)
	class APRI_TA*                                     Scorer;                                                   // 0x0010(0x0004)
};

// ScriptStruct TAGame.Ball_TA.PredictedPosition
// 0x0018
struct FPredictedPosition
{
	struct FVector                                     Location;                                                 // 0x0000(0x000C)
	struct FVector                                     Velocity;                                                 // 0x000C(0x000C)
};

// ScriptStruct TAGame.Ball_TA.GoalPenetrationData
// 0x0020
struct FGoalPenetrationData
{
	class UGoal_TA*                                    Goal;                                                     // 0x0000(0x0004) (CPF_ExportObject, CPF_Component, CPF_EditInline)
	struct FVector                                     PlaneLocation;                                            // 0x0004(0x000C)
	struct FVector                                     PlaneNormal;                                              // 0x0010(0x000C)
	float                                              PenetrationDistance;                                      // 0x001C(0x0004)
};

// ScriptStruct TAGame.BallTrajectoryComponent_TA.TrajectorySetup
// 0x0014
struct FTrajectorySetup
{
	float                                              TotalSimulateTime;                                        // 0x0000(0x0004)
	unsigned long                                      bAlwaysEnabled : 1;                                       // 0x0004(0x0004)
	unsigned long                                      bUpdatePathEveryFrame : 1;                                // 0x0004(0x0004)
	int                                                TotalPoints;                                              // 0x0008(0x0004)
	int                                                MaxStepsPerFrame;                                         // 0x000C(0x0004)
	int                                                QuickTrajectorySteps;                                     // 0x0010(0x0004)
};

// ScriptStruct TAGame.BallTrajectoryComponent_Beam_TA.TrajectoryFX
// 0x0004
struct FTrajectoryFX
{
	class UParticleSystemComponent*                    Particle;                                                 // 0x0000(0x0004) (CPF_ExportObject, CPF_Component, CPF_EditInline)
};

// ScriptStruct TAGame.BallTrajectoryComponent_Spline_TA.TrajectorySplineFX
// 0x0004
struct FTrajectorySplineFX
{
	class ASplineLoftActorMovable*                     Spline;                                                   // 0x0000(0x0004)
};

// ScriptStruct TAGame.BallTrajectoryComponent_Mesh_TA.MeshInfo
// 0x0034
struct FMeshInfo
{
	class UStaticMeshComponent*                        Meshes;                                                   // 0x0000(0x0004) (CPF_ExportObject, CPF_Component, CPF_EditInline)
	struct FVector                                     Location;                                                 // 0x0004(0x000C)
	struct FRotator                                    Rotation;                                                 // 0x0010(0x000C)
	int                                                PointIndex;                                               // 0x001C(0x0004)
	struct FVector                                     MoveDirection;                                            // 0x0020(0x000C)
	float                                              DistanceAlongPath;                                        // 0x002C(0x0004)
	unsigned long                                      bCrossedZero : 1;                                         // 0x0030(0x0004)
};

// ScriptStruct TAGame._Types_TA.RandomRange
// 0x0008
struct FRandomRange
{
	float                                              Min;                                                      // 0x0000(0x0004) (CPF_Edit)
	float                                              Max;                                                      // 0x0004(0x0004) (CPF_Edit)
};

// ScriptStruct TAGame.BoostMesh_TA.BoostMeshOverride
// 0x0008
struct FBoostMeshOverride
{
	class UActorComponent*                             Mesh;                                                     // 0x0000(0x0004) (CPF_Edit, CPF_ExportObject, CPF_Component, CPF_EditInline)
	class AFXActor_X*                                  CarType;                                                  // 0x0004(0x0004) (CPF_Edit)
};

// ScriptStruct TAGame.BoostMesh_TA.AnimatedMaterialParam
// 0x0008
struct FAnimatedMaterialParam
{
	struct FName                                       ParamName;                                                // 0x0000(0x0008) (CPF_Edit)
};

// ScriptStruct TAGame.BoostMesh_TA.AnimatedMaterialParamFloat
// 0x0004 (0x000C - 0x0008)
struct FAnimatedMaterialParamFloat : public FAnimatedMaterialParam
{
	class UDistributionFloat*                          Value;                                                    // 0x0008(0x0004) (CPF_Edit, CPF_ExportObject, CPF_Component, CPF_EditInline)
};

// ScriptStruct TAGame.BoostMesh_TA.AnimatedMaterialParamVector
// 0x0004 (0x000C - 0x0008)
struct FAnimatedMaterialParamVector : public FAnimatedMaterialParam
{
	class UDistributionVector*                         Value;                                                    // 0x0008(0x0004) (CPF_Edit, CPF_ExportObject, CPF_Component, CPF_EditInline)
};

// ScriptStruct TAGame.BoostMesh_TA.AnimatedMaterialParamColor
// 0x0004 (0x0010 - 0x000C)
struct FAnimatedMaterialParamColor : public FAnimatedMaterialParamVector
{
	class UDistributionFloat*                          AlphaValue;                                               // 0x000C(0x0004) (CPF_Edit, CPF_ExportObject, CPF_Component, CPF_EditInline)
};

// ScriptStruct TAGame.BoostMesh_TA.AnimatedMaterialMesh
// 0x0048
struct FAnimatedMaterialMesh
{
	struct FName                                       MeshAttachmentName;                                       // 0x0000(0x0008) (CPF_Edit)
	class UMaterialInterface*                          Material;                                                 // 0x0008(0x0004) (CPF_Edit)
	int                                                MaterialIndex;                                            // 0x000C(0x0004) (CPF_Edit)
	TArray<struct FBoostMeshOverride>                  MeshOverrides;                                            // 0x0010(0x000C) (CPF_Edit, CPF_Component, CPF_NeedCtorLink)
	TArray<struct FAnimatedMaterialParamFloat>         FloatParams;                                              // 0x001C(0x000C) (CPF_Edit, CPF_Component, CPF_NeedCtorLink)
	TArray<struct FAnimatedMaterialParamVector>        VectorParams;                                             // 0x0028(0x000C) (CPF_Edit, CPF_Component, CPF_NeedCtorLink)
	TArray<struct FAnimatedMaterialParamColor>         ColorParams;                                              // 0x0034(0x000C) (CPF_Edit, CPF_Component, CPF_NeedCtorLink)
	class UActorComponent*                             Mesh;                                                     // 0x0040(0x0004) (CPF_ExportObject, CPF_Transient, CPF_Component, CPF_EditInline)
	float                                              ElapsedTime;                                              // 0x0044(0x0004) (CPF_Transient)
};

// ScriptStruct TAGame.BreakOutActor_Platform_TA.BreakoutDamageState
// 0x0018
struct FBreakoutDamageState
{
	unsigned char                                      State;                                                    // 0x0000(0x0001)
	class APRI_TA*                                     Causer;                                                   // 0x0004(0x0004)
	struct FVector                                     DamageLocation;                                           // 0x0008(0x000C)
	unsigned long                                      bDirectDamage : 1;                                        // 0x0014(0x0004)
	unsigned long                                      bImmediate : 1;                                           // 0x0014(0x0004)
};

// ScriptStruct TAGame.BTComponent.BTStatusLog
// 0x0020
struct FBTStatusLog
{
	class UBTNode*                                     Node;                                                     // 0x0000(0x0004)
	int                                                Depth;                                                    // 0x0004(0x0004)
	TEnumAsByte<EBTStatus>                             Status;                                                   // 0x0008(0x0001)
	struct FString                                     Message;                                                  // 0x000C(0x000C) (CPF_NeedCtorLink)
	unsigned long                                      bSetMessage : 1;                                          // 0x0018(0x0004)
	unsigned long                                      bCondition : 1;                                           // 0x0018(0x0004)
	float                                              LastEvalTime;                                             // 0x001C(0x0004)
};

// ScriptStruct TAGame._AITypes_TA.BTDynamicLinkData
// 0x000C
struct FBTDynamicLinkData
{
	struct FName                                       LinkName;                                                 // 0x0000(0x0008) (CPF_Edit)
	class UBTNode*                                     Node;                                                     // 0x0008(0x0004) (CPF_Edit)
};

// ScriptStruct TAGame.BTLockCollection.TimedLock
// 0x0010
struct FTimedLock
{
	struct FName                                       Name;                                                     // 0x0000(0x0008)
	float                                              ReleaseTime;                                              // 0x0008(0x0004)
	unsigned long                                      bLockedOneFrame : 1;                                      // 0x000C(0x0004)
};

// ScriptStruct TAGame.CrowdActorSettings_TA.StatCrowdNoise
// 0x0008
struct FStatCrowdNoise
{
	class UStatEvent_TA*                               StatEvent;                                                // 0x0000(0x0004) (CPF_Edit, CPF_EditConst)
	class UCrowdNoiseModifier_TA*                      Noise;                                                    // 0x0004(0x0004) (CPF_Edit, CPF_EditInline)
};

// ScriptStruct TAGame.CrowdActorSettings_TA.BallHitCrowdNoise
// 0x0008
struct FBallHitCrowdNoise
{
	float                                              RelativeSpeed;                                            // 0x0000(0x0004) (CPF_Edit)
	class UCrowdNoiseModifier_TA*                      Noise;                                                    // 0x0004(0x0004) (CPF_Edit, CPF_EditInline)
};

// ScriptStruct TAGame.CrowdActorSettings_TA.CrowdDefenseSettings
// 0x0010
struct FCrowdDefenseSettings
{
	float                                              DefenseZoneTime;                                          // 0x0000(0x0004) (CPF_Edit)
	float                                              DefenseZoneDistance;                                      // 0x0004(0x0004) (CPF_Edit)
	class UAkSoundCue*                                 Sound;                                                    // 0x0008(0x0004) (CPF_Edit)
	float                                              ReplayDelay;                                              // 0x000C(0x0004) (CPF_Edit)
};

// ScriptStruct TAGame.EngineAudioComponent_TA.CarStateData
// 0x0010
struct FCarStateData
{
	float                                              Throttle;                                                 // 0x0000(0x0004) (CPF_Transient)
	float                                              WheelSpeed;                                               // 0x0004(0x0004) (CPF_Transient)
	float                                              EngineRPM;                                                // 0x0008(0x0004) (CPF_Transient)
	float                                              EngineLoad;                                               // 0x000C(0x0004) (CPF_Transient)
};

// ScriptStruct TAGame.EngineAudioProfile_TA.AudioMinMax
// 0x0008
struct FAudioMinMax
{
	float                                              Min;                                                      // 0x0000(0x0004) (CPF_Edit)
	float                                              RandRange;                                                // 0x0004(0x0004) (CPF_Edit)
};

// ScriptStruct TAGame.EngineAudioProfile_TA.AudioGear
// 0x0010
struct FAudioGear
{
	struct FAudioMinMax                                RPMShiftDownRange;                                        // 0x0000(0x0008) (CPF_Edit)
	struct FAudioMinMax                                RPMShiftUpRange;                                          // 0x0008(0x0008) (CPF_Edit)
};

// ScriptStruct TAGame.FlockActor_TA.FlockAgent
// 0x0034
struct FFlockAgent
{
	unsigned long                                      bWaitingForOtherAgents : 1;                               // 0x0000(0x0004)
	float                                              DistanceAlongSpline;                                      // 0x0004(0x0004)
	float                                              Scale;                                                    // 0x0008(0x0004)
	struct FVector                                     Position;                                                 // 0x000C(0x000C)
	struct FVector                                     Velocity;                                                 // 0x0018(0x000C)
	struct FVector                                     NormalizedSplineOffset;                                   // 0x0024(0x000C)
	class ASplineActor*                                CurrentSplineActor;                                       // 0x0030(0x0004)
};

// ScriptStruct TAGame.FpsBucketRecorder_TA.FpsBucketData
// 0x0014
struct FFpsBucketData
{
	int                                                FPS;                                                      // 0x0000(0x0004) (CPF_Edit)
	float                                              GameThreadTime;                                           // 0x0004(0x0004)
	float                                              RenderThreadTime;                                         // 0x0008(0x0004)
	float                                              GPUFrameTime;                                             // 0x000C(0x0004)
	int                                                Count;                                                    // 0x0010(0x0004)
};

// ScriptStruct TAGame.FXActor_Boost_TA.ParticleParameterSet
// 0x0018
struct FParticleParameterSet
{
	TArray<struct FParticleSysParam>                   Parameters;                                               // 0x0000(0x000C) (CPF_Edit, CPF_NeedCtorLink)
	TArray<struct FParticleSysParam>                   DrivingParameters;                                        // 0x000C(0x000C) (CPF_Edit, CPF_NeedCtorLink)
};

// ScriptStruct TAGame.FXActor_Boost_TA.ParticleBodyParameterSet
// 0x0014
struct FParticleBodyParameterSet
{
	struct FName                                       AttachmentName;                                           // 0x0000(0x0008) (CPF_Edit)
	TArray<struct FParticleSysParam>                   Parameters;                                               // 0x0008(0x000C) (CPF_Edit, CPF_NeedCtorLink)
};

// ScriptStruct TAGame.FXActor_Boost_TA.BoostMeshMaterialOverride
// 0x0010
struct FBoostMeshMaterialOverride
{
	class UMaterialInterface*                          Material;                                                 // 0x0000(0x0004) (CPF_Edit)
	TArray<int>                                        Index;                                                    // 0x0004(0x000C) (CPF_Edit, CPF_NeedCtorLink)
};

// ScriptStruct TAGame.FXActor_Boost_TA.PreviewParticleOverride
// 0x000C
struct FPreviewParticleOverride
{
	class UParticleSystem*                             Template;                                                 // 0x0000(0x0004) (CPF_Edit)
	struct FName                                       FXAttachmentName;                                         // 0x0004(0x0008) (CPF_Edit)
};

// ScriptStruct TAGame.FXActor_Car_TA.WheelFX
// 0x002C
struct FWheelFX
{
	class UParticleSystemComponent*                    PSC;                                                      // 0x0000(0x0004) (CPF_ExportObject, CPF_Component, CPF_EditInline)
	struct FVector                                     Velocity;                                                 // 0x0004(0x000C)
	unsigned long                                      bHasContact : 1;                                          // 0x0010(0x0004)
	class AFXActor_X*                                  SupersonicFXActor;                                        // 0x0014(0x0004)
	struct FName                                       BoneName;                                                 // 0x0018(0x0008)
	struct FVector                                     BoneOffset;                                               // 0x0020(0x000C)
};

// ScriptStruct TAGame._Types_TA.ClientLoadoutData
// 0x000C
struct FClientLoadoutData
{
	TArray<int>                                        Products;                                                 // 0x0000(0x000C) (CPF_NeedCtorLink)
};

// ScriptStruct TAGame._Types_TA.LoadoutTeamColor
// 0x0008
struct FLoadoutTeamColor
{
	unsigned char                                      Team;                                                     // 0x0000(0x0001)
	unsigned char                                      TeamColorID;                                              // 0x0001(0x0001)
	unsigned char                                      CustomColorID;                                            // 0x0002(0x0001)
	unsigned long                                      bSet : 1;                                                 // 0x0004(0x0004)
};

// ScriptStruct TAGame._Types_TA.LoadoutTeamPaint
// 0x0008 (0x0010 - 0x0008)
struct FLoadoutTeamPaint : public FLoadoutTeamColor
{
	int                                                TeamFinishID;                                             // 0x0008(0x0004)
	int                                                CustomFinishID;                                           // 0x000C(0x0004)
};

// ScriptStruct TAGame._Types_TA.LoadoutData
// 0x0028 (0x0034 - 0x000C)
struct FLoadoutData : public FClientLoadoutData
{
