#pragma once

// Rocket League (1.31) SDK

#ifdef _MSC_VER
	#pragma pack(push, 0x4)
#endif

namespace SDK
{
//---------------------------------------------------------------------------
//Classes
//---------------------------------------------------------------------------

// Class TAGame._AITypes_TA
// 0x0000 (0x003C - 0x003C)
class U_AITypes_TA : public UObject
{
public:

	static UClass* StaticClass()
	{
		static auto ptr = UObject::FindClass("Class TAGame._AITypes_TA");
		return ptr;
	}

};


// Class TAGame._Types_TA
// 0x0030 (0x006C - 0x003C)
class U_Types_TA : public UObject
{
public:
	struct FScriptDelegate                             __AssetLoadedDelegate__Delegate;                          // 0x003C(0x0010) (CPF_NeedCtorLink)
	struct FScriptDelegate                             __ProductThumbnailRenderedDelegate__Delegate;             // 0x004C(0x0010) (CPF_NeedCtorLink)
	struct FScriptDelegate                             __MapImageLoadedDelegate__Delegate;                       // 0x005C(0x0010) (CPF_NeedCtorLink)

	static UClass* StaticClass()
	{
		static auto ptr = UObject::FindClass("Class TAGame._Types_TA");
		return ptr;
	}


	struct FLoadoutTeamPaint STATIC_GetLoadoutPaint(const struct FLoadoutData& InLoadoutData);
	int STATIC_GetRandomColorID(class UCarColorSet_TA* Set);
	void STATIC_InitColorSet(class UCarColorSet_TA* Set, TArray<struct FGFxTeamColor>* OutColors);
	struct FString STATIC_ProductQualityToString(TEnumAsByte<EProductQuality> Quality);
	bool STATIC_TeamPaintsAreDifferent(struct FLoadoutData* A, struct FLoadoutData* B);
	bool STATIC_OnlineProductsAreDifferent();
	bool STATIC_ProductsAreDifferent(TArray<int>* A, TArray<int>* B);
	bool STATIC_LoadoutsAreDifferent(struct FLoadoutData* A, struct FLoadoutData* B);
	float STATIC_UpdateInputValue(const struct FInputRate& Rate, float DesiredValue, float OldValue, float DeltaTime);
	struct FClientLoadoutData STATIC_ConvertToClientLoadout(struct FLoadoutData* FromData);
	void MapImageLoadedDelegate(const struct FMapImageLoadResult& Result);
	void ProductThumbnailRenderedDelegate(const struct FProductThumbnailResult& Result);
	void AssetLoadedDelegate(const struct FAssetLoadResult& Result);
	struct FRandomWeight STATIC_PickWeightedRandom(TArray<struct FRandomWeight> Arr, int* Index);
	bool STATIC_VehicleInputHasChangedForKick(struct FVehicleInputs* NewInput, struct FVehicleInputs* OldInput);
};


// Class TAGame.AIController_TA
// 0x01C8 (0x0560 - 0x0398)
class AAIController_TA : public AAIController
{
public:
	class ACar_TA*                                     Car;                                                      // 0x0398(0x0004) (CPF_Transient)
	class AVehicle_TA*                                 Vehicle;                                                  // 0x039C(0x0004) (CPF_Transient)
	class UBTComponent*                                BT;                                                       // 0x03A0(0x0004) (CPF_Edit, CPF_ExportObject, CPF_Component, CPF_EditInline)
	class UBTProxyType*                                SelfProxyType;                                            // 0x03A4(0x0004) (CPF_Edit)
	class UBTProxyType*                                NoneProxyType;                                            // 0x03A8(0x0004) (CPF_Edit)
	class UBTProxyType*                                DebugProxyType;                                           // 0x03AC(0x0004) (CPF_Edit)
	class UBTProxyType*                                TeamCarsProxyType;                                        // 0x03B0(0x0004) (CPF_Edit)
	class UBTProxyType*                                EnemyCarsProxyType;                                       // 0x03B4(0x0004) (CPF_Edit)
	class UBTProxyType*                                OtherCarsProxyType;                                       // 0x03B8(0x0004) (CPF_Edit)
	class UBTProxyType*                                BoostPillsProxyType;                                      // 0x03BC(0x0004) (CPF_Edit)
	class UBTProxyType*                                SelectedProxyType;                                        // 0x03C0(0x0004) (CPF_Edit)
	class UBTTarget*                                   SelfTarget;                                               // 0x03C4(0x0004) (CPF_Edit)
	class UBTTarget*                                   NoneTarget;                                               // 0x03C8(0x0004) (CPF_Edit)
	class UBTTarget*                                   IteratorTarget;                                           // 0x03CC(0x0004) (CPF_Edit)
	class UBTTarget*                                   TeamCarsTarget;                                           // 0x03D0(0x0004) (CPF_Edit)
	class UBTTarget*                                   SelectedTarget;                                           // 0x03D4(0x0004) (CPF_Edit)
	class UBTTarget*                                   ContextTarget;                                            // 0x03D8(0x0004) (CPF_Transient)
	class UBTNode*                                     DebugBTNode;                                              // 0x03DC(0x0004) (CPF_Edit)
	class UBTLockCollection*                           Locks;                                                    // 0x03E0(0x0004) (CPF_Edit, CPF_ExportObject, CPF_Component, CPF_EditInline)
	struct FSkillRange                                 SkillSteerError;                                          // 0x03E4(0x000C) (CPF_Edit)
	struct FSkillRange                                 SkillSteerSpeed;                                          // 0x03F0(0x000C) (CPF_Edit)
	struct FSkillRange                                 SkillThrottleSpeed;                                       // 0x03FC(0x000C) (CPF_Edit)
	class AGameEvent_TA*                               GameEvent;                                                // 0x0408(0x0004) (CPF_Transient)
	class AAIManager_TA*                               AIManager;                                                // 0x040C(0x0004) (CPF_Transient)
	TArray<struct FNamedEvent>                         QueuedEvents;                                             // 0x0410(0x000C) (CPF_Transient, CPF_NeedCtorLink)
	struct FVehicleInputs                              Input;                                                    // 0x041C(0x0020) (CPF_Transient)
	struct FVector                                     ForwardDir;                                               // 0x043C(0x000C) (CPF_Transient)
	struct FRotator                                    ForwardRotation;                                          // 0x0448(0x000C) (CPF_Transient)
	struct FVector                                     GroundNormal;                                             // 0x0454(0x000C) (CPF_Transient)
	TArray<struct FCachedProxyData>                    CachedProxyDatas;                                         // 0x0460(0x000C) (CPF_Transient, CPF_NeedCtorLink)
	TArray<struct FCachedTargetData>                   CachedTargetDatas;                                        // 0x046C(0x000C) (CPF_Transient, CPF_NeedCtorLink)
	struct FMap_Mirror                                 TargetFilterMap;                                          // 0x0478(0x003C) (CPF_Native, CPF_Transient)
	TArray<class UBTNode*>                             CachedTargetFilters;                                      // 0x04B4(0x000C) (CPF_Transient, CPF_NeedCtorLink)
	struct FVector                                     DebugDriveDestination;                                    // 0x04C0(0x000C) (CPF_Transient)
	struct FCachedObstaclesData                        CachedObstacles;                                          // 0x04CC(0x0024) (CPF_Native, CPF_Transient)
	struct FAITraits                                   Traits;                                                   // 0x04F0(0x0008) (CPF_Transient)
	TArray<class ACar_TA*>                             TeamCars;                                                 // 0x04F8(0x000C) (CPF_Transient, CPF_NeedCtorLink)
	TArray<class ACar_TA*>                             EnemyCars;                                                // 0x0504(0x000C) (CPF_Transient, CPF_NeedCtorLink)
	TArray<class ACar_TA*>                             OtherCars;                                                // 0x0510(0x000C) (CPF_Transient, CPF_NeedCtorLink)
	unsigned long                                      bForceUpdateConditions : 1;                               // 0x051C(0x0004) (CPF_Const, CPF_Transient)
	unsigned long                                      bCanUseBoost : 1;                                         // 0x051C(0x0004) (CPF_Transient)
	unsigned long                                      bBeingReplaced : 1;                                       // 0x051C(0x0004) (CPF_Transient)
	class UAIRole_TA*                                  TestRole;                                                 // 0x0520(0x0004)
	class UGameShare_TA*                               GameShare;                                                // 0x0524(0x0004) (CPF_Transient)
	class AActor*                                      SelectedActor;                                            // 0x0528(0x0004) (CPF_Const, CPF_Transient)
	float                                              FieldScalar;                                              // 0x052C(0x0004) (CPF_Transient)
	struct FScriptDelegate                             __EventNamedEvent__Delegate;                              // 0x0530(0x0010) (CPF_NeedCtorLink)
	struct FScriptDelegate                             __EventSkillChanged__Delegate;                            // 0x0540(0x0010) (CPF_NeedCtorLink)
	struct FScriptDelegate                             __EventTraitsChanged__Delegate;                           // 0x0550(0x0010) (CPF_NeedCtorLink)

	static UClass* StaticClass()
	{
		static auto ptr = UObject::FindClass("Class TAGame.AIController_TA");
		return ptr;
	}


	void PrintDebugInfo(class UDebugDrawer* Drawer);
	void SetSelectedActor(class AActor* NewActor);
	void AllTargets(class UBTTarget* Target, struct FBTProxyData* OutData);
	bool GetObstacleInRadius(const struct FVector& Destination, float Radius, struct FVector* HitLocation);
	bool GetObstacle(const struct FVector& Destination, struct FVector* HitLocation);
	bool GetProxyDataInternal(class UBTProxyType* Type, int Index, struct FBTProxyData* OutData);
	bool GetIndexedProxyData(class UBTProxyType* Type, int Index, struct FBTProxyData* OutData);
	bool GetProxyData(class UBTProxyType* Type, struct FBTProxyData* OutData);
	bool GetIndexedTargetData(class UBTTarget* Target, int Index, struct FBTProxyData* OutData);
	bool GetTargetData(class UBTTarget* Target, struct FBTProxyData* OutData);
	struct FBTProxyData CreateVehicleProxyData(class AVehicle_TA* InVehicle);
	struct FBTProxyData CreateProxyData(class AActor* A, float Radius);
	float GetDriveTime(float Distance);
	float GetDriveDistance(const struct FBTProxyData& Proxy);
	struct FVector FlattenOffset(const struct FVector& Offset, float* Height);
	struct FVector FlattenDestination(const struct FVector& Destination);
	struct FBTProxyData FlattenPhysics(struct FBTProxyData* ProxyData);
	float GetClosestTime2D(float MaxTime, struct FBTProxyData* A, struct FBTProxyData* B);
	bool WillImpact2D(struct FBTProxyData* A, struct FBTProxyData* B, float* CollideTime);
	void AdvancePhysics(float Time, struct FBTProxyData* PhysicsData);
	void PredictPhysics(float Time, float GroundZ, struct FBTProxyData* PhysicsData);
	void PredictLanding(float GroundZ, struct FBTProxyData* Data, float* Time);
	struct FVector AdvanceLocation(float Time, struct FVector* Loc, struct FVector* Vel, struct FVector* Accel);
	void DebugDriveTo(const struct FVector& Destination);
	void DoNothing();
	void AbortBT();
	void OnNamedEvent(const struct FName& EventName, class AActor* Sender);
	void Destroyed();
	void OnCarSetup(class ACar_TA* InCar);
	void SetCar();
	void UnPossess();
	void Possess(class APawn* inPawn, bool bVehicleTransition);
	void SetSkill(float NewSkill);
	void ReInitBT();
	void SetTraits(const struct FAITraits& InTraits);
	void HandleOtherCarDestroyed(class APawn_X* InCar);
	void HandleOtherCarDemolished(class ACar_TA* Victim, const struct FDemolishData& Data);
	void HandleOtherCarTeamChanged(class ACar_TA* InCar);
	void HandleCarSpawned(class AGameEvent_TA* InGameEvent, class ACar_TA* InCar);
	void Init(class AGameEvent_TA* InGameEvent);
	void PreBeginPlay();
	void EventTraitsChanged(class AAIController_TA* AI);
	void EventSkillChanged(class AAIController_TA* AI);
	void EventNamedEvent(class AAIController_TA* AI, const struct FName& EventName, class AActor* Sender);
};


// Class TAGame.AIManager_TA
// 0x0028 (0x0224 - 0x01FC)
class AAIManager_TA : public AActor
{
public:
	unsigned long                                      bFlushAILogEachLine : 1;                                  // 0x01FC(0x0004) (CPF_Edit, CPF_Const, CPF_Config)
	unsigned long                                      bOutputLogToWindow : 1;                                   // 0x01FC(0x0004) (CPF_Edit, CPF_Const, CPF_Config)
	unsigned long                                      bPauseForDirtyTrees : 1;                                  // 0x01FC(0x0004) (CPF_Transient)
	class UBTLockCollection*                           Locks;                                                    // 0x0200(0x0004) (CPF_Edit, CPF_Const, CPF_ExportObject, CPF_Component, CPF_EditInline)
	class AGameEvent_TA*                               GameEvent;                                                // 0x0204(0x0004) (CPF_Transient)
	TArray<class AAIController_TA*>                    Bots;                                                     // 0x0208(0x000C) (CPF_Transient, CPF_NeedCtorLink)
	TArray<struct FCachedNavMeshLocation>              CachedNavMeshLocations;                                   // 0x0214(0x000C) (CPF_Transient, CPF_NeedCtorLink)
	class AFileLog*                                    AILogFile;                                                // 0x0220(0x0004) (CPF_Transient)

	static UClass* StaticClass()
	{
		static auto ptr = UObject::FindClass("Class TAGame.AIManager_TA");
		return ptr;
	}


	void Destroyed();
	void RemoveBot(class AAIController_TA* Bot);
	void AddBot(class AAIController_TA* Bot);
	void Init(class AGameEvent_TA* InGameEvent);
	void AILog(class UObject* Sender, const struct FString& Message, bool bVerbose);
};


// Class TAGame.AnimNodeBlend_TA
// 0x000F (0x0100 - 0x00F1)
class UAnimNodeBlend_TA : public UAnimNodeBlendBase
{
public:
	float                                              BlendSpeed;                                               // 0x00F4(0x0004) (CPF_Edit)
	float                                              Position;                                                 // 0x00F8(0x0004) (CPF_Transient)
	float                                              DesiredPosition;                                          // 0x00FC(0x0004) (CPF_Transient)

	static UClass* StaticClass()
	{
		static auto ptr = UObject::FindClass("Class TAGame.AnimNodeBlend_TA");
		return ptr;
	}

};


// Class TAGame.AnimNodeBlendBoost_TA
// 0x0004 (0x0108 - 0x0104)
class UAnimNodeBlendBoost_TA : public UAnimNodeBlend
{
public:
	float                                              BlendTime;                                                // 0x0104(0x0004) (CPF_Edit)

	static UClass* StaticClass()
	{
		static auto ptr = UObject::FindClass("Class TAGame.AnimNodeBlendBoost_TA");
		return ptr;
	}

};


// Class TAGame.AnimNodeBlendSpeed_TA
// 0x0008 (0x0144 - 0x013C)
class UAnimNodeBlendSpeed_TA : public UAnimNodeAimOffset
{
public:
	float                                              BlendRate;                                                // 0x013C(0x0004) (CPF_Edit)
	float                                              MaxSpeed;                                                 // 0x0140(0x0004) (CPF_Edit)

	static UClass* StaticClass()
	{
		static auto ptr = UObject::FindClass("Class TAGame.AnimNodeBlendSpeed_TA");
		return ptr;
	}

};


// Class TAGame.AssetProfiler_TA
// 0x0054 (0x0250 - 0x01FC)
class AAssetProfiler_TA : public AActor
{
public:
	float                                              TimePerAsset;                                             // 0x01FC(0x0004) (CPF_Edit)
	float                                              TimeBetweenAssets;                                        // 0x0200(0x0004) (CPF_Edit)
	TArray<class UProductSlot_TA*>                     Slots;                                                    // 0x0204(0x000C) (CPF_Edit, CPF_NeedCtorLink)
	struct FRenderProfile                              CurrentProfile;                                           // 0x0210(0x001C) (CPF_Transient)
	TArray<struct FAssetProfile>                       AssetProfiles;                                            // 0x022C(0x000C) (CPF_Transient, CPF_NeedCtorLink)
	int                                                CurrentProductID;                                         // 0x0238(0x0004) (CPF_Transient)
	class UProductAsset_TA*                            CurrentProduct;                                           // 0x023C(0x0004) (CPF_Transient)
	class UProductDatabase_TA*                         ProductsDB;                                               // 0x0240(0x0004) (CPF_Transient)
	TArray<class ACarPreviewActor_TA*>                 Cars;                                                     // 0x0244(0x000C) (CPF_Transient, CPF_NeedCtorLink)

	static UClass* StaticClass()
	{
		static auto ptr = UObject::FindClass("Class TAGame.AssetProfiler_TA");
		return ptr;
	}


	int SortRenderThread(const struct FAssetProfile& A, const struct FAssetProfile& B);
	int SortGPU(const struct FAssetProfile& A, const struct FAssetProfile& B);
	void Finish();
	void StopRecording();
	void StartRecording();
	void StartNextAsset();
	void EquipProduct(class UProductAsset_TA* Asset);
	class UProductAsset_TA* EquipProductID(int ProductID);
	bool ShouldProfileProduct(class UProductAsset_TA* Product);
	void PrintAsset(const struct FString& AssetName, float AssetTime);
	void UpdateProfileTimes(struct FRenderProfile* Profile);
	void GatherCars();
	void DisableVSync();
	void SetupPlayers();
	void PostBeginPlay();
};


// Class TAGame.AttachmentBehavior_TA
// 0x000C (0x0048 - 0x003C)
class UAttachmentBehavior_TA : public UObject
{
public:
	class UProductAsset_TA*                            Asset;                                                    // 0x003C(0x0004) (CPF_Transient)
	class UActorComponent*                             Component;                                                // 0x0040(0x0004) (CPF_ExportObject, CPF_Transient, CPF_Component, CPF_EditInline)
	unsigned long                                      bPreview : 1;                                             // 0x0044(0x0004) (CPF_Transient)

	static UClass* StaticClass()
	{
		static auto ptr = UObject::FindClass("Class TAGame.AttachmentBehavior_TA");
		return ptr;
	}


	class UCarMeshComponent_TA* GetMesh();
	void SetPreviewing(bool bPreviewing);
	void OnInit();
	void Init(class UProductAsset_TA* InAsset, class UActorComponent* InComponent);
};


// Class TAGame.RimSpinner_TA
// 0x0030 (0x0078 - 0x0048)
class URimSpinner_TA : public UAttachmentBehavior_TA
{
public:
	float                                              AccelRate;                                                // 0x0048(0x0004) (CPF_Edit)
	float                                              DecelRate;                                                // 0x004C(0x0004) (CPF_Edit)
	float                                              MaxSpeed;                                                 // 0x0050(0x0004) (CPF_Edit)
	struct FName                                       BoneControlName;                                          // 0x0054(0x0008) (CPF_Edit)
	float                                              SpinScale;                                                // 0x005C(0x0004) (CPF_Transient)
	int                                                WheelIndex;                                               // 0x0060(0x0004) (CPF_Transient)
	float                                              CurrentSpeed;                                             // 0x0064(0x0004) (CPF_Transient)
	int                                                CurrentRotation;                                          // 0x0068(0x0004) (CPF_Transient)
	class USkelControlSingleBone*                      SpinBoneController;                                       // 0x006C(0x0004) (CPF_Transient)
	class USkelControlSingleBone*                      WheelBoneController;                                      // 0x0070(0x0004) (CPF_Transient)
	class UWheel_TA*                                   Wheel;                                                    // 0x0074(0x0004) (CPF_ExportObject, CPF_Transient, CPF_Component, CPF_EditInline)

	static UClass* StaticClass()
	{
		static auto ptr = UObject::FindClass("Class TAGame.RimSpinner_TA");
		return ptr;
	}


	void HandleAttached(class UCarMeshComponent_TA* Mesh);
	void OnInit();
};


// Class TAGame.BallRadiusVolume_TA
// 0x0014 (0x0210 - 0x01FC)
class ABallRadiusVolume_TA : public AActor
{
public:
	float                                              Radius;                                                   // 0x01FC(0x0004) (CPF_Edit)
	class UDrawSphereComponent*                        PreviewRadius;                                            // 0x0200(0x0004) (CPF_Const, CPF_ExportObject, CPF_Component, CPF_EditInline)
	TArray<class ABall_TA*>                            Inradius;                                                 // 0x0204(0x000C) (CPF_Transient, CPF_NeedCtorLink)

	static UClass* StaticClass()
	{
		static auto ptr = UObject::FindClass("Class TAGame.BallRadiusVolume_TA");
		return ptr;
	}


	void RemoveBall(class ABall_TA* Ball);
	void AddBall(class ABall_TA* Ball);
	void Tick(float DeltaTime);
};


// Class TAGame.RBActor_TA
// 0x01BC (0x0698 - 0x04DC)
class ARBActor_TA : public APawn_X
{
public:
	struct FPointer                                    VfTable_IITickNotify_TA;                                  // 0x04DC(0x0004) (CPF_Const, CPF_Native, CPF_NoExport)
	float                                              MaxLinearSpeed;                                           // 0x04E0(0x0004) (CPF_Edit, CPF_Const)
	float                                              MaxAngularSpeed;                                          // 0x04E4(0x0004) (CPF_Edit, CPF_Const)
	unsigned long                                      bDisableSleeping : 1;                                     // 0x04E8(0x0004) (CPF_Edit, CPF_Const)
	unsigned long                                      bReplayActor : 1;                                         // 0x04E8(0x0004) (CPF_Const, CPF_Net, CPF_Transient)
	unsigned long                                      bFrozen : 1;                                              // 0x04E8(0x0004) (CPF_Net, CPF_Transient)
	unsigned long                                      bAutoInitFXEffects : 1;                                   // 0x04E8(0x0004) (CPF_Const)
	unsigned long                                      bIgnoreSyncing : 1;                                       // 0x04E8(0x0004) (CPF_Net, CPF_Transient)
	unsigned long                                      bPhysInitialized : 1;                                     // 0x04E8(0x0004) (CPF_Transient)
	struct FNetworkSyncSettingsData                    NetworkSyncSettings;                                      // 0x04EC(0x001C) (CPF_Edit)
	struct FReplicatedRBState                          OldRBState;                                               // 0x0508(0x0038) (CPF_Const, CPF_Transient)
	struct FReplicatedRBState                          RBState;                                                  // 0x0540(0x0038) (CPF_Const, CPF_Transient)
	struct FReplicatedRBState                          ReplicatedRBState;                                        // 0x0578(0x0038) (CPF_Const, CPF_Net, CPF_Transient)
	struct FReplicatedRBState                          ClientCorrectionRBState;                                  // 0x05B0(0x0038) (CPF_Const, CPF_Transient)
	struct FWorldContactData                           WorldContact;                                             // 0x05E8(0x0028) (CPF_Const, CPF_Transient)
	struct FVector                                     SyncErrorLocation;                                        // 0x0610(0x000C) (CPF_Const, CPF_Transient)
	float                                              SyncErrorAngle;                                           // 0x061C(0x0004) (CPF_Const, CPF_Transient)
	struct FVector                                     SyncErrorAxis;                                            // 0x0620(0x000C) (CPF_Const, CPF_Transient)
	class UAkParamGroup*                               Ak;                                                       // 0x062C(0x0004) (CPF_ExportObject, CPF_Component, CPF_EditInline)
	class AFXActor_X*                                  FXActorArchetype;                                         // 0x0630(0x0004) (CPF_Edit)
	class AFXActor_X*                                  FXActor;                                                  // 0x0634(0x0004) (CPF_Transient)
	class UImpactEffectsComponent_TA*                  ImpactEffectsComponent;                                   // 0x0638(0x0004) (CPF_Edit, CPF_ExportObject, CPF_Component, CPF_EditInline)
	TArray<struct FAccumulatedRigidBodyCollision>      RBCollisions;                                             // 0x063C(0x000C) (CPF_Const, CPF_Transient, CPF_Component, CPF_NeedCtorLink)
	class UClass*                                      RBHistoryClass;                                           // 0x0648(0x0004) (CPF_Edit)
	class URBHistory_TA*                               RBHistory;                                                // 0x064C(0x0004) (CPF_Const, CPF_ExportObject, CPF_Transient, CPF_Component, CPF_EditInline)
	int                                                LastRBCollisionsFrame;                                    // 0x0650(0x0004) (CPF_Const, CPF_Transient)
	class UReplayComponent_TA*                         Replay;                                                   // 0x0654(0x0004) (CPF_ExportObject, CPF_Component, CPF_EditInline)
	struct FWeldingInfo                                WeldedInfo;                                               // 0x0658(0x0020) (CPF_Net, CPF_Transient)
	class ARBActor_TA*                                 WeldedActor;                                              // 0x0678(0x0004) (CPF_Transient)
	class ARBActor_TA*                                 WeldedTo;                                                 // 0x067C(0x0004) (CPF_Transient)
	float                                              PreWeldMass;                                              // 0x0680(0x0004) (CPF_Transient)
	struct FPointer                                    Constraint2D;                                             // 0x0684(0x0004) (CPF_Native, CPF_Transient)
	struct FScriptDelegate                             __EventRigidBodyCollision__Delegate;                      // 0x0688(0x0010) (CPF_NeedCtorLink)

	static UClass* StaticClass()
	{
		static auto ptr = UObject::FindClass("Class TAGame.RBActor_TA");
		return ptr;
	}


	void PrintDebugInfo(class UDebugDrawer* Drawer);
	void SetMass(float NewMass);
	void SetConstrained3D(const struct FVector& LinearLower, const struct FVector& LinearUpper, const struct FVector& AngularLower, const struct FVector& AngularUpper);
	void SetConstrained2D(bool bConstrain2D);
	void InitCCD();
	void SetPhysicsState(const struct FReplicatedRBState& NewState);
	void SetFrozen(bool bEnabled);
	void PlayDying(class UClass* DamageType, const struct FVector& HitLoc);
	bool TakeDamage_X(class UDamageComponent_X* Damage);
	void SetDyingPhysics();
	void SetMaxAngularSpeed(float NewMaxSpeed);
	void SetMaxLinearSpeed(float NewMaxSpeed);
	void OnRigidBodyCollision(const struct FAccumulatedRigidBodyCollision& Collision);
	void AddTorque(const struct FVector& Torque, TEnumAsByte<EForceMode> ForceMode);
	void AddForce(const struct FVector& Force, TEnumAsByte<EForceMode> ForceMode);
	void PreAsyncTick(float DeltaTime);
	void SetWelding(const struct FWeldingInfo& Welding);
	void UnWeldRBActor(class ARBActor_TA* Other);
	void WeldRBActor(class ARBActor_TA* Other, const struct FVector& WeldOffset, const struct FRotator& WeldRotation);
	void OnRBPhysInit();
	void ReInitRBPhys();
	void TerminateRBPhys();
	void SetCurrentRBState(struct FReplicatedRBState* NewRBState);
	struct FVector GetCurrentRBLocation();
	struct FReplicatedRBState GetCurrentRBState();
	int GetPhysicsFrame();
	float GetPhysicsTime();
	void PopFXState(class UFXActorEvent_X* Event);
	void PushFXState(class UFXActorEvent_X* Event);
	void InitFX();
	void PostBeginPlay();
	void ReplicatedEvent(const struct FName& VarName);
	void EventRigidBodyCollision(class ARBActor_TA* RBActor, const struct FAccumulatedRigidBodyCollision& Collision);
};


// Class TAGame.Ball_TA
// 0x0174 (0x080C - 0x0698)
class ABall_TA : public ARBActor_TA
{
public:
	class UStaticMeshComponent*                        StaticMesh;                                               // 0x0698(0x0004) (CPF_Edit, CPF_ExportObject, CPF_Component, CPF_EditInline)
	class AFXActor_X*                                  EndOfGameFXArchetype;                                     // 0x069C(0x0004) (CPF_Edit)
	class AExplosion_X*                                ExplosionArchetype;                                       // 0x06A0(0x0004) (CPF_Edit)
	class AExplosion_X*                                NoGoalExplosionArchetype;                                 // 0x06A4(0x0004) (CPF_Edit)
	unsigned long                                      bAllowPlayerExplosionOverride : 1;                        // 0x06A8(0x0004) (CPF_Edit)
	unsigned long                                      bNextCamTargetOnExplode : 1;                              // 0x06A8(0x0004)
	unsigned long                                      bNotifyGroundHit : 1;                                     // 0x06A8(0x0004) (CPF_Transient)
	unsigned long                                      bEndOfGameHidden : 1;                                     // 0x06A8(0x0004) (CPF_Net, CPF_Transient)
	unsigned long                                      bFadeIn : 1;                                              // 0x06A8(0x0004)
	unsigned long                                      bFadeOut : 1;                                             // 0x06A8(0x0004)
	unsigned long                                      bPredictionOnGround : 1;                                  // 0x06A8(0x0004) (CPF_Const, CPF_Transient)
	unsigned long                                      bCanBeAttached : 1;                                       // 0x06A8(0x0004) (CPF_Transient)
	unsigned long                                      bBallDemolish : 1;                                        // 0x06A8(0x0004) (CPF_Transient)
	unsigned long                                      bNewFalling : 1;                                          // 0x06A8(0x0004) (CPF_Transient)
	unsigned long                                      bItemFreeze : 1;                                          // 0x06A8(0x0004) (CPF_Transient)
	class UBallCamTarget_TA*                           BallCamTarget;                                            // 0x06AC(0x0004) (CPF_ExportObject, CPF_Component, CPF_EditInline)
	float                                              Radius;                                                   // 0x06B0(0x0004) (CPF_Transient)
	float                                              VisualRadius;                                             // 0x06B4(0x0004)
	TArray<struct FBallHitInfo>                        Touches;                                                  // 0x06B8(0x000C) (CPF_Transient, CPF_NeedCtorLink)
	float                                              LastCalculateCarHit;                                      // 0x06C4(0x0004) (CPF_Transient)
	struct FVector                                     InitialLocation;                                          // 0x06C8(0x000C) (CPF_Transient)
	struct FRotator                                    InitialRotation;                                          // 0x06D4(0x000C) (CPF_Transient)
	float                                              LastHitWorldTime;                                         // 0x06E0(0x0004) (CPF_Transient)
	float                                              ReplicatedBallScale;                                      // 0x06E4(0x0004) (CPF_Net)
	class UStaticMesh*                                 ReplicatedBallMesh;                                       // 0x06E8(0x0004) (CPF_Net)
	float                                              ReplicatedWorldBounceScale;                               // 0x06EC(0x0004) (CPF_Net)
	float                                              ReplicatedBallGravityScale;                               // 0x06F0(0x0004) (CPF_Net)
	float                                              ReplicatedBallMaxLinearSpeedScale;                        // 0x06F4(0x0004) (CPF_Net)
	float                                              ReplicatedAddedCarBounceScale;                            // 0x06F8(0x0004) (CPF_Net)
	float                                              AdditionalCarGroundBounceScaleZ;                          // 0x06FC(0x0004)
	float                                              AdditionalCarGroundBounceScaleXY;                         // 0x0700(0x0004)
	unsigned char                                      HitTeamNum;                                               // 0x0704(0x0001) (CPF_Net, CPF_Transient)
	class AGameEvent_Soccar_TA*                        GameEvent;                                                // 0x0708(0x0004) (CPF_Net, CPF_Transient)
	struct FExplosionData                              ReplicatedExplosionData;                                  // 0x070C(0x0010) (CPF_Net, CPF_Transient, CPF_Component)
	struct FExplosionDataExtended                      ReplicatedExplosionDataExtended;                          // 0x071C(0x0014) (CPF_Net, CPF_Transient, CPF_Component)
	class AExplosion_X*                                Explosion;                                                // 0x0730(0x0004) (CPF_Transient)
	float                                              ExplosionTime;                                            // 0x0734(0x0004) (CPF_Transient)
	struct FVector                                     OldLocation;                                              // 0x0738(0x000C) (CPF_Transient)
	class UMaterialInterface*                          FadeMaterial;                                             // 0x0744(0x0004)
	float                                              PredictionTimestep;                                       // 0x0748(0x0004) (CPF_Edit)
	TArray<struct FPredictedPosition>                  PredictedPositions;                                       // 0x074C(0x000C) (CPF_Const, CPF_Transient, CPF_NeedCtorLink)
	float                                              LastPredictionTime;                                       // 0x0758(0x0004) (CPF_Const, CPF_Transient)
	float                                              BallSloMoRadius;                                          // 0x075C(0x0004) (CPF_Transient)
	float                                              BallSloMoDuration;                                        // 0x0760(0x0004) (CPF_Transient)
	float                                              BallSloMoDilation;                                        // 0x0764(0x0004) (CPF_Transient)
	float                                              BallSloMoCooldown;                                        // 0x0768(0x0004) (CPF_Transient)
	float                                              BallSloMoNext;                                            // 0x076C(0x0004) (CPF_Transient)
	float                                              BallSloMoDiffSpeed;                                       // 0x0770(0x0004) (CPF_Transient)
	class ACar_TA*                                     BallBelongsTo;                                            // 0x0774(0x0004) (CPF_Net, CPF_Transient)
	int                                                BallTouchScore;                                           // 0x0778(0x0004) (CPF_Net, CPF_Transient)
	struct FGoalPenetrationData                        GoalPenetration;                                          // 0x077C(0x0020) (CPF_Transient, CPF_Component)
	float                                              GroundForce;                                              // 0x079C(0x0004) (CPF_Edit)
	class ACar_TA*                                     CurrentAffector;                                          // 0x07A0(0x0004) (CPF_Transient)
	class UBallTrajectoryComponent_TA*                 TrajectoryComponent;                                      // 0x07A4(0x0004) (CPF_ExportObject, CPF_Component, CPF_EditInline)
	class UPitchTekDrawingComponent_TA*                PitchTekComponent;                                        // 0x07A8(0x0004) (CPF_Const, CPF_ExportObject, CPF_Component, CPF_EditInline)
	struct FScriptDelegate                             __EventCarTouch__Delegate;                                // 0x07AC(0x0010) (CPF_NeedCtorLink)
	struct FScriptDelegate                             __EventHitWorld__Delegate;                                // 0x07BC(0x0010) (CPF_NeedCtorLink)
	struct FScriptDelegate                             __EventHitGround__Delegate;                               // 0x07CC(0x0010) (CPF_NeedCtorLink)
	struct FScriptDelegate                             __EventHitGoal__Delegate;                                 // 0x07DC(0x0010) (CPF_NeedCtorLink)
	struct FScriptDelegate                             __EventGameEventSet__Delegate;                            // 0x07EC(0x0010) (CPF_NeedCtorLink)
	struct FScriptDelegate                             __EventExploded__Delegate;                                // 0x07FC(0x0010) (CPF_NeedCtorLink)

	static UClass* StaticClass()
	{
		static auto ptr = UObject::FindClass("Class TAGame.Ball_TA");
		return ptr;
	}


	void PredictGroundPosition(int MaxIterations, struct FBallPredictionInfo* PredictionInfo);
	void PredictPosition(float Time, struct FBallPredictionInfo* PredictionInfo);
	bool CanEverShowTrajectory();
	bool IsTrajectoryEnabled();
	struct FVector GetTrajectoryStartVelocity();
	struct FVector GetTrajectoryStartLocation();
	void UpdateTrajectoryPredictionPoints(bool bForceUpdate);
	void UpdateTrajectoryEnabled();
	bool ShouldDrawTrajectory();
	float GetAdditionalCarBounceScaleZ(class ACar_TA* Car);
	void SpawnEndOfGameFX();
	void SetTouchScoreValue(int NewValue);
	void SetEndOfGameHidden();
	void InitExplosionFX(class AExplosion_X* InExplosion, class UGoal_TA* ExplosionGoal, class AFXActor_X* ExplosionFX);
	void Explode(class UGoal_TA* ExplosionGoal, const struct FVector& ExplodeLocation, class APRI_TA* Scorer);
	void Destroyed();
	bool ShouldDemolish(class ACar_TA* Car);
	void DoDestroy();
	void DoExplode();
	void OnRigidBodyCollision(const struct FAccumulatedRigidBodyCollision& Collision);
	void Tick(float DeltaTime);
	void RestoreTimeDilation();
	void GetBallTimeDilation();
	void Launch(const struct FVector& LaunchPosition, const struct FVector& LaunchDirection);
	void OnCarTouch(class ACar_TA* HitCar, TEnumAsByte<EBallHitType> HitType);
	void AttachToCar(class ACar_TA* HitCar);
	void RecordCarHit(class ACar_TA* HitCar, const struct FVector& HitLocation, const struct FVector& HitNormal, TEnumAsByte<EBallHitType> HitType);
	void Reset();
	void OnHitWorld(const struct FVector& HitLoc, const struct FVector& HitNormal, class UPhysicalMaterial* PhysMat);
	bool IsGroundMaterial(class UPhysicalMaterial* PhysMat);
	bool IsGroundHit(const struct FVector& HitNormal);
	void FellOutOfWorld(class UClass* dmgType);
	bool IsRoundActive();
	void OnHitGoal(class UGoal_TA* Goal, const struct FVector& HitLoc);
	void SetGameEvent(class AGameEvent_Soccar_TA* SoccarGame);
	void TurnOff();
	void PostBeginPlay();
	void PreBeginPlay();
	void SetBallSloMoDiffSpeed(float InDiffSpeed);
	void SetBallSloMoRadius(float Inradius);
	void SetBallSloMoCooldown(float InCooldown);
	void SetBallSloMoDilation(float InDilation);
	void SetBallSloMoDuration(float InDuration);
	void SetBallMesh(class UStaticMesh* NewMesh);
	void SetWorldBounceScale(float NewScale);
	void SetCarBounceScale(float NewScale);
	void SetBallMaxLinearSpeedScale(float InMaxLinearSpeedScale);
	void SetBallGravityScale(float InBallGravityScale);
	void SetBallScale(float NewScale);
	void ReplicatedEvent(const struct FName& VarName);
	void EventExploded(class ABall_TA* Ball);
	void EventGameEventSet(class ABall_TA* Ball);
	void EventHitGoal(class ABall_TA* Ball, class UGoal_TA* Goal);
	void EventHitGround(class ABall_TA* Ball, const struct FVector& HitLoc, const struct FVector& HitNormal);
	void EventHitWorld(class ABall_TA* Ball, const struct FVector& HitLoc, const struct FVector& HitNormal);
	void EventCarTouch(class ABall_TA* Ball, class ACar_TA* HitCar, TEnumAsByte<EBallHitType> HitType);
};


// Class TAGame.BallTrajectoryComponent_TA
// 0x0054 (0x00C0 - 0x006C)
class UBallTrajectoryComponent_TA : public UActorComponent_X
{
public:
	unsigned long                                      bEnabled : 1;                                             // 0x006C(0x0004) (CPF_Transient)
	unsigned long                                      bCalculatePoints : 1;                                     // 0x006C(0x0004) (CPF_Transient)
	TArray<struct FVector>                             TrajectoryPoints;                                         // 0x0070(0x000C) (CPF_NeedCtorLink)
	struct FTrajectorySetup                            TrajectorySettings;                                       // 0x007C(0x0014)
	float                                              TotalPathDistance;                                        // 0x0090(0x0004) (CPF_Transient)
	struct FVector                                     StartLocation;                                            // 0x0094(0x000C) (CPF_Transient)
	struct FVector                                     StartVelocity;                                            // 0x00A0(0x000C) (CPF_Transient)
	float                                              TrajectoryUpdateTime;                                     // 0x00AC(0x0004) (CPF_Transient)
	struct FScriptDelegate                             __EventTrajectoryEnabledChanged__Delegate;                // 0x00B0(0x0010) (CPF_NeedCtorLink)

	static UClass* StaticClass()
	{
		static auto ptr = UObject::FindClass("Class TAGame.BallTrajectoryComponent_TA");
		return ptr;
	}


	int GetTrajectoryFXCount();
	void DestroyFXs();
	void SetupFXs();
	class APlayerController_TA* GetPlayer(int LocalPlayerNum);
	TArray<class APlayerController_TA*> GetViewers();
	void CheckShouldShowTrajectory();
	float GetTrajectoryScale();
	void UpdateTrajectoryPrediction(bool bForceUpdate);
	void OnEnabledChanged();
	void SetEnable(bool bEnable);
	void HandleGameStateChanged(class AGameEvent_TA* InGameEvent);
	void OnGameEventSet(class ABall_TA* Ball);
	void HandlePlayerAimAssistChanged(class UProfile_TA* Profile);
	void HandleLocalPlayersChanged(class AGameEvent_TA* InGameEvent);
	void Detached();
	void BeginPlay();
	void EventTrajectoryEnabledChanged(class ABall_TA* Ball);
};


// Class TAGame.BallTrajectoryComponent_Line_TA
// 0x0008 (0x00C8 - 0x00C0)
class UBallTrajectoryComponent_Line_TA : public UBallTrajectoryComponent_TA
{
public:
	unsigned long                                      bTrajectoryPointsNeedUpdated : 1;                         // 0x00C0(0x0004) (CPF_Transient)
	struct FColor                                      LineColor;                                                // 0x00C4(0x0004)

	static UClass* StaticClass()
	{
		static auto ptr = UObject::FindClass("Class TAGame.BallTrajectoryComponent_Line_TA");
		return ptr;
	}


	void DestroyFX(int Index);
	void CreateFX(int Index, TArray<class APlayerController_TA*>* Viewers);
	void DestroyFXs();
	void SetupFXs();
};


// Class TAGame.BallTrajectoryComponent_Beam_TA
// 0x0010 (0x00D8 - 0x00C8)
class UBallTrajectoryComponent_Beam_TA : public UBallTrajectoryComponent_Line_TA
{
public:
	TArray<struct FTrajectoryFX>                       TrajectoryFXs;                                            // 0x00C8(0x000C) (CPF_Transient, CPF_Component, CPF_NeedCtorLink)
	class UParticleSystem*                             ParticleBeamArchetype;                                    // 0x00D4(0x0004)

	static UClass* StaticClass()
	{
		static auto ptr = UObject::FindClass("Class TAGame.BallTrajectoryComponent_Beam_TA");
		return ptr;
	}


	int GetTrajectoryFXCount();
	void DestroyFX(int Index);
	void DestroyFXs();
	void CreateFX(int Index, TArray<class APlayerController_TA*>* Viewers);
};


// Class TAGame.BallTrajectoryComponent_Spline_TA
// 0x001C (0x00E4 - 0x00C8)
class UBallTrajectoryComponent_Spline_TA : public UBallTrajectoryComponent_Line_TA
{
public:
	TArray<struct FTrajectorySplineFX>                 TrajectoryFXs;                                            // 0x00C8(0x000C) (CPF_Transient, CPF_NeedCtorLink)
	class ASplineLoftActorSpawnable_TA*                SplineArchetype;                                          // 0x00D4(0x0004)
	float                                              TangentMultiplier;                                        // 0x00D8(0x0004)
	float                                              PulseMultiplier;                                          // 0x00DC(0x0004)
	float                                              MinInterpSpeed;                                           // 0x00E0(0x0004)

	static UClass* StaticClass()
	{
		static auto ptr = UObject::FindClass("Class TAGame.BallTrajectoryComponent_Spline_TA");
		return ptr;
	}


	int GetTrajectoryFXCount();
	void DestroyFX(int Index);
	void DestroyFXs();
	void CreateFX(int Index, TArray<class APlayerController_TA*>* Viewers);
	void SetupFXs();
};


// Class TAGame.BallTrajectoryComponent_Mesh_TA
// 0x0034 (0x00F4 - 0x00C0)
class UBallTrajectoryComponent_Mesh_TA : public UBallTrajectoryComponent_TA
{
public:
	TArray<struct FMeshInfo>                           InterpMeshes;                                             // 0x00C0(0x000C) (CPF_Component, CPF_NeedCtorLink)
	class UMaterialInstanceConstant*                   MIC;                                                      // 0x00CC(0x0004) (CPF_Transient)
	class UStaticMesh*                                 StaticMesh;                                               // 0x00D0(0x0004)
	struct FColor                                      BeamColor_Max;                                            // 0x00D4(0x0004)
	struct FColor                                      BeamColor_Mid;                                            // 0x00D8(0x0004)
	struct FColor                                      BeamColor_Min;                                            // 0x00DC(0x0004)
	float                                              MinInterpSpeed;                                           // 0x00E0(0x0004)
	float                                              MeshScale;                                                // 0x00E4(0x0004)
	float                                              MeshMoveSpeed;                                            // 0x00E8(0x0004)
	float                                              MeshRotateSpeed;                                          // 0x00EC(0x0004)
	float                                              TrajectoryPlayTestScale;                                  // 0x00F0(0x0004)

	static UClass* StaticClass()
	{
		static auto ptr = UObject::FindClass("Class TAGame.BallTrajectoryComponent_Mesh_TA");
		return ptr;
	}


	struct FLinearColor GetBeamColor(float VelocityPower);
	void HandleVelocityStartSpeedChanged(class ABall_GameEditor_TA* Ball);
	void SetupBallEditorMaterial();
	float GetTrajectoryScale();
	float GetMeshScale(int MeshIndex);
	int GetTrajectoryFXCount();
	void DestroyFXs();
	void SetupFXs();
};


// Class TAGame.BoostMesh_TA
// 0x0020 (0x005C - 0x003C)
class UBoostMesh_TA : public UObject
{
public:
	struct FRandomRange                                FadeInTime;                                               // 0x003C(0x0008) (CPF_Edit)
	struct FRandomRange                                FadeOutTime;                                              // 0x0044(0x0008) (CPF_Edit)
	TArray<struct FAnimatedMaterialMesh>               MaterialParams;                                           // 0x004C(0x000C) (CPF_Edit, CPF_Component, CPF_NeedCtorLink)
	float                                              MaxMaterialTime;                                          // 0x0058(0x0004) (CPF_Transient)

	static UClass* StaticClass()
	{
		static auto ptr = UObject::FindClass("Class TAGame.BoostMesh_TA");
		return ptr;
	}


	void ApplyPaint(class UProductAttribute_PaintSettings_TA* PaintSettings, class UProductPaint_TA* Paint);
	void ApplyLinearColorParameter(class UActorComponent* Component, const struct FName& Param, const struct FLinearColor& InColor);
	void ApplyColorParameter(class UActorComponent* Component, const struct FName& Param, const struct FVector& Value, float Alpha);
	void ApplyVectorParameter(class UActorComponent* Component, const struct FName& Param, const struct FVector& Value);
	void ApplyFloatParameter(class UActorComponent* Component, const struct FName& Param, float Value);
	void ApplyMaterialOverride(class UMaterialInterface* Override, int Index);
	void FadeOut();
	void FadeIn();
	void ResetElapsedTime(float Value);
	void CopyBoostMeshDistributionParameters(class AFXActor_Boost_TA* Archetype);
	void Update(float DeltaTime);
	void Initialize(class AFXActor_X* FXActor);
};


// Class TAGame.BreakOutActor_Platform_TA
// 0x0084 (0x0280 - 0x01FC)
class ABreakOutActor_Platform_TA : public AActor
{
public:
	int                                                Sides;                                                    // 0x01FC(0x0004) (CPF_Edit)
	unsigned long                                      bPrimaryPlayerStart : 1;                                  // 0x0200(0x0004) (CPF_Edit)
	int                                                TeamIndex;                                                // 0x0204(0x0004) (CPF_Edit)
	int                                                MaxDamage;                                                // 0x0208(0x0004) (CPF_Edit)
	class UStaticMeshComponent*                        StaticMeshComponent;                                      // 0x020C(0x0004) (CPF_Edit, CPF_Const, CPF_ExportObject, CPF_EditConst, CPF_Component, CPF_EditInline)
	class UDynamicLightEnvironmentComponent*           LightEnvironment;                                         // 0x0210(0x0004) (CPF_Edit, CPF_Const, CPF_ExportObject, CPF_EditConst, CPF_Component, CPF_EditInline)
	class AFXActor_X*                                  FXArchetype;                                              // 0x0214(0x0004) (CPF_Edit)
	float                                              NeighborRadius;                                           // 0x0218(0x0004) (CPF_Edit)
	TArray<class ABreakOutActor_Platform_TA*>          Neighbors;                                                // 0x021C(0x000C) (CPF_Edit, CPF_EditConst, CPF_NeedCtorLink)
	float                                              LastHitTime;                                              // 0x0228(0x0004)
	struct FBreakoutDamageState                        DamageState;                                              // 0x022C(0x0018) (CPF_Net)
	class AFXActor_X*                                  FXActor;                                                  // 0x0244(0x0004)
	struct FBreakoutDamageState                        PreReplayState;                                           // 0x0248(0x0018) (CPF_Transient)
	struct FScriptDelegate                             __EventDamageStateChanged__Delegate;                      // 0x0260(0x0010) (CPF_NeedCtorLink)
	struct FScriptDelegate                             __EventDamaged__Delegate;                                 // 0x0270(0x0010) (CPF_NeedCtorLink)

	static UClass* StaticClass()
	{
		static auto ptr = UObject::FindClass("Class TAGame.BreakOutActor_Platform_TA");
		return ptr;
	}


	void SetPreReplayState();
	void SavePreReplayState();
	void STATIC_GatherNeighbors(class ABreakOutActor_Platform_TA* Start, int Iterations, TArray<class ABreakOutActor_Platform_TA*>* ToDamage);
	void HandleTeamColorsChanged(class ATeam_TA* Team);
	void HandleTeamRemoved(class UObject* TeamObj);
	void HandleTeamAdded(class UObject* TeamObj);
	bool IsBroken();
	bool IsDamaged();
	void Reset();
	void SetDamageState(unsigned char InDamageState, class APRI_TA* InDamageCauser, const struct FVector& InLocation, bool bDirectDamage, bool bImmediate);
	void IncreaseDamage(class APRI_TA* DamageCauser, const struct FVector& FromLocation, bool bDirectDamage);
	bool NeighborDamage(class ABall_TA* Ball, int InDamage, const struct FVector& HitLocation);
	bool OnBallHit(class ABall_TA* Ball, int InDamage, const struct FVector& HitNormal, const struct FVector& InVelocity, const struct FVector& HitLocation);
	void ReInitPhysics();
	void ReInitPhysicsDelayed();
	void InitFX();
	void PostBeginPlay();
	void ReplicatedEvent(const struct FName& VarName);
	void EventDamaged(class ABreakOutActor_Platform_TA* Platform, class APRI_TA* PRI, class ABall_TA* Ball);
	void EventDamageStateChanged(class ABreakOutActor_Platform_TA* Platform, const struct FBreakoutDamageState& InState);
};


// Class TAGame.BTComponent
// 0x004C (0x0094 - 0x0048)
class UBTComponent : public UComponent
{
public:
	class UBTNode*                                     Root;                                                     // 0x0048(0x0004) (CPF_Edit, CPF_Const)
	TEnumAsByte<EBTStatus>                             RootStatus;                                               // 0x004C(0x0001) (CPF_Const, CPF_Transient)
	class AAIController_TA*                            AI;                                                       // 0x0050(0x0004) (CPF_Transient)
	unsigned long                                      bPrintStatusLogs : 1;                                     // 0x0054(0x0004) (CPF_Edit)
	unsigned long                                      bDirtyStatusLogs : 1;                                     // 0x0054(0x0004) (CPF_Transient)
	unsigned long                                      bEvaluatingConditions : 1;                                // 0x0054(0x0004) (CPF_Const, CPF_Transient)
	unsigned long                                      bPauseNextTick : 1;                                       // 0x0054(0x0004) (CPF_Transient)
	TArray<struct FBTStatusLog>                        StatusLogs;                                               // 0x0058(0x000C) (CPF_Const, CPF_Transient, CPF_NeedCtorLink)
	int                                                StatusLogsIndex;                                          // 0x0064(0x0004) (CPF_Const, CPF_Transient)
	TArray<int>                                        StatusLogsStack;                                          // 0x0068(0x000C) (CPF_Const, CPF_Transient, CPF_NeedCtorLink)
	class UDebugDrawer_X*                              CanvasDrawer;                                             // 0x0074(0x0004) (CPF_Transient)
	TArray<struct FBTDynamicLinkData>                  DynamicLinks;                                             // 0x0078(0x000C) (CPF_Transient, CPF_NeedCtorLink)
	struct FScriptDelegate                             __EventDynamicLinksChanged__Delegate;                     // 0x0084(0x0010) (CPF_NeedCtorLink)

	static UClass* StaticClass()
	{
		static auto ptr = UObject::FindClass("Class TAGame.BTComponent");
		return ptr;
	}


	void PrintDebugInfo(class UDebugDrawer* Drawer);
	struct FColor GetStatusColor(TEnumAsByte<EBTStatus> Status);
	struct FString GetDepthSpaces(float Depth);
	void SetDynamicLink(const struct FName& LinkName, class UBTNode* Node);
	void SetRoot(class UBTNode* NewRootArchetype);
	void Abort();
	void Tick(float DeltaTime);
	void Init(class AAIController_TA* ForAI);
	void EventDynamicLinksChanged(class UBTComponent* BT);
};


// Class TAGame.BTLockCollection
// 0x002C (0x0074 - 0x0048)
class UBTLockCollection : public UComponent
{
public:
	TArray<struct FTimedLock>                          Locks;                                                    // 0x0048(0x000C) (CPF_Const, CPF_Transient, CPF_NeedCtorLink)
	struct FScriptDelegate                             __EventLockSet__Delegate;                                 // 0x0054(0x0010) (CPF_NeedCtorLink)
	struct FScriptDelegate                             __EventLockExpired__Delegate;                             // 0x0064(0x0010) (CPF_NeedCtorLink)

	static UClass* StaticClass()
	{
		static auto ptr = UObject::FindClass("Class TAGame.BTLockCollection");
		return ptr;
	}


	void UpdateLocks();
	float GetTimeRemaining(const struct FName& LockName);
	bool IsNameLocked(const struct FName& LockName);
	void RemoveNamedLock(const struct FName& LockName);
	void AddNamedLock(const struct FName& LockName, float ForHowLong);
	void EventLockExpired(const struct FName& LockName);
	void EventLockSet(const struct FName& LockName);
};


// Class TAGame.BTNode
// 0x0014 (0x0050 - 0x003C)
class UBTNode : public UObject
{
public:
	TArray<class UBTDecorator*>                        Decorators;                                               // 0x003C(0x000C) (CPF_Edit, CPF_Const, CPF_NeedCtorLink)
	unsigned long                                      bDebugPause : 1;                                          // 0x0048(0x0004) (CPF_Edit)
	unsigned long                                      bDebug : 1;                                               // 0x0048(0x0004) (CPF_Edit)
	class AAIController_TA*                            AI;                                                       // 0x004C(0x0004) (CPF_Const, CPF_Transient)

	static UClass* StaticClass()
	{
		static auto ptr = UObject::FindClass("Class TAGame.BTNode");
		return ptr;
	}


	void SetStatusString(const struct FString& msg);
};


// Class TAGame.BTCondition
// 0x000C (0x005C - 0x0050)
class UBTCondition : public UBTNode
{
public:
	float                                              UpdateDelay;                                              // 0x0050(0x0004) (CPF_Edit)
	unsigned long                                      bFlipResult : 1;                                          // 0x0054(0x0004) (CPF_Edit)
	unsigned long                                      bDirty : 1;                                               // 0x0054(0x0004) (CPF_Const, CPF_Transient)
	unsigned long                                      CachedResult : 1;                                         // 0x0054(0x0004) (CPF_Const, CPF_Transient)
	float                                              NextUpdateTime;                                           // 0x0058(0x0004) (CPF_Const, CPF_Transient)

	static UClass* StaticClass()
	{
		static auto ptr = UObject::FindClass("Class TAGame.BTCondition");
		return ptr;
	}


	bool ShouldProcessTeam(TEnumAsByte<EAITeam> CheckTeam, int ActorTeam);
	bool ShouldProcessActor(TEnumAsByte<EAITeam> CheckTeam, class AActor* CheckActor);
	void SetDirty();
	bool GetResult();
	void OnInit();
};


// Class TAGame.BTC_Any
// 0x0004 (0x0060 - 0x005C)
class UBTC_Any : public UBTCondition
{
public:
	class UBTTarget*                                   Targets;                                                  // 0x005C(0x0004) (CPF_Edit)

	static UClass* StaticClass()
	{
		static auto ptr = UObject::FindClass("Class TAGame.BTC_Any");
		return ptr;
	}

};


// Class TAGame.BTC_NotAny
// 0x0004 (0x0060 - 0x005C)
class UBTC_NotAny : public UBTCondition
{
public:
	class UBTTarget*                                   Targets;                                                  // 0x005C(0x0004) (CPF_Edit)

